analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_TMR_ACURCNT_Struct
 *! \brief  16-bit timer value, asynchronous Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_ACURCNT_t__
typedef struct _ADI_TMR_ACURCNT_t {
  union {
    struct {
      int16_t VALUE      : 16;  /**< Counter value */
    };
    int16_t VALUE16;
  };
} ADI_TMR_ACURCNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_ACURCNT_t__ */

/*@}*/

/** @defgroup STAT Status (STAT) Register
 *  Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_TMR_STAT_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_STAT_t__
typedef struct _ADI_TMR_STAT_t {
  union {
    struct {
      uint16_t TIMEOUT    :  1;  /**< Timeout event occurred */
      uint16_t CAPTURE    :  1;  /**< Capture event pending */
      uint16_t reserved2  :  4;
      uint16_t BUSY       :  1;  /**< Timer Busy */
      uint16_t PDOK       :  1;  /**< Clear Interrupt Register synchronization */
      uint16_t CNTRST     :  1;  /**< Counter reset occurring */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_TMR_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_STAT_t__ */

/*@}*/

/** @defgroup PWMCTL PWM Control Register (PWMCTL) Register
 *  PWM Control Register (PWMCTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_TMR_PWMCTL_Struct
 *! \brief  PWM Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_PWMCTL_t__
typedef struct _ADI_TMR_PWMCTL_t {
  union {
    struct {
      uint16_t MATCH      :  1;  /**< PWM Match enabled */
      uint16_t IDLESTATE  :  1;  /**< PWM Idle State */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_TMR_PWMCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_PWMCTL_t__ */

/*@}*/

/** @defgroup PWMMATCH PWM Match Value (PWMMATCH) Register
 *  PWM Match Value (PWMMATCH) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_TMR_PWMMATCH_Struct
 *! \brief  PWM Match Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_PWMMATCH_t__
typedef struct _ADI_TMR_PWMMATCH_t {
  union {
    struct {
      int16_t VALUE      : 16;  /**< PWM Match Value */
    };
    int16_t VALUE16;
  };
} ADI_TMR_PWMMATCH_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_PWMMATCH_t__ */

/*@}*/

/** @defgroup CR0 RTC Control 0 (CR0) Register
 *  RTC Control 0 (CR0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_RTC_CR0_MOD60ALM
 *! \brief  Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary (MOD60ALM) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR0_EXAMPLE_1_THIRTY_TIME_UNITS_DECIMAL    = 30,  /**< Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 30 time units past a modulo-60 boundary. */
  RTC_CR0_EXAMPLE_2_FIFTYFIVE_TIME_UNITS_DECIMAL = 55   /**< Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 55 time units past a modulo-60 boundary. */
} ADI_RTC_CR0_MOD60ALM;


/* ==========================================================================
 *! \struct ADI_RTC_CR0_Struct
 *! \brief  RTC Control 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR0_t__
typedef struct _ADI_RTC_CR0_t {
  union {
    struct {
      uint16_t CNTEN      :  1;  /**< Global enable for the RTC */
      uint16_t ALMEN      :  1;  /**< Enable the RTC alarm (absolute) operation */
      uint16_t ALMINTEN   :  1;  /**< Enable sourced alarm interrupts to the CPU */
      uint16_t TRMEN      :  1;  /**< Enable RTC digital trimming */
      uint16_t MOD60ALMEN :  1;  /**< Enable RTC modulo-60 counting of time past a modulo-60 boundary */
      uint16_t MOD60ALM   :  6;  /**< Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary */
      uint16_t MOD60ALMINTEN :  1;  /**< Enable periodic Modulo-60 RTC alarm sourced interrupts to the CPU */
      uint16_t ISOINTEN      :  1;  /**< Enable RTC power-domain isolation sourced interrupts to the CPU when isolation of the RTC power domain is activated and subsequently de-activated */
      uint16_t WPNDERRINTEN  :  1;  /**< Enable Write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs */
      uint16_t WSYNCINTEN    :  1;  /**< Enable Write synchronization sourced interrupts to the CPU */
      uint16_t WPNDINTEN     :  1;  /**< Enable Write Pending sourced interrupts to the CPU */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR0_t__ */

/*@}*/

/** @defgroup SR0 RTC Status 0 (SR0) Register
 *  RTC Status 0 (SR0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR0_Struct
 *! \brief  RTC Status 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR0_t__
typedef struct _ADI_RTC_SR0_t {
  union {
    struct {
      uint16_t reserved0  :  1;
      uint16_t ALMINT     :  1;  /**< Alarm interrupt source */
      uint16_t MOD60ALMINT :  1;  /**< Modulo-60 RTC alarm interrupt source */
      uint16_t ISOINT      :  1;  /**< RTC power-domain isolation interrupt source */
      uint16_t WPNDERRINT  :  1;  /**< Write pending error interrupt source */
      uint16_t WSYNCINT    :  1;  /**< Write synchronization interrupt */
      uint16_t WPNDINT     :  1;  /**< Write pending interrupt */
      uint16_t WSYNCCR0    :  1;  /**< Synchronization status of posted writes to RTC Control 0 Register */
      uint16_t WSYNCSR0    :  1;  /**< Synchronization status of posted clearances to interrupt sources in RTC Status 0 Register */
      uint16_t WSYNCCNT0   :  1;  /**< Synchronization status of posted writes to RTC Count 0 Register */
      uint16_t WSYNCCNT1   :  1;  /**< Synchronization status of posted writes to RTC Count 1 Register */
      uint16_t WSYNCALM0   :  1;  /**< Synchronization status of posted writes to RTC Alarm 0 Register */
      uint16_t WSYNCALM1   :  1;  /**< Synchronization status of posted writes to RTC Alarm 1 Register */
      uint16_t WSYNCTRM    :  1;  /**< Synchronization status of posted writes to RTC Trim Register */
      uint16_t ISOENB      :  1;  /**< Visibility status of 32 kHz sourced registers, taking account of power-domain isolation */
      uint16_t reserved15  :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR0_t__ */

/*@}*/

