analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_SR3_Struct
 *! \brief  RTC Status 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR3_t__
typedef struct _ADI_RTC_SR3_t {
  union {
    struct {
      uint16_t RTCIC0IRQ  :  1;  /**< Sticky Interrupt Source for the RTC Input Capture Channel 0 */
      uint16_t reserved1  :  1;
      uint16_t RTCIC2IRQ  :  1;  /**< Sticky Interrupt Source for the RTC Input Capture Channel 2 */
      uint16_t RTCIC3IRQ  :  1;  /**< Sticky Interrupt Source for the RTC Input Capture Channel 3 */
      uint16_t RTCIC4IRQ  :  1;  /**< Sticky Interrupt Source for the RTC Input Capture Channel 4 */
      uint16_t reserved5  :  3;
      uint16_t ALMINTMIR  :  1;  /**< Read-only mirror of the ALMINT interrupt source in RTC Status 0 Register, acting as RTCOC0IRQ */
      uint16_t RTCOC1IRQ  :  1;  /**< Sticky Interrupt Source for Output Compare Channel 1 */
      uint16_t reserved10 :  6;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR3_t__ */

/*@}*/

/** @defgroup CR2IC RTC Control 2 for Configuring Input Capture Channels (CR2IC) Register
 *  RTC Control 2 for Configuring Input Capture Channels (CR2IC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR2IC_Struct
 *! \brief  RTC Control 2 for Configuring Input Capture Channels Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR2IC_t__
typedef struct _ADI_RTC_CR2IC_t {
  union {
    struct {
      uint16_t RTCIC0EN   :  1;  /**< Enable for the RTC Input Capture Channel 0 */
      uint16_t reserved1  :  1;
      uint16_t RTCIC2EN   :  1;  /**< Enable for the RTC Input Capture Channel 2 */
      uint16_t RTCIC3EN   :  1;  /**< Enable for the RTC Input Capture Channel 3 */
      uint16_t RTCIC4EN   :  1;  /**< Enable for the RTC Input Capture Channel 4 */
      uint16_t RTCIC0LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */
      uint16_t reserved6  :  1;
      uint16_t RTCIC2LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */
      uint16_t RTCIC3LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */
      uint16_t RTCIC4LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */
      uint16_t RTCIC0IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 0 */
      uint16_t reserved11  :  1;
      uint16_t RTCIC2IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 2 */
      uint16_t RTCIC3IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 3 */
      uint16_t RTCIC4IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 4 */
      uint16_t RTCICOWUSEN :  1;  /**< Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR2IC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR2IC_t__ */

/*@}*/

/** @defgroup CR3OC RTC Control 3 for Configuring Output Compare Channel (CR3OC) Register
 *  RTC Control 3 for Configuring Output Compare Channel (CR3OC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR3OC_Struct
 *! \brief  RTC Control 3 for Configuring Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR3OC_t__
typedef struct _ADI_RTC_CR3OC_t {
  union {
    struct {
      uint16_t reserved0  :  1;
      uint16_t RTCOC1EN   :  1;  /**< Enable for Output Compare Channel 1 */
      uint16_t reserved2   :  7;
      uint16_t RTCOC1IRQEN :  1;  /**< Interrupt Enable for Output Compare Channel 1 */
      uint16_t reserved10  :  6;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR3OC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR3OC_t__ */

/*@}*/

/** @defgroup CR4OC RTC Control 4 for Configuring Output Compare Channel (CR4OC) Register
 *  RTC Control 4 for Configuring Output Compare Channel (CR4OC) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_RTC_CR4OC_RTCOC1MSKEN
 *! \brief  Enable for thermometer-code masking of the Output Compare 1 Channel (RTCOC1MSKEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR4OC_EN000 = 0,  /**< Do not apply a mask to the 16-bit Output Compare channel OC1.                                                                 */
  RTC_CR4OC_EN001 = 1   /**< Apply a thermometer-decoded mask to the 16-bit Output Compare channel OC1 provided that channel is enabled via CR3OC:RTCOC1EN */
} ADI_RTC_CR4OC_RTCOC1MSKEN;


/* ==========================================================================
 *! \struct ADI_RTC_CR4OC_Struct
 *! \brief  RTC Control 4 for Configuring Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR4OC_t__
typedef struct _ADI_RTC_CR4OC_t {
  union {
    struct {
      uint16_t reserved0   :  1;
      uint16_t RTCOC1MSKEN :  1;  /**< Enable for thermometer-code masking of the Output Compare 1 Channel */
      uint16_t reserved2   :  7;
      uint16_t RTCOC1ARLEN :  1;  /**< Enable for auto-reloading when output compare match occurs */
      uint16_t reserved10  :  6;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR4OC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR4OC_t__ */

/*@}*/

/** @defgroup OCMSK RTC Masks for Output Compare Channel (OCMSK) Register
 *  RTC Masks for Output Compare Channel (OCMSK) Register.
 *  @{
 */

