analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_OCMSK_Struct
 *! \brief  RTC Masks for Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OCMSK_t__
typedef struct _ADI_RTC_OCMSK_t {
  union {
    struct {
      uint16_t RTCOCMSK   : 16;  /**< Concatenation of thermometer-encoded masks for the 16-bit output compare channels */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OCMSK_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OCMSK_t__ */

/*@}*/

/** @defgroup OC1ARL RTC Auto-Reload for Output Compare Channel 1 (OC1ARL) Register
 *  RTC Auto-Reload for Output Compare Channel 1 (OC1ARL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_OC1ARL_Struct
 *! \brief  RTC Auto-Reload for Output Compare Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OC1ARL_t__
typedef struct _ADI_RTC_OC1ARL_t {
  union {
    struct {
      uint16_t RTCOC1ARL  : 16;  /**< Auto-reload value when output compare match occurs */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OC1ARL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OC1ARL_t__ */

/*@}*/

/** @defgroup IC2 RTC Input Capture Channel 2 (IC2) Register
 *  RTC Input Capture Channel 2 (IC2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC2_Struct
 *! \brief  RTC Input Capture Channel 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC2_t__
typedef struct _ADI_RTC_IC2_t {
  union {
    struct {
      uint16_t RTCIC2     : 16;  /**< RTC Input Capture Channel 2 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC2_t__ */

/*@}*/

/** @defgroup IC3 RTC Input Capture Channel 3 (IC3) Register
 *  RTC Input Capture Channel 3 (IC3) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC3_Struct
 *! \brief  RTC Input Capture Channel 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC3_t__
typedef struct _ADI_RTC_IC3_t {
  union {
    struct {
      uint16_t RTCIC3     : 16;  /**< RTC Input Capture Channel 3 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC3_t__ */

/*@}*/

/** @defgroup IC4 RTC Input Capture Channel 4 (IC4) Register
 *  RTC Input Capture Channel 4 (IC4) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC4_Struct
 *! \brief  RTC Input Capture Channel 4 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC4_t__
typedef struct _ADI_RTC_IC4_t {
  union {
    struct {
      uint16_t RTCIC4     : 16;  /**< RTC Input Capture Channel 4 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC4_t__ */

/*@}*/

/** @defgroup OC1 RTC Output Compare Channel 1 (OC1) Register
 *  RTC Output Compare Channel 1 (OC1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_OC1_Struct
 *! \brief  RTC Output Compare Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OC1_t__
typedef struct _ADI_RTC_OC1_t {
  union {
    struct {
      uint16_t RTCOC1     : 16;  /**< RTC Output Compare 1 Channel. Scheduled alarm target time with optional auto-reload */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OC1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OC1_t__ */

/*@}*/

/** @defgroup SR4 RTC Status 4 (SR4) Register
 *  RTC Status 4 (SR4) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR4_Struct
 *! \brief  RTC Status 4 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR4_t__
typedef struct _ADI_RTC_SR4_t {
  union {
    struct {
      uint16_t WSYNCSR3   :  1;  /**< Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register */
      uint16_t WSYNCCR2IC :  1;  /**< Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
      uint16_t WSYNCCR3OC :  1;  /**< Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
      uint16_t WSYNCCR4OC :  1;  /**< Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
      uint16_t WSYNCOCMSK :  1;  /**< Synchronization status of posted writes to RTC Masks for Output Compare Channel Register */
      uint16_t WSYNCOC1ARL :  1;  /**< Synchronization status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
      uint16_t WSYNCOC1    :  1;  /**< Synchronization status of posted writes to RTC Output Compare Channel 1 Register */
      uint16_t reserved7   :  3;
      uint16_t RSYNCIC0    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 0 */
      uint16_t reserved11  :  1;
      uint16_t RSYNCIC2    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 2 */
      uint16_t RSYNCIC3    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 3 */
      uint16_t RSYNCIC4    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 4 */
      uint16_t reserved15  :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR4_t__ */

/*@}*/

