analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup SR5 RTC Status 5 (SR5) Register
 *  RTC Status 5 (SR5) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR5_Struct
 *! \brief  RTC Status 5 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR5_t__
typedef struct _ADI_RTC_SR5_t {
  union {
    struct {
      uint16_t WPNDSR0    :  1;  /**< Pending status of posted clearances of interrupt sources in RTC Status 3 Register */
      uint16_t WPENDCR2IC :  1;  /**< Pending status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
      uint16_t WPENDCR3OC :  1;  /**< Pending status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
      uint16_t WPENDCR4OC :  1;  /**< Pending status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
      uint16_t WPENDOCMSK :  1;  /**< Pending status of posted writes to RTC Masks for Output Compare Channel Register */
      uint16_t WPENDOC1ARL :  1;  /**< Pending status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
      uint16_t WPENDOC1    :  1;  /**< Pending status of posted writes to Output Compare Channel 1 */
      uint16_t reserved7   :  3;
      uint16_t RPENDIC0    :  1;  /**< Pending status of posted reads of RTC Input Channel 0 */
      uint16_t reserved11  :  1;
      uint16_t RPENDIC2    :  1;  /**< Pending status of posted reads of RTC Input Channel 2 */
      uint16_t RPENDIC3    :  1;  /**< Pending status of posted reads of RTC Input Channel 3 */
      uint16_t RPENDIC4    :  1;  /**< Pending status of posted reads of RTC Input Channel 4 */
      uint16_t reserved15  :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR5_t__ */

/*@}*/

/** @defgroup SR6 RTC Status 6 (SR6) Register
 *  RTC Status 6 (SR6) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR6_Struct
 *! \brief  RTC Status 6 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR6_t__
typedef struct _ADI_RTC_SR6_t {
  union {
    struct {
      uint16_t RTCIC0UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 0 */
      uint16_t reserved1  :  1;
      uint16_t RTCIC2UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 2 */
      uint16_t RTCIC3UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 3 */
      uint16_t RTCIC4UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 4 */
      uint16_t reserved5  :  3;
      uint16_t RTCIC0SNAP :  1;  /**< Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0 */
      uint16_t RTCFRZCNTPTR :  2;  /**< Pointer for the triple-read sequence of the RTC Freeze Count MMR */
      uint16_t reserved11   :  5;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR6_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR6_t__ */

/*@}*/

/** @defgroup OC1TGT RTC Output Compare Channel 1 Target (OC1TGT) Register
 *  RTC Output Compare Channel 1 Target (OC1TGT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_OC1TGT_Struct
 *! \brief  RTC Output Compare Channel 1 Target Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OC1TGT_t__
typedef struct _ADI_RTC_OC1TGT_t {
  union {
    struct {
      uint16_t RTCOC1TGT  : 16;  /**< Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OC1TGT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OC1TGT_t__ */

/*@}*/

/** @defgroup FRZCNT RTC Freeze Count (FRZCNT) Register
 *  RTC Freeze Count (FRZCNT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_FRZCNT_Struct
 *! \brief  RTC Freeze Count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_FRZCNT_t__
typedef struct _ADI_RTC_FRZCNT_t {
  union {
    struct {
      uint16_t RTCFRZCNT  : 16;  /**< RTC Freeze Count */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_FRZCNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_FRZCNT_t__ */

/*@}*/

/** @defgroup ADIID ADI Identification (ADIID) Register
 *  ADI Identification (ADIID) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SYS_ADIID_Struct
 *! \brief  ADI Identification Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SYS_ADIID_t__
typedef struct _ADI_SYS_ADIID_t {
  union {
    struct {
      uint16_t VALUE      : 16;  /**< Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part */
    };
    uint16_t VALUE16;
  };
} ADI_SYS_ADIID_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SYS_ADIID_t__ */

/*@}*/

/** @defgroup CHIPID Chip Identifier (CHIPID) Register
 *  Chip Identifier (CHIPID) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SYS_CHIPID_Struct
 *! \brief  Chip Identifier Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SYS_CHIPID_t__
typedef struct _ADI_SYS_CHIPID_t {
  union {
    struct {
      uint16_t REV        :  4;  /**< Silicon revision */
      uint16_t PARTID     : 12;  /**< Part identifier */
    };
    uint16_t VALUE16;
  };
} ADI_SYS_CHIPID_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SYS_CHIPID_t__ */

/*@}*/

/** @defgroup SWDEN Serial Wire Debug Enable (SWDEN) Register
 *  Serial Wire Debug Enable (SWDEN) Register.
 *  @{
 */

