analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_SYS_SWDEN_Struct
 *! \brief  Serial Wire Debug Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SYS_SWDEN_t__
typedef struct _ADI_SYS_SWDEN_t {
  union {
    struct {
      uint16_t VALUE      : 16;  /**< To enable SWD interface */
    };
    uint16_t VALUE16;
  };
} ADI_SYS_SWDEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SYS_SWDEN_t__ */

/*@}*/

/** @defgroup LOAD Load value (LOAD) Register
 *  Load value (LOAD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_WDT_LOAD_Struct
 *! \brief  Load value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_LOAD_t__
typedef struct _ADI_WDT_LOAD_t {
  union {
    struct {
      int16_t VALUE      : 16;  /**< Load value */
    };
    int16_t VALUE16;
  };
} ADI_WDT_LOAD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_LOAD_t__ */

/*@}*/

/** @defgroup CCNT Current count value (CCNT) Register
 *  Current count value (CCNT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_WDT_CCNT_Struct
 *! \brief  Current count value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_CCNT_t__
typedef struct _ADI_WDT_CCNT_t {
  union {
    struct {
      int16_t VALUE      : 16;  /**< Current count value */
    };
    int16_t VALUE16;
  };
} ADI_WDT_CCNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_CCNT_t__ */

/*@}*/

/** @defgroup CTL Control (CTL) Register
 *  Control (CTL) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_WDT_CTL_PRE
 *! \brief  Prescaler (PRE) Enumerations
 *  ========================================================================= */
typedef enum
{
  WDT_CTL_DIV1     = 0,  /**< source clock/1.             */
  WDT_CTL_DIV16    = 1,  /**< source clock/16.            */
  WDT_CTL_DIV256   = 2,  /**< source clock/256 (default). */
  WDT_CTL_RESERVED = 3   /**< Reserved                    */
} ADI_WDT_CTL_PRE;


/* ==========================================================================
 *! \struct ADI_WDT_CTL_Struct
 *! \brief  Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_CTL_t__
typedef struct _ADI_WDT_CTL_t {
  union {
    struct {
      uint16_t reserved0  :  1;
      uint16_t IRQ        :  1;  /**< Timer interrupt */
      uint16_t PRE        :  2;  /**< Prescaler */
      uint16_t reserved4  :  1;
      uint16_t EN         :  1;  /**< Timer enable */
      uint16_t MODE       :  1;  /**< Timer mode */
      uint16_t SPARE      :  1;  /**< Unused spare bit */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_WDT_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_CTL_t__ */

/*@}*/

/** @defgroup RESTART Clear interrupt (RESTART) Register
 *  Clear interrupt (RESTART) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_WDT_RESTART_Struct
 *! \brief  Clear interrupt Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_RESTART_t__
typedef struct _ADI_WDT_RESTART_t {
  union {
    struct {
      int16_t CLRWORD    : 16;  /**< Clear watchdog */
    };
    int16_t VALUE16;
  };
} ADI_WDT_RESTART_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_RESTART_t__ */

/*@}*/

/** @defgroup STAT Status (STAT) Register
 *  Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_WDT_STAT_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_STAT_t__
typedef struct _ADI_WDT_STAT_t {
  union {
    struct {
      uint16_t IRQ        :  1;  /**< WDT Interrupt */
      uint16_t CLRIRQ     :  1;  /**< Clear Interrupt Register write sync in progress */
      uint16_t LOADING    :  1;  /**< Load Register write sync in progress */
      uint16_t COUNTING   :  1;  /**< Control Register write sync in progress */
      uint16_t LOCKED     :  1;  /**< Lock status bit */
      uint16_t RSTCTL     :  1;  /**< Reset Control Register written and locked */
      uint16_t reserved6  : 10;
    };
    uint16_t VALUE16;
  };
} ADI_WDT_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_STAT_t__ */

/*@}*/

/** @defgroup MCTL Master control (MCTL) Register
 *  Master control (MCTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_MCTL_Struct
 *! \brief  Master control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MCTL_t__
typedef struct _ADI_I2C_MCTL_t {
  union {
    struct {
      uint16_t MASEN      :  1;  /**< Master enable */
      uint16_t COMPLETE   :  1;  /**< Start back-off disable */
      uint16_t LOOPBACK   :  1;  /**< Internal loopback enable */
      uint16_t STRETCHSCL :  1;  /**< Stretch SCL enable */
      uint16_t IENMRX     :  1;  /**< Receive request interrupt enable */
      uint16_t IENMTX     :  1;  /**< Transmit request interrupt enable. */
      uint16_t IENALOST   :  1;  /**< Arbitration lost interrupt enable */
      uint16_t IENACK     :  1;  /**< ACK not received interrupt enable */
      uint16_t IENCMP     :  1;  /**< Transaction completed (or stop detected) interrupt enable */
      uint16_t MXMITDEC   :  1;  /**< Decrement master TX FIFO status when a byte has been transmitted */
      uint16_t MRXDMA     :  1;  /**< Enable master Rx DMA request */
      uint16_t MTXDMA     :  1;  /**< Enable master Tx DMA request */
      uint16_t BUSCLR     :  1;  /**< Bus-Clear Enable */
      uint16_t STOPBUSCLR :  1;  /**< Prestop Bus-Clear */
      uint16_t reserved14 :  2;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MCTL_t__ */

/*@}*/

/** @defgroup MSTAT Master status (MSTAT) Register
 *  Master status (MSTAT) Register.
 *  @{
 */

