analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_I2C_MSTAT_Struct
 *! \brief  Master status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MSTAT_t__
typedef struct _ADI_I2C_MSTAT_t {
  union {
    struct {
      uint16_t MTXF       :  2;  /**< Master Transmit FIFO status */
      uint16_t MTXREQ     :  1;  /**< When read is master Transmit request; when write is Clear master transmit interrupt bit */
      uint16_t MRXREQ     :  1;  /**< Master Receive request */
      uint16_t NACKADDR   :  1;  /**< ACK not received in response to an address */
      uint16_t ALOST      :  1;  /**< Arbitration lost */
      uint16_t MBUSY      :  1;  /**< Master busy */
      uint16_t NACKDATA   :  1;  /**< ACK not received in response to data write */
      uint16_t TCOMP      :  1;  /**< Transaction complete or stop detected */
      uint16_t MRXOVR     :  1;  /**< Master Receive FIFO overflow */
      uint16_t LINEBUSY   :  1;  /**< Line is busy */
      uint16_t MSTOP      :  1;  /**< STOP driven by this I2C Master */
      uint16_t MTXUNDR    :  1;  /**< Master Transmit Underflow */
      uint16_t SDAFILT    :  1;  /**< State of SDA Line */
      uint16_t SCLFILT    :  1;  /**< State of SCL Line */
      uint16_t reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MSTAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MSTAT_t__ */

/*@}*/

/** @defgroup MRX Master receive data (MRX) Register
 *  Master receive data (MRX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_MRX_Struct
 *! \brief  Master receive data Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MRX_t__
typedef struct _ADI_I2C_MRX_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Master receive register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MRX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MRX_t__ */

/*@}*/

/** @defgroup MTX Master transmit data (MTX) Register
 *  Master transmit data (MTX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_MTX_Struct
 *! \brief  Master transmit data Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MTX_t__
typedef struct _ADI_I2C_MTX_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Master transmit register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MTX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MTX_t__ */

/*@}*/

/** @defgroup MRXCNT Master receive data count (MRXCNT) Register
 *  Master receive data count (MRXCNT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_MRXCNT_Struct
 *! \brief  Master receive data count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MRXCNT_t__
typedef struct _ADI_I2C_MRXCNT_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Receive count */
      uint16_t EXTEND     :  1;  /**< Extended read */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MRXCNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MRXCNT_t__ */

/*@}*/

/** @defgroup MCRXCNT Master current receive data count (MCRXCNT) Register
 *  Master current receive data count (MCRXCNT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_MCRXCNT_Struct
 *! \brief  Master current receive data count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_MCRXCNT_t__
typedef struct _ADI_I2C_MCRXCNT_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Current receive count */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_MCRXCNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_MCRXCNT_t__ */

/*@}*/

/** @defgroup ADDR1 1st master address byte (ADDR1) Register
 *  1st master address byte (ADDR1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ADDR1_Struct
 *! \brief  1st master address byte Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ADDR1_t__
typedef struct _ADI_I2C_ADDR1_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Address byte 1 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ADDR1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ADDR1_t__ */

/*@}*/

/** @defgroup ADDR2 2nd master address byte (ADDR2) Register
 *  2nd master address byte (ADDR2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ADDR2_Struct
 *! \brief  2nd master address byte Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ADDR2_t__
typedef struct _ADI_I2C_ADDR2_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Address byte 2 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ADDR2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ADDR2_t__ */

/*@}*/

/** @defgroup BYT Start byte (BYT) Register
 *  Start byte (BYT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_BYT_Struct
 *! \brief  Start byte Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_BYT_t__
typedef struct _ADI_I2C_BYT_t {
  union {
    struct {
      uint16_t SBYTE      :  8;  /**< Start byte */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_BYT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_BYT_t__ */

/*@}*/

/** @defgroup DIV Serial clock period divisor (DIV) Register
 *  Serial clock period divisor (DIV) Register.
 *  @{
 */

