analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_I2C_DIV_Struct
 *! \brief  Serial clock period divisor Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_DIV_t__
typedef struct _ADI_I2C_DIV_t {
  union {
    struct {
      uint16_t LOW        :  8;  /**< Serial clock low time */
      uint16_t HIGH       :  8;  /**< Serial clock high time */
    };
    uint16_t VALUE16;
  };
} ADI_I2C_DIV_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_DIV_t__ */

/*@}*/

/** @defgroup SCTL Slave control (SCTL) Register
 *  Slave control (SCTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_SCTL_Struct
 *! \brief  Slave control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_SCTL_t__
typedef struct _ADI_I2C_SCTL_t {
  union {
    struct {
      uint16_t SLVEN      :  1;  /**< Slave enable */
      uint16_t ADR10EN    :  1;  /**< Enabled 10-bit addressing */
      uint16_t GCEN       :  1;  /**< General call enable */
      uint16_t HGCEN      :  1;  /**< Hardware general call enable */
      uint16_t GCSBCLR    :  1;  /**< General call status bit clear */
      uint16_t EARLYTXR   :  1;  /**< Early transmit request mode */
      uint16_t reserved6  :  1;
      uint16_t NACK       :  1;  /**< NACK next communication */
      uint16_t IENSTOP    :  1;  /**< Stop condition detected interrupt enable */
      uint16_t IENSRX     :  1;  /**< Slave Receive request interrupt enable */
      uint16_t IENSTX     :  1;  /**< Slave Transmit request interrupt enable */
      uint16_t STXDEC     :  1;  /**< Decrement Slave Tx FIFO status when a byte has been transmitted */
      uint16_t IENREPST   :  1;  /**< Repeated start interrupt enable */
      uint16_t SRXDMA     :  1;  /**< Enable slave Rx DMA request */
      uint16_t STXDMA     :  1;  /**< Enable slave Tx DMA request */
      uint16_t reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_SCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_SCTL_t__ */

/*@}*/

/** @defgroup SSTAT Slave I2C Status/Error/IRQ (SSTAT) Register
 *  Slave I2C Status/Error/IRQ (SSTAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_SSTAT_Struct
 *! \brief  Slave I2C Status/Error/IRQ Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_SSTAT_t__
typedef struct _ADI_I2C_SSTAT_t {
  union {
    struct {
      uint16_t STXFSEREQ  :  1;  /**< Slave Tx FIFO Status or early request */
      uint16_t STXUNDR    :  1;  /**< Slave Transmit FIFO underflow */
      uint16_t STXREQ     :  1;  /**< When read is slave transmit request; when write is clear slave transmit interrupt bit */
      uint16_t SRXREQ     :  1;  /**< Slave Receive request */
      uint16_t SRXOVR     :  1;  /**< Slave Receive FIFO overflow */
      uint16_t NOACK      :  1;  /**< Ack not generated by the slave */
      uint16_t SBUSY      :  1;  /**< Slave busy */
      uint16_t GCINT      :  1;  /**< General call interrupt */
      uint16_t GCID       :  2;  /**< General ID */
      uint16_t STOP       :  1;  /**< Stop after start and matching address */
      uint16_t IDMAT      :  2;  /**< Device ID matched */
      uint16_t REPSTART   :  1;  /**< Repeated start and matching address */
      uint16_t START      :  1;  /**< Start and matching address */
      uint16_t reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_SSTAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_SSTAT_t__ */

/*@}*/

/** @defgroup SRX Slave receive (SRX) Register
 *  Slave receive (SRX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_SRX_Struct
 *! \brief  Slave receive Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_SRX_t__
typedef struct _ADI_I2C_SRX_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave receive register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_SRX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_SRX_t__ */

/*@}*/

/** @defgroup STX Slave transmit (STX) Register
 *  Slave transmit (STX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_STX_Struct
 *! \brief  Slave transmit Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_STX_t__
typedef struct _ADI_I2C_STX_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave transmit register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_STX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_STX_t__ */

/*@}*/

/** @defgroup ALT Hardware general call ID (ALT) Register
 *  Hardware general call ID (ALT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ALT_Struct
 *! \brief  Hardware general call ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ALT_t__
typedef struct _ADI_I2C_ALT_t {
  union {
    struct {
      uint16_t ID         :  8;  /**< Slave Alt */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ALT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ALT_t__ */

/*@}*/

/** @defgroup ID0 1st slave address device ID (ID0) Register
 *  1st slave address device ID (ID0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ID0_Struct
 *! \brief  1st slave address device ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ID0_t__
typedef struct _ADI_I2C_ID0_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave device ID 0 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ID0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ID0_t__ */

/*@}*/

/** @defgroup ID1 2nd slave address device ID (ID1) Register
 *  2nd slave address device ID (ID1) Register.
 *  @{
 */

