analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_I2C_ID1_Struct
 *! \brief  2nd slave address device ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ID1_t__
typedef struct _ADI_I2C_ID1_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave device ID 1 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ID1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ID1_t__ */

/*@}*/

/** @defgroup ID2 3rd slave address device ID (ID2) Register
 *  3rd slave address device ID (ID2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ID2_Struct
 *! \brief  3rd slave address device ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ID2_t__
typedef struct _ADI_I2C_ID2_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave device ID 2 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ID2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ID2_t__ */

/*@}*/

/** @defgroup ID3 4th slave address device ID (ID3) Register
 *  4th slave address device ID (ID3) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ID3_Struct
 *! \brief  4th slave address device ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ID3_t__
typedef struct _ADI_I2C_ID3_t {
  union {
    struct {
      uint16_t VALUE      :  8;  /**< Slave device ID 3 */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ID3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ID3_t__ */

/*@}*/

/** @defgroup STAT Master and slave FIFO status (STAT) Register
 *  Master and slave FIFO status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_STAT_Struct
 *! \brief  Master and slave FIFO status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_STAT_t__
typedef struct _ADI_I2C_STAT_t {
  union {
    struct {
      uint16_t STXF       :  2;  /**< Slave transmit FIFO status */
      uint16_t SRXF       :  2;  /**< Slave receive FIFO status */
      uint16_t MTXF       :  2;  /**< Master transmit FIFO status */
      uint16_t MRXF       :  2;  /**< Master receive FIFO status */
      uint16_t SFLUSH     :  1;  /**< Flush the slave transmit FIFO */
      uint16_t MFLUSH     :  1;  /**< Flush the master transmit FIFO */
      uint16_t reserved10 :  6;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_STAT_t__ */

/*@}*/

/** @defgroup SHCTL Shared control (SHCTL) Register
 *  Shared control (SHCTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_SHCTL_Struct
 *! \brief  Shared control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_SHCTL_t__
typedef struct _ADI_I2C_SHCTL_t {
  union {
    struct {
      uint16_t RST        :  1;  /**< Reset START STOP detect circuit */
      uint16_t reserved1  : 15;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_SHCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_SHCTL_t__ */

/*@}*/

/** @defgroup TCTL Timing Control Register (TCTL) Register
 *  Timing Control Register (TCTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_TCTL_Struct
 *! \brief  Timing Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_TCTL_t__
typedef struct _ADI_I2C_TCTL_t {
  union {
    struct {
      uint16_t THDATIN    :  5;  /**< Data In Hold Start */
      uint16_t reserved5  :  3;
      uint16_t FILTEROFF  :  1;  /**< Input Filter Control */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_TCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_TCTL_t__ */

/*@}*/

/** @defgroup ASTRETCH_SCL Automatic stretch SCL register (ASTRETCH_SCL) Register
 *  Automatic stretch SCL register (ASTRETCH_SCL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_I2C_ASTRETCH_SCL_Struct
 *! \brief  Automatic stretch SCL Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_ASTRETCH_SCL_t__
typedef struct _ADI_I2C_ASTRETCH_SCL_t {
  union {
    struct {
      uint16_t MST        :  4;  /**< master automatic stretch mode */
      uint16_t SLV        :  4;  /**< slave automatic stretch mode */
      uint16_t MSTTMO     :  1;  /**< master automatic stretch timeout */
      uint16_t SLVTMO     :  1;  /**< slave automatic stretch timeout */
      uint16_t reserved10 :  6;
    };
    uint16_t VALUE16;
  };
} ADI_I2C_ASTRETCH_SCL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_ASTRETCH_SCL_t__ */

/*@}*/

/** @defgroup STAT Status (STAT) Register
 *  Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_STAT_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_STAT_t__
typedef struct _ADI_SPI_STAT_t {
  union {
    struct {
      uint16_t IRQ        :  1;  /**< SPI Interrupt status */
      uint16_t XFRDONE    :  1;  /**< SPI transfer completion */
      uint16_t TXEMPTY    :  1;  /**< SPI Tx FIFO empty interrupt */
      uint16_t TXDONE     :  1;  /**< SPI Tx Done in read command mode */
      uint16_t TXUNDR     :  1;  /**< SPI Tx FIFO underflow */
      uint16_t TXIRQ      :  1;  /**< SPI Tx IRQ */
      uint16_t RXIRQ      :  1;  /**< SPI Rx IRQ */
      uint16_t RXOVR      :  1;  /**< SPI Rx FIFO overflow */
      uint16_t reserved8  :  3;
      uint16_t CS         :  1;  /**< CS Status */
      uint16_t CSERR      :  1;  /**< Detected a CS error condition in slave mode */
	  uint16_t CSRISE     :  1;  /**< Detected a rising edge on CS, in slave CON mode */
      uint16_t CSFALL     :  1;  /**< Detected a falling edge on CS, in slave CON mode */
      uint16_t RDY        :  1;  /**< Detected an edge on Ready indicator for flow-control */
    };
    uint16_t VALUE16;
  };
} ADI_SPI_STAT_t;
