analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_STAT_t__ */

/*@}*/

/** @defgroup RX Receive (RX) Register
 *  Receive (RX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_RX_Struct
 *! \brief  Receive Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_RX_t__
typedef struct _ADI_SPI_RX_t {
  union {
    struct {
      uint16_t BYTE1      :  8;  /**< 8-bit receive buffer */
      uint16_t BYTE2      :  8;  /**< 8-bit receive buffer, used only in DMA modes */
    };
    uint16_t VALUE16;
  };
} ADI_SPI_RX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_RX_t__ */

/*@}*/

/** @defgroup TX Transmit (TX) Register
 *  Transmit (TX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_TX_Struct
 *! \brief  Transmit Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_TX_t__
typedef struct _ADI_SPI_TX_t {
  union {
    struct {
      uint16_t BYTE1      :  8;  /**< 8-bit transmit buffer */
      uint16_t BYTE2      :  8;  /**< 8-bit transmit buffer, used only in DMA modes */
    };
    uint16_t VALUE16;
  };
} ADI_SPI_TX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_TX_t__ */

/*@}*/

/** @defgroup DIV SPI baud rate selection (DIV) Register
 *  SPI baud rate selection (DIV) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_DIV_Struct
 *! \brief  SPI baud rate selection Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_DIV_t__
typedef struct _ADI_SPI_DIV_t {
  union {
    struct {
      uint16_t VALUE      :  6;  /**< SPI clock divider */
      uint16_t reserved6  : 10;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_DIV_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_DIV_t__ */

/*@}*/

/** @defgroup CTL SPI configuration 1 (CTL) Register
 *  SPI configuration 1 (CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_CTL_Struct
 *! \brief  SPI configuration 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_CTL_t__
typedef struct _ADI_SPI_CTL_t {
  union {
    struct {
      uint16_t SPIEN      :  1;  /**< SPI enable */
      uint16_t MASEN      :  1;  /**< Master mode enable */
      uint16_t CPHA       :  1;  /**< Serial clock phase mode */
      uint16_t CPOL       :  1;  /**< Serial Clock Polarity */
      uint16_t WOM        :  1;  /**< SPI Wired Or mode */
      uint16_t LSB        :  1;  /**< LSB first transfer enable */
      uint16_t TIM        :  1;  /**< SPI transfer and interrupt mode */
      uint16_t ZEN        :  1;  /**< Transmit zeros enable */
      uint16_t RXOF       :  1;  /**< RX overflow overwrite enable */
      uint16_t OEN        :  1;  /**< Slave MISO output enable */
      uint16_t LOOPBACK   :  1;  /**< Loopback enable */
      uint16_t CON        :  1;  /**< Continuous transfer enable */
      uint16_t RFLUSH     :  1;  /**< SPI Rx FIFO Flush enable */
      uint16_t TFLUSH     :  1;  /**< SPI Tx FIFO Flush enable */
      uint16_t CSRST      :  1;  /**< Reset Mode for CS Error bit */
      uint16_t reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_CTL_t__ */

/*@}*/

/** @defgroup IEN SPI configuration 2 (IEN) Register
 *  SPI configuration 2 (IEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_IEN_Struct
 *! \brief  SPI configuration 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_IEN_t__
typedef struct _ADI_SPI_IEN_t {
  union {
    struct {
      uint16_t IRQMODE    :  3;  /**< SPI IRQ mode bits */
      uint16_t reserved3  :  5;
      uint16_t CS         :  1;  /**< Enable interrupt on every CS edge in slave CON mode */
      uint16_t TXUNDR     :  1;  /**< Tx-underflow interrupt enable */
      uint16_t RXOVR      :  1;  /**< Rx-overflow interrupt enable */
      uint16_t RDY        :  1;  /**< Ready signal edge interrupt enable */
      uint16_t TXDONE     :  1;  /**< SPI transmit done interrupt enable */
      uint16_t XFRDONE    :  1;  /**< SPI transfer completion interrupt enable */
      uint16_t TXEMPTY    :  1;  /**< Tx-FIFO Empty interrupt enable */
      uint16_t reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_IEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_IEN_t__ */

/*@}*/

/** @defgroup CNT Transfer byte count (CNT) Register
 *  Transfer byte count (CNT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_CNT_Struct
 *! \brief  Transfer byte count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_CNT_t__
typedef struct _ADI_SPI_CNT_t {
  union {
    struct {
      uint16_t VALUE      : 14;  /**< Transfer byte count */
      uint16_t reserved14 :  1;
      uint16_t FRAMECONT  :  1;  /**< Continue frame */
    };
    uint16_t VALUE16;
  };
} ADI_SPI_CNT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_CNT_t__ */

/*@}*/

/** @defgroup DMA SPI DMA enable (DMA) Register
 *  SPI DMA enable (DMA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_DMA_Struct
 *! \brief  SPI DMA enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_DMA_t__
typedef struct _ADI_SPI_DMA_t {
  union {
    struct {
      uint16_t EN         :  1;  /**< Enable DMA for data transfer */
      uint16_t TXEN       :  1;  /**< Enable transmit DMA request */
      uint16_t RXEN       :  1;  /**< Enable receive DMA request */
      uint16_t reserved3  : 13;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_DMA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_DMA_t__ */

/*@}*/

/** @defgroup FIFO_STAT FIFO Status (FIFO_STAT) Register
 *  FIFO Status (FIFO_STAT) Register.
 *  @{
 */

