analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_SPI_FIFO_STAT_Struct
 *! \brief  FIFO Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_FIFO_STAT_t__
typedef struct _ADI_SPI_FIFO_STAT_t {
  union {
    struct {
      uint16_t TX         :  4;  /**< SPI Tx FIFO status */
      uint16_t reserved4  :  4;
      uint16_t RX         :  4;  /**< SPI Rx FIFO status */
      uint16_t reserved12 :  4;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_FIFO_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_FIFO_STAT_t__ */

/*@}*/

/** @defgroup RD_CTL Read Control (RD_CTL) Register
 *  Read Control (RD_CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_RD_CTL_Struct
 *! \brief  Read Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_RD_CTL_t__
typedef struct _ADI_SPI_RD_CTL_t {
  union {
    struct {
      uint16_t CMDEN      :  1;  /**< Read command enable */
      uint16_t OVERLAP    :  1;  /**< Tx/Rx Overlap mode */
      uint16_t TXBYTES    :  4;  /**< Transmit byte count minus 1 for read command */
      uint16_t reserved6  :  2;
      uint16_t THREEPIN   :  1;  /**< Three pin SPI mode */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_RD_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_RD_CTL_t__ */

/*@}*/

/** @defgroup FLOW_CTL Flow Control (FLOW_CTL) Register
 *  Flow Control (FLOW_CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_FLOW_CTL_Struct
 *! \brief  Flow Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_FLOW_CTL_t__
typedef struct _ADI_SPI_FLOW_CTL_t {
  union {
    struct {
      uint16_t MODE       :  2;  /**< Flow control mode */
      uint16_t reserved2  :  2;
      uint16_t RDYPOL     :  1;  /**< Polarity of RDY/MISO line */
      uint16_t reserved5  :  3;
      uint16_t RDBURSTSZ  :  4;  /**< Read data burst size minus 1 */
      uint16_t reserved12 :  4;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_FLOW_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_FLOW_CTL_t__ */

/*@}*/

/** @defgroup WAIT_TMR Wait timer for flow control (WAIT_TMR) Register
 *  Wait timer for flow control (WAIT_TMR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_WAIT_TMR_Struct
 *! \brief  Wait timer for flow control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_WAIT_TMR_t__
typedef struct _ADI_SPI_WAIT_TMR_t {
  union {
    struct {
      uint16_t VALUE      : 16;  /**< Wait timer for flow-control */
    };
    uint16_t VALUE16;
  };
} ADI_SPI_WAIT_TMR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_WAIT_TMR_t__ */

/*@}*/

/** @defgroup CS_CTL Chip-Select control for multi-slave connections (CS_CTL) Register
 *  Chip-Select control for multi-slave connections (CS_CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_CS_CTL_Struct
 *! \brief  Chip-Select control for multi-slave connections Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_CS_CTL_t__
typedef struct _ADI_SPI_CS_CTL_t {
  union {
    struct {
      uint16_t SEL        :  4;  /**< Chip-Select control */
      uint16_t reserved4  : 12;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_CS_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_CS_CTL_t__ */

/*@}*/

/** @defgroup CS_OVERRIDE Chip-Select Override (CS_OVERRIDE) Register
 *  Chip-Select Override (CS_OVERRIDE) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_SPI_CS_OVERRIDE_Struct
 *! \brief  Chip-Select Override Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_CS_OVERRIDE_t__
typedef struct _ADI_SPI_CS_OVERRIDE_t {
  union {
    struct {
      uint16_t CTL        :  2;  /**< CS Override Control */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_SPI_CS_OVERRIDE_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_CS_OVERRIDE_t__ */

/*@}*/

/** @defgroup COMRX Receive Buffer Register (COMRX) Register
 *  Receive Buffer Register (COMRX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMRX_Struct
 *! \brief  Receive Buffer Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMRX_t__
typedef struct _ADI_UART_COMRX_t {
  union {
    struct {
      uint16_t RBR        :  8;  /**< Receive Buffer Register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMRX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMRX_t__ */

/*@}*/

/** @defgroup COMTX Transmit Holding Register (COMTX) Register
 *  Transmit Holding Register (COMTX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMTX_Struct
 *! \brief  Transmit Holding Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMTX_t__
typedef struct _ADI_UART_COMTX_t {
  union {
    struct {
      uint16_t THR        :  8;  /**< Transmit Holding Register */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMTX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMTX_t__ */

/*@}*/

