analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup COMIEN Interrupt Enable (COMIEN) Register
 *  Interrupt Enable (COMIEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMIEN_Struct
 *! \brief  Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMIEN_t__
typedef struct _ADI_UART_COMIEN_t {
  union {
    struct {
      uint16_t ERBFI      :  1;  /**< Receive buffer full interrupt */
      uint16_t ETBEI      :  1;  /**< Transmit buffer empty interrupt */
      uint16_t ELSI       :  1;  /**< Rx status interrupt */
      uint16_t EDSSI      :  1;  /**< Modem status interrupt */
      uint16_t EDMAT      :  1;  /**< DMA requests in transmit mode */
      uint16_t EDMAR      :  1;  /**< DMA requests in receive mode */
      uint16_t reserved6  : 10;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMIEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMIEN_t__ */

/*@}*/

/** @defgroup COMIIR Interrupt ID (COMIIR) Register
 *  Interrupt ID (COMIIR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMIIR_Struct
 *! \brief  Interrupt ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMIIR_t__
typedef struct _ADI_UART_COMIIR_t {
  union {
    struct {
      uint16_t NIRQ       :  1;  /**< Interrupt flag */
      uint16_t STA        :  3;  /**< Interrupt status */
      uint16_t reserved4  :  2;
      uint16_t FEND       :  2;  /**< FIFO enabled */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMIIR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMIIR_t__ */

/*@}*/

/** @defgroup COMLCR Line Control (COMLCR) Register
 *  Line Control (COMLCR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMLCR_Struct
 *! \brief  Line Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMLCR_t__
typedef struct _ADI_UART_COMLCR_t {
  union {
    struct {
      uint16_t WLS        :  2;  /**< Word Length Select */
      uint16_t STOP       :  1;  /**< Stop Bit */
      uint16_t PEN        :  1;  /**< Parity Enable */
      uint16_t EPS        :  1;  /**< Parity Select */
      uint16_t SP         :  1;  /**< Stick Parity */
      uint16_t BRK        :  1;  /**< Set Break */
      uint16_t reserved7  :  9;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMLCR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMLCR_t__ */

/*@}*/

/** @defgroup COMMCR Modem Control (COMMCR) Register
 *  Modem Control (COMMCR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMMCR_Struct
 *! \brief  Modem Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMMCR_t__
typedef struct _ADI_UART_COMMCR_t {
  union {
    struct {
      uint16_t DTR        :  1;  /**< Data Terminal Ready */
      uint16_t RTS        :  1;  /**< Request to send */
      uint16_t OUT1       :  1;  /**< Output 1 */
      uint16_t OUT2       :  1;  /**< Output 2 */
      uint16_t LOOPBACK   :  1;  /**< Loopback mode */
      uint16_t reserved5  : 11;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMMCR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMMCR_t__ */

/*@}*/

/** @defgroup COMLSR Line Status (COMLSR) Register
 *  Line Status (COMLSR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMLSR_Struct
 *! \brief  Line Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMLSR_t__
typedef struct _ADI_UART_COMLSR_t {
  union {
    struct {
      uint16_t DR         :  1;  /**< Data Ready */
      uint16_t OE         :  1;  /**< Overrun Error */
      uint16_t PE         :  1;  /**< Parity Error */
      uint16_t FE         :  1;  /**< Framing Error */
      uint16_t BI         :  1;  /**< Break Indicator */
      uint16_t THRE       :  1;  /**< COMTX Empty */
      uint16_t TEMT       :  1;  /**< COMTX and Shift Register Empty Status */
      uint16_t FIFOERR    :  1;  /**< data byte(s) in RX FIFO have either parity error, frame error or break indication. only used in 16550 mode; Read-clear if no more error in RX FIFO */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMLSR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMLSR_t__ */

/*@}*/

/** @defgroup COMMSR Modem Status (COMMSR) Register
 *  Modem Status (COMMSR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMMSR_Struct
 *! \brief  Modem Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMMSR_t__
typedef struct _ADI_UART_COMMSR_t {
  union {
    struct {
      uint16_t DCTS       :  1;  /**< Delta CTS */
      uint16_t DDSR       :  1;  /**< Delta DSR */
      uint16_t TERI       :  1;  /**< Trailing Edge RI */
      uint16_t DDCD       :  1;  /**< Delta DCD */
      uint16_t CTS        :  1;  /**< Clear To Send */
      uint16_t DSR        :  1;  /**< Data Set Ready */
      uint16_t RI         :  1;  /**< Ring Indicator */
      uint16_t DCD        :  1;  /**< Data Carrier Detect */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMMSR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMMSR_t__ */

/*@}*/

/** @defgroup COMSCR Scratch buffer (COMSCR) Register
 *  Scratch buffer (COMSCR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMSCR_Struct
 *! \brief  Scratch buffer Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMSCR_t__
typedef struct _ADI_UART_COMSCR_t {
  union {
    struct {
      uint16_t SCR        :  8;  /**< Scratch */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMSCR_t;
