analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMSCR_t__ */

/*@}*/

/** @defgroup COMFCR FIFO Control (COMFCR) Register
 *  FIFO Control (COMFCR) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_UART_COMFCR_FDMAMD
 *! \brief  FIFO DMA mode (FDMAMD) Enumerations
 *  ========================================================================= */
typedef enum
{
  UART_COMFCR_MODE0 = 0,  /**< in DMA mode 0, RX DMA request will be asserted whenever there's data in RBR or RX FIFO and de-assert whenever RBR or RX FIFO is empty; TX DMA request will be asserted whenever THR or TX FIFO is empty and de-assert whenever data written to                               */
  UART_COMFCR_MODE1 = 1   /**< in DMA mode 1, RX DMA request will be asserted whenever RX FIFO trig level or time out reached and de-assert thereafter when RX FIFO is empty; TX DMA request will be asserted whenever TX FIFO is empty and de-assert thereafter when TX FIFO is completely filled up full; */
} ADI_UART_COMFCR_FDMAMD;


/* ==========================================================================
 *! \struct ADI_UART_COMFCR_Struct
 *! \brief  FIFO Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMFCR_t__
typedef struct _ADI_UART_COMFCR_t {
  union {
    struct {
      uint16_t FIFOEN     :  1;  /**< FIFO enable as to work in 16550 mode */
      uint16_t RFCLR      :  1;  /**< clear RX FIFO */
      uint16_t TFCLR      :  1;  /**< clear TX FIFO */
      uint16_t FDMAMD     :  1;  /**< FIFO DMA mode */
      uint16_t reserved4  :  2;
      uint16_t RFTRIG     :  2;  /**< RX FIFO Trig level */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMFCR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMFCR_t__ */

/*@}*/

/** @defgroup COMFBR Fractional Baud Rate (COMFBR) Register
 *  Fractional Baud Rate (COMFBR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMFBR_Struct
 *! \brief  Fractional Baud Rate Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMFBR_t__
typedef struct _ADI_UART_COMFBR_t {
  union {
    struct {
      uint16_t DIVN       : 11;  /**< Fractional baud rate N divide bits 0 to 2047. */
      uint16_t DIVM       :  2;  /**< Fractional baud rate M divide bits 1 to 3 */
      uint16_t reserved13 :  2;
      uint16_t FBEN       :  1;  /**< Fractional baud rate generator enable */
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMFBR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMFBR_t__ */

/*@}*/

/** @defgroup COMDIV Baudrate divider (COMDIV) Register
 *  Baudrate divider (COMDIV) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMDIV_Struct
 *! \brief  Baudrate divider Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMDIV_t__
typedef struct _ADI_UART_COMDIV_t {
  union {
    struct {
      int16_t DIV        : 16;  /**< Baud rate divider */
    };
    int16_t VALUE16;
  };
} ADI_UART_COMDIV_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMDIV_t__ */

/*@}*/

/** @defgroup COMLCR2 second Line Control (COMLCR2) Register
 *  second Line Control (COMLCR2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMLCR2_Struct
 *! \brief  second Line Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMLCR2_t__
typedef struct _ADI_UART_COMLCR2_t {
  union {
    struct {
      uint16_t OSR        :  2;  /**< Over Sample Rate */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMLCR2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMLCR2_t__ */

/*@}*/

/** @defgroup COMCTL UART control register (COMCTL) Register
 *  UART control register (COMCTL) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_UART_COMCTL_RXINV
 *! \brief  invert receiver line (RXINV) Enumerations
 *  ========================================================================= */
typedef enum
{
  UART_COMCTL_EN000 = 0,  /**< don't invert receiver line (idling high) */
  UART_COMCTL_EN001 = 1   /**< invert receiver line (idling low)        */
} ADI_UART_COMCTL_RXINV;


/* ==========================================================================
 *! \struct ADI_UART_COMCTL_Struct
 *! \brief  UART control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMCTL_t__
typedef struct _ADI_UART_COMCTL_t {
  union {
    struct {
      uint16_t reserved0  :  1;
      uint16_t ForceClkOn :  1;  /**< Force UCLKg on */
      uint16_t reserved2  :  2;
      uint16_t RXINV      :  1;  /**< invert receiver line */
      uint16_t reserved5  :  3;
      uint16_t REV        :  8;  /**< UART revision ID */
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMCTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMCTL_t__ */

/*@}*/

/** @defgroup COMRFC RX FIFO byte count (COMRFC) Register
 *  RX FIFO byte count (COMRFC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMRFC_Struct
 *! \brief  RX FIFO byte count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMRFC_t__
typedef struct _ADI_UART_COMRFC_t {
  union {
    struct {
      uint16_t RFC        :  5;  /**< Current RX FIFO data bytes */
      uint16_t reserved5  : 11;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMRFC_t;
