analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMRFC_t__ */

/*@}*/

/** @defgroup COMTFC TX FIFO byte count (COMTFC) Register
 *  TX FIFO byte count (COMTFC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMTFC_Struct
 *! \brief  TX FIFO byte count Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMTFC_t__
typedef struct _ADI_UART_COMTFC_t {
  union {
    struct {
      uint16_t TFC        :  5;  /**< Current TX FIFO data bytes */
      uint16_t reserved5  : 11;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMTFC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMTFC_t__ */

/*@}*/

/** @defgroup COMRSC RS485 half-duplex Control (COMRSC) Register
 *  RS485 half-duplex Control (COMRSC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMRSC_Struct
 *! \brief  RS485 half-duplex Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMRSC_t__
typedef struct _ADI_UART_COMRSC_t {
  union {
    struct {
      uint16_t OENP       :  1;  /**< SOUT_EN polarity */
      uint16_t OENSP      :  1;  /**< SOUT_EN de-assert before full stop bit(s) */
      uint16_t DISRX      :  1;  /**< disable RX when transmitting */
      uint16_t DISTX      :  1;  /**< Hold off TX when receiving */
      uint16_t reserved4  : 12;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMRSC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMRSC_t__ */

/*@}*/

/** @defgroup COMACR Auto Baud Control (COMACR) Register
 *  Auto Baud Control (COMACR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMACR_Struct
 *! \brief  Auto Baud Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMACR_t__
typedef struct _ADI_UART_COMACR_t {
  union {
    struct {
      uint16_t ABE        :  1;  /**< Auto Baud enable */
      uint16_t DNIEN      :  1;  /**< enable done interrupt */
      uint16_t TOIEN      :  1;  /**< enable time-out interrupt */
      uint16_t reserved3  :  1;
      uint16_t SEC        :  3;  /**< Starting Edge Count */
      uint16_t reserved7  :  1;
      uint16_t EEC        :  4;  /**< Ending Edge Count */
      uint16_t reserved12 :  4;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMACR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMACR_t__ */

/*@}*/

/** @defgroup COMASRL Auto Baud Status (Low) (COMASRL) Register
 *  Auto Baud Status (Low) (COMASRL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMASRL_Struct
 *! \brief  Auto Baud Status (Low) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMASRL_t__
typedef struct _ADI_UART_COMASRL_t {
  union {
    struct {
      uint16_t DONE       :  1;  /**< Auto Baud Done successfully */
      uint16_t BRKTO      :  1;  /**< Timed out due to long time break condition */
      uint16_t NSETO      :  1;  /**< Timed out due to no valid start edge found */
      uint16_t NEETO      :  1;  /**< Timed out due to no valid ending edge found */
      uint16_t CNT        : 12;  /**< CNT[11:0] Auto Baud Counter value */
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMASRL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMASRL_t__ */

/*@}*/

/** @defgroup COMASRH Auto Baud Status (High) (COMASRH) Register
 *  Auto Baud Status (High) (COMASRH) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_UART_COMASRH_Struct
 *! \brief  Auto Baud Status (High) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_COMASRH_t__
typedef struct _ADI_UART_COMASRH_t {
  union {
    struct {
      uint16_t CNT        :  8;  /**< CNT[19:12] Auto Baud Counter value */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_COMASRH_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_COMASRH_t__ */

/*@}*/

/** @defgroup STAT DMA Status (STAT) Register
 *  DMA Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_STAT_Struct
 *! \brief  DMA Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_STAT_t__
typedef struct _ADI_DMA_STAT_t {
  union {
    struct {
      uint32_t MEN        :  1;  /**< Enable status of the controller */
      uint32_t reserved1  : 15;
      uint32_t CHANM1     :  5;  /**< Number of available DMA channels minus 1 */
      uint32_t reserved21 : 11;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_STAT_t__ */

/*@}*/

/** @defgroup CFG DMA Configuration (CFG) Register
 *  DMA Configuration (CFG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_CFG_Struct
 *! \brief  DMA Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_CFG_t__
typedef struct _ADI_DMA_CFG_t {
  union {
    struct {
      uint32_t MEN        :  1;  /**< Controller enable */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_CFG_t__ */

/*@}*/

/** @defgroup PDBPTR DMA channel primary control data base pointer (PDBPTR) Register
 *  DMA channel primary control data base pointer (PDBPTR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_PDBPTR_Struct
 *! \brief  DMA channel primary control data base pointer Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_PDBPTR_t__
typedef struct _ADI_DMA_PDBPTR_t {
  union {
    struct {
      int32_t ADDR       : 32;  /**< Pointer to the base address of the primary data structure */
    };
    int32_t VALUE32;
  };
} ADI_DMA_PDBPTR_t;
