analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup SRCADDR_CLR DMA channel source address decrement enable clear (SRCADDR_CLR) Register
 *  DMA channel source address decrement enable clear (SRCADDR_CLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_SRCADDR_CLR_Struct
 *! \brief  DMA channel source address decrement enable clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_SRCADDR_CLR_t__
typedef struct _ADI_DMA_SRCADDR_CLR_t {
  union {
    struct {
      uint32_t CHAN       : 24;  /**< Disable source address decrement */
      uint32_t reserved24 :  8;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_SRCADDR_CLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_SRCADDR_CLR_t__ */

/*@}*/

/** @defgroup DSTADDR_SET DMA channel destination address decrement enable set (DSTADDR_SET) Register
 *  DMA channel destination address decrement enable set (DSTADDR_SET) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_DSTADDR_SET_Struct
 *! \brief  DMA channel destination address decrement enable set Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_DSTADDR_SET_t__
typedef struct _ADI_DMA_DSTADDR_SET_t {
  union {
    struct {
      uint32_t CHAN       : 24;  /**< Destination Address decrement status / configure destination address decrement */
      uint32_t reserved24 :  8;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_DSTADDR_SET_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_DSTADDR_SET_t__ */

/*@}*/

/** @defgroup DSTADDR_CLR DMA channel destination address decrement enable clear (DSTADDR_CLR) Register
 *  DMA channel destination address decrement enable clear (DSTADDR_CLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_DSTADDR_CLR_Struct
 *! \brief  DMA channel destination address decrement enable clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_DSTADDR_CLR_t__
typedef struct _ADI_DMA_DSTADDR_CLR_t {
  union {
    struct {
      uint32_t CHAN       : 24;  /**< Disable destination address decrement */
      uint32_t reserved24 :  8;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_DSTADDR_CLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_DSTADDR_CLR_t__ */

/*@}*/

/** @defgroup REVID DMA Controller Revision ID (REVID) Register
 *  DMA Controller Revision ID (REVID) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_DMA_REVID_Struct
 *! \brief  DMA Controller Revision ID Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_REVID_t__
typedef struct _ADI_DMA_REVID_t {
  union {
    struct {
      uint32_t VALUE      :  8;  /**< DMA Controller revision ID */
      uint32_t reserved8  : 24;
    };
    uint32_t VALUE32;
  };
} ADI_DMA_REVID_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_REVID_t__ */

/*@}*/

/** @defgroup STAT Status (STAT) Register
 *  Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_STAT_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_STAT_t__
typedef struct _ADI_FLCC_STAT_t {
  union {
    struct {
      uint32_t CMDBUSY    :  1;  /**< Command busy */
      uint32_t WRCLOSE    :  1;  /**< WRITE registers are closed */
      uint32_t CMDCOMP    :  1;  /**< Command complete */
      uint32_t WRALCOMP   :  1;  /**< Write almost complete */
      uint32_t CMDFAIL    :  2;  /**< Provides information on command failures */
      uint32_t SLEEPING   :  1;  /**< Flash array is in low power (sleep) mode */
      uint32_t ECCERRCMD  :  2;  /**< ECC errors detected during user issued SIGN command */
      uint32_t ECCRDERR   :  2;  /**< ECC IRQ cause */
      uint32_t OVERLAP    :  1;  /**< Overlapping Command */
      uint32_t reserved12 :  1;
      uint32_t SIGNERR    :  1;  /**< Signature check failure during initialization */
      uint32_t INIT       :  1;  /**< Flash controller initialization in progress */
      uint32_t ECCINFOSIGN :  2;  /**< ECC status of flash initialization */
      uint32_t ECCERRCNT   :  3;  /**< ECC correction counter */
      uint32_t reserved20  :  5;
      uint32_t ECCICODE    :  2;  /**< ICode AHB Bus Error ECC status */
      uint32_t ECCDCODE    :  2;  /**< DCode AHB Bus Error ECC status */
      uint32_t CACHESRAMPERR :  1;  /**< SRAM parity errors in Cache Controller */
      uint32_t reserved30    :  2;
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_STAT_t__ */

/*@}*/

/** @defgroup IEN Interrupt Enable (IEN) Register
 *  Interrupt Enable (IEN) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_FLCC_IEN_ECC_CORRECT
 *! \brief  Control whether to generate bus errors, interrupts, or neither in response to 1-bit ECC Correction events (ECC_CORRECT) Enumerations
 *  ========================================================================= */
typedef enum
{
  FLCC_IEN_NONE_COR    = 0,  /**< Do not generate a response to ECC events      */
  FLCC_IEN_BUS_ERR_COR = 1,  /**< Generate Bus Errors in response to ECC events */
  FLCC_IEN_IRQ_COR     = 2   /**< Generate IRQs in response to ECC events       */
} ADI_FLCC_IEN_ECC_CORRECT;


/*  =========================================================================
 *! \enum   ADI_FLCC_IEN_ECC_ERROR
 *! \brief  Control whether to generate bus errors, interrupts, or neither in response to 2-bit ECC Error events (ECC_ERROR) Enumerations
 *  ========================================================================= */
typedef enum
{
  FLCC_IEN_NONE_ERR    = 0,  /**< Do not generate a response to ECC events      */
  FLCC_IEN_BUS_ERR_ERR = 1,  /**< Generate Bus Errors in response to ECC events */
  FLCC_IEN_IRQ_ERR     = 2   /**< Generate IRQs in response to ECC events       */
} ADI_FLCC_IEN_ECC_ERROR;


