analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_FLCC_ABORT_EN_HI_Struct
 *! \brief  IRQ Abort Enable (upper bits) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_ABORT_EN_HI_t__
typedef struct _ADI_FLCC_ABORT_EN_HI_t {
  union {
    struct {
      uint32_t VALUE      : 32;  /**< VALUE[63:32] Sys IRQ abort enable */
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_ABORT_EN_HI_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_ABORT_EN_HI_t__ */

/*@}*/

/** @defgroup ECC_CFG ECC Config (ECC_CFG) Register
 *  ECC Config (ECC_CFG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_ECC_CFG_Struct
 *! \brief  ECC Config Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_ECC_CFG_t__
typedef struct _ADI_FLCC_ECC_CFG_t {
  union {
    struct {
      uint32_t EN         :  1;  /**< ECC Enable */
      uint32_t INFOEN     :  1;  /**< Info space ECC Enable bit */
      uint32_t reserved2  :  6;
      uint32_t PTR        : 24;  /**< ECC start page pointer (user should write bits [31:8] of the start page address into bits [31:8] of this register) */
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_ECC_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_ECC_CFG_t__ */

/*@}*/

/** @defgroup ECC_ADDR ECC Status (Address) (ECC_ADDR) Register
 *  ECC Status (Address) (ECC_ADDR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_ECC_ADDR_Struct
 *! \brief  ECC Status (Address) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_ECC_ADDR_t__
typedef struct _ADI_FLCC_ECC_ADDR_t {
  union {
    struct {
      uint32_t VALUE      : 19;  /**< This register has the address for which ECC error is detected */
      uint32_t reserved19 : 13;
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_ECC_ADDR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_ECC_ADDR_t__ */

/*@}*/

/** @defgroup ADI_POR_SEC ADI flash security (ADI_POR_SEC) Register
 *  ADI flash security (ADI_POR_SEC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_ADI_POR_SEC_Struct
 *! \brief  ADI flash security Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_ADI_POR_SEC_t__
typedef struct _ADI_FLCC_ADI_POR_SEC_t {
  union {
    struct {
      uint32_t SECURE     :  1;  /**< Set this bit to prevent read or write access to User Space (sticky when set) */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_ADI_POR_SEC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_ADI_POR_SEC_t__ */

/*@}*/

/** @defgroup STAT Cache Status register (STAT) Register
 *  Cache Status register (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_CACHE_STAT_Struct
 *! \brief  Cache Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_STAT_t__
typedef struct _ADI_FLCC_CACHE_STAT_t {
  union {
    struct {
      uint32_t ICEN       :  1;  /**< If this bit is set then I-Cache is enabled and when cleared I-Cache is disabled. */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_CACHE_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_STAT_t__ */

/*@}*/

/** @defgroup SETUP Cache Setup register (SETUP) Register
 *  Cache Setup register (SETUP) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_CACHE_SETUP_Struct
 *! \brief  Cache Setup Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_SETUP_t__
typedef struct _ADI_FLCC_CACHE_SETUP_t {
  union {
    struct {
      uint32_t ICEN       :  1;  /**< If this bit set, then I-Cache is enabled for AHB accesses. If 0, then I-cache is disabled, and all AHB accesses will be via Flash memory. */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_FLCC_CACHE_SETUP_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_SETUP_t__ */

/*@}*/

/** @defgroup KEY Cache Key register (KEY) Register
 *  Cache Key register (KEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_FLCC_CACHE_KEY_Struct
 *! \brief  Cache Key Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_KEY_t__
typedef struct _ADI_FLCC_CACHE_KEY_t {
  union {
    struct {
      int32_t VALUE      : 32;  /**< Cache Key register */
    };
    int32_t VALUE32;
  };
} ADI_FLCC_CACHE_KEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_KEY_t__ */

/*@}*/

/** @defgroup CFG Port  Configuration (CFG) Register
 *  Port  Configuration (CFG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_GPIO_CFG_Struct
 *! \brief  Port  Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_GPIO_CFG_t__
typedef struct _ADI_GPIO_CFG_t {
  union {
    struct {
      uint32_t PIN00      :  2;  /**< Pin 0 configuration bits */
      uint32_t PIN01      :  2;  /**< Pin 1 configuration bits */
      uint32_t PIN02      :  2;  /**< Pin 2 configuration bits */
      uint32_t PIN03      :  2;  /**< Pin 3 configuration bits */
      uint32_t PIN04      :  2;  /**< Pin 4 configuration bits */
      uint32_t PIN05      :  2;  /**< Pin 5 configuration bits */
      uint32_t PIN06      :  2;  /**< Pin 6 configuration bits */
      uint32_t PIN07      :  2;  /**< Pin 7 configuration bits */
      uint32_t PIN08      :  2;  /**< Pin 8 configuration bits */
      uint32_t PIN09      :  2;  /**< Pin 9 configuration bits */
      uint32_t PIN10      :  2;  /**< Pin 10  configuration bits */
      uint32_t PIN11      :  2;  /**< Pin 11  configuration bits */
      uint32_t PIN12      :  2;  /**< Pin 12  configuration bits */
      uint32_t PIN13      :  2;  /**< Pin 13  configuration bits */
      uint32_t PIN14      :  2;  /**< Pin 14  configuration bits */
      uint32_t PIN15      :  2;  /**< Pin 15  configuration bits */
    };
    uint32_t VALUE32;
  };
} ADI_GPIO_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_GPIO_CFG_t__ */

/*@}*/

/** @defgroup OEN Port output enable (OEN) Register
 *  Port output enable (OEN) Register.
 *  @{
 */

