analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_CRYPT_CFG_Struct
 *! \brief  Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_CFG_t__
typedef struct _ADI_CRYPT_CFG_t {
  union {
    struct {
      uint32_t BLKEN      :  1;  /**< Enable BIT for the Crypto Block */
      uint32_t ENCR       :  1;  /**< Encrypt or Decrypt */
      uint32_t INDMAEN    :  1;  /**< Enable DMA for Input Buffer */
      uint32_t OUTDMAEN   :  1;  /**< Enable DMA for Output Buffer */
      uint32_t INFLUSH    :  1;  /**< Input Buffer Flush */
      uint32_t OUTFLUSH   :  1;  /**< Output Buffer Flush */
      uint32_t ENDIAN     :  1;  /**< Endianness */
      uint32_t reserved7  :  1;
      uint32_t KEYLEN     :  2;  /**< Select Key Length for AES Cipher */
      uint32_t reserved10 :  6;
      uint32_t ECBEN      :  1;  /**< Enable ECB Mode Operation */
      uint32_t CTREN      :  1;  /**< Enable CTR Mode Operation */
      uint32_t CBCEN      :  1;  /**< Enable CBC Mode Operation */
      uint32_t CCMEN      :  1;  /**< Enable CCM/CCM* Mode Operation */
      uint32_t CMACEN     :  1;  /**< Enable CMAC Mode Operation */
      uint32_t reserved21 :  4;
      uint32_t SHA256EN   :  1;  /**< Enable SHA-256 Operation */
      uint32_t SHAINIT    :  1;  /**< Restarts SHA Computation */
      uint32_t SHADATSRC  :  1;  /**< Select Data Input Source to SHA Engine */
      uint32_t RevID      :  4;  /**< Rev ID for Crypto on Glue Micro */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_CFG_t__ */

/*@}*/

/** @defgroup DATALEN Payload Data Length (DATALEN) Register
 *  Payload Data Length (DATALEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_DATALEN_Struct
 *! \brief  Payload Data Length Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_DATALEN_t__
typedef struct _ADI_CRYPT_DATALEN_t {
  union {
    struct {
      uint32_t VALUE      : 20;  /**< Length of Payload Data */
      uint32_t reserved20 : 12;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_DATALEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_DATALEN_t__ */

/*@}*/

/** @defgroup PREFIXLEN Authentication Data Length (PREFIXLEN) Register
 *  Authentication Data Length (PREFIXLEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_PREFIXLEN_Struct
 *! \brief  Authentication Data Length Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_PREFIXLEN_t__
typedef struct _ADI_CRYPT_PREFIXLEN_t {
  union {
    struct {
      uint32_t VALUE      : 16;  /**< Length of Associated Data */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_PREFIXLEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_PREFIXLEN_t__ */

/*@}*/

/** @defgroup INTEN Interrupt Enable Register (INTEN) Register
 *  Interrupt Enable Register (INTEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_INTEN_Struct
 *! \brief  Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_INTEN_t__
typedef struct _ADI_CRYPT_INTEN_t {
  union {
    struct {
      uint32_t INRDYEN    :  1;  /**< Enable Input Ready Interrupt */
      uint32_t OUTRDYEN   :  1;  /**< Enables the Output Ready Interrupt. */
      uint32_t INOVREN    :  1;  /**< Enable Input Overflow Interrupt. */
      uint32_t OUTUNDREN  :  1;  /**< Enable the Output Underflow Interrupt */
      uint32_t reserved4  :  1;
      uint32_t SHADONEN   :  1;  /**< Enable SHA_Done Interrupt */
      uint32_t reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_INTEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_INTEN_t__ */

/*@}*/

/** @defgroup STAT Status Register (STAT) Register
 *  Status Register (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_STAT_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_STAT_t__
typedef struct _ADI_CRYPT_STAT_t {
  union {
    struct {
      uint32_t INRDY      :  1;  /**< Input Buffer Status */
      uint32_t OUTRDY     :  1;  /**< Output Data Ready */
      uint32_t INOVR      :  1;  /**< Overflow in the INPUT Buffer. */
      uint32_t OUTUNDR    :  1;  /**< Underflow Interrupt in the Output */
      uint32_t reserved4  :  1;
      uint32_t SHADONE    :  1;  /**< SHA Computation Complete */
      uint32_t SHABUSY    :  1;  /**< SHA Busy. in Computation */
      uint32_t INWORDS    :  3;  /**< Number of Words in the Input Buffer */
      uint32_t OUTWORDS   :  3;  /**< Number of Words in the Output Buffer */
      uint32_t reserved13 : 19;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_STAT_t__ */

/*@}*/

/** @defgroup INBUF Input Buffer (INBUF) Register
 *  Input Buffer (INBUF) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_INBUF_Struct
 *! \brief  Input Buffer Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_INBUF_t__
typedef struct _ADI_CRYPT_INBUF_t {
  union {
    struct {
      int32_t VALUE      : 32;  /**< Input Buffer */
    };
    int32_t VALUE32;
  };
} ADI_CRYPT_INBUF_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_INBUF_t__ */

/*@}*/

/** @defgroup OUTBUF Output Buffer (OUTBUF) Register
 *  Output Buffer (OUTBUF) Register.
 *  @{
 */

