analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_XINT_CFG0_Struct
 *! \brief  External Interrupt Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_XINT_CFG0_t__
typedef struct _ADI_XINT_CFG0_t {
  union {
    struct {
      uint32_t IRQ0MDE    :  3;  /**< External Interrupt 0 Mode registers */
      uint32_t IRQ0EN     :  1;  /**< External Interrupt 0 Enable bit */
      uint32_t IRQ1MDE    :  3;  /**< External Interrupt 1 Mode registers */
      uint32_t IRQ1EN     :  1;  /**< External Interrupt 1 Enable bit */
      uint32_t IRQ2MDE    :  3;  /**< External Interrupt 2 Mode registers */
      uint32_t IRQ2EN     :  1;  /**< External Interrupt 2 Enable bit */
      uint32_t IRQ3MDE    :  3;  /**< External Interrupt 3 Mode registers */
      uint32_t IRQ3EN     :  1;  /**< External Interrupt 3 enable bit */
      uint32_t reserved16 :  4;
      uint32_t UART_RX_EN :  1;  /**< External Interrupt enable bit */
      uint32_t UART_RX_MDE :  3;  /**< External Interrupt using UART_RX wakeup Mode registers */
      uint32_t reserved24  :  8;
    };
    uint32_t VALUE32;
  };
} ADI_XINT_CFG0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_XINT_CFG0_t__ */

/*@}*/

/** @defgroup EXT_STAT External Wakeup Interrupt Status (EXT_STAT) Register
 *  External Wakeup Interrupt Status (EXT_STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_XINT_EXT_STAT_Struct
 *! \brief  External Wakeup Interrupt Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_XINT_EXT_STAT_t__
typedef struct _ADI_XINT_EXT_STAT_t {
  union {
    struct {
      uint32_t STAT_EXTINT0 :  1;  /**< Interrupt status bit for External Interrupt 0 */
      uint32_t STAT_EXTINT1 :  1;  /**< Interrupt status bit for External Interrupt 1 */
      uint32_t STAT_EXTINT2 :  1;  /**< Interrupt status bit for External Interrupt 2 */
      uint32_t STAT_EXTINT3 :  1;  /**< Interrupt status bit for External Interrupt 3 */
      uint32_t reserved4        :  1;
      uint32_t STAT_UART_RXWKUP :  1;  /**< Interrupt status bit for UART RX wakeup interrupt */
      uint32_t reserved6        : 26;
    };
    uint32_t VALUE32;
  };
} ADI_XINT_EXT_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_XINT_EXT_STAT_t__ */

/*@}*/

/** @defgroup CLR External Interrupt Clear (CLR) Register
 *  External Interrupt Clear (CLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_XINT_CLR_Struct
 *! \brief  External Interrupt Clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_XINT_CLR_t__
typedef struct _ADI_XINT_CLR_t {
  union {
    struct {
      uint32_t IRQ0       :  1;  /**< External interrupt 0 */
      uint32_t IRQ1       :  1;  /**< External interrupt 1 */
      uint32_t IRQ2       :  1;  /**< External interrupt 2 */
      uint32_t IRQ3       :  1;  /**< External interrupt 3 */
      uint32_t reserved4   :  1;
      uint32_t UART_RX_CLR :  1;  /**< External interrupt Clear for UART_RX WAKEUP interrupt */
      uint32_t reserved6   : 26;
    };
    uint32_t VALUE32;
  };
} ADI_XINT_CLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_XINT_CLR_t__ */

/*@}*/

/** @defgroup NMICLR Non-Maskable Interrupt Clear (NMICLR) Register
 *  Non-Maskable Interrupt Clear (NMICLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_XINT_NMICLR_Struct
 *! \brief  Non-Maskable Interrupt Clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_XINT_NMICLR_t__
typedef struct _ADI_XINT_NMICLR_t {
  union {
    struct {
      uint32_t CLR        :  1;  /**< NMI clear */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_XINT_NMICLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_XINT_NMICLR_t__ */

/*@}*/

/** @defgroup KEY Key Protection for OSCCTRL (KEY) Register
 *  Key Protection for OSCCTRL (KEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_OSC_KEY_Struct
 *! \brief  Key Protection for OSCCTRL Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__
typedef struct _ADI_CLKG_OSC_KEY_t {
  union {
    struct {
      uint32_t VALUE      : 16;  /**< Oscillator key */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_KEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__ */

/*@}*/

/** @defgroup CTL Oscillator Control (CTL) Register
 *  Oscillator Control (CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_OSC_CTL_Struct
 *! \brief  Oscillator Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__
typedef struct _ADI_CLKG_OSC_CTL_t {
  union {
    struct {
      uint32_t LFCLKMUX   :  1;  /**< 32 KHz clock select mux */
      uint32_t HFOSCEN    :  1;  /**< High frequency internal oscillator enable */
      uint32_t LFXTALEN   :  1;  /**< Low frequency crystal oscillator enable */
      uint32_t HFXTALEN   :  1;  /**< High frequency crystal oscillator enable */
      uint32_t LFXTAL_BYPASS :  1;  /**< Low frequency crystal oscillator Bypass */
      uint32_t LFXTAL_MON_EN :  1;  /**< LFXTAL clock monitor and Clock FAIL interrupt enable */
      uint32_t reserved6     :  2;
      uint32_t LFOSCOK       :  1;  /**< Status of LFOSC oscillator */
      uint32_t HFOSCOK       :  1;  /**< Status of HFOSC oscillator */
      uint32_t LFXTALOK      :  1;  /**< Status of LFXTAL oscillator */
      uint32_t HFXTALOK      :  1;  /**< Status of HFXTAL oscillator */
      uint32_t reserved12           : 19;
      uint32_t LFXTAL_MON_FAIL_STAT :  1;  /**< LF XTAL (crystal clock) Not Stable */
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__ */

/*@}*/

/** @defgroup SRAM_CTL Control for SRAM parity and instruction SRAM (SRAM_CTL) Register
 *  Control for SRAM parity and instruction SRAM (SRAM_CTL) Register.
 *  @{
 */

