analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_PMG_TST_SRAM_CTL_Struct
 *! \brief  Control for SRAM parity and instruction SRAM Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__
typedef struct _ADI_PMG_TST_SRAM_CTL_t {
  union {
    struct {
      uint32_t BNK0EN     :  1;  /**< Enable initialization */
      uint32_t BNK1EN     :  1;  /**< Enable initialization */
      uint32_t BNK2EN     :  1;  /**< Enable initialization */
      uint32_t BNK3EN     :  1;  /**< Enable initialization */
      uint32_t BNK4EN     :  1;  /**< Enable initialization */
      uint32_t BNK5EN     :  1;  /**< Enable initialization */
      uint32_t reserved6  :  7;
      uint32_t STARTINIT  :  1;  /**< Write one to trigger initialization. Self-cleared */
      uint32_t AUTOINIT   :  1;  /**< Automatic initialization on wake up from Hibernate mode */
      uint32_t ABTINIT    :  1;  /**< Abort current initialization. Self-cleared */
      uint32_t PENBNK0    :  1;  /**< Enable parity check */
      uint32_t PENBNK1    :  1;  /**< Enable parity check */
      uint32_t PENBNK2    :  1;  /**< Enable parity check */
      uint32_t PENBNK3    :  1;  /**< Enable parity check */
      uint32_t PENBNK4    :  1;  /**< Enable parity check */
      uint32_t PENBNK5    :  1;  /**< Enable parity check */
      uint32_t reserved22 :  9;
      uint32_t INSTREN    :  1;  /**< Enables instruction SRAM */
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SRAM_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__ */

/*@}*/

/** @defgroup SRAM_INITSTAT Initialization Status Register (SRAM_INITSTAT) Register
 *  Initialization Status Register (SRAM_INITSTAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SRAM_INITSTAT_Struct
 *! \brief  Initialization Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_INITSTAT_t__
typedef struct _ADI_PMG_TST_SRAM_INITSTAT_t {
  union {
    struct {
      uint32_t BNK0       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t BNK1       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t BNK2       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t BNK3       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t BNK4       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t BNK5       :  1;  /**< 0:Not initialized; 1:Initialization completed */
      uint32_t reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SRAM_INITSTAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_INITSTAT_t__ */

/*@}*/

/** @defgroup CLR_LATCH_GPIOS CLEAR GPIO AFTER SHUTDOWN MODE (CLR_LATCH_GPIOS) Register
 *  CLEAR GPIO AFTER SHUTDOWN MODE (CLR_LATCH_GPIOS) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_CLR_LATCH_GPIOS_Struct
 *! \brief  CLEAR GPIO AFTER SHUTDOWN MODE Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_CLR_LATCH_GPIOS_t__
typedef struct _ADI_PMG_TST_CLR_LATCH_GPIOS_t {
  union {
    struct {
      uint16_t VALUE      : 16;  /**< Writing 0x58FA creates a pulse to clear the latches for the GPIOs */
    };
    uint16_t VALUE16;
  };
} ADI_PMG_TST_CLR_LATCH_GPIOS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_CLR_LATCH_GPIOS_t__ */

/*@}*/

/** @defgroup SCRPAD_IMG SCRATCH PAD IMAGE (SCRPAD_IMG) Register
 *  SCRATCH PAD IMAGE (SCRPAD_IMG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SCRPAD_IMG_Struct
 *! \brief  SCRATCH PAD IMAGE Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SCRPAD_IMG_t__
typedef struct _ADI_PMG_TST_SCRPAD_IMG_t {
  union {
    struct {
      uint32_t DATA       : 32;  /**< Anything written to this register will be saved in 3V when going to shutdown mode */
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SCRPAD_IMG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SCRPAD_IMG_t__ */

/*@}*/

/** @defgroup SCRPAD_3V_RD SCRATCH PAD SAVED IN BATTERY DOMAIN (SCRPAD_3V_RD) Register
 *  SCRATCH PAD SAVED IN BATTERY DOMAIN (SCRPAD_3V_RD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SCRPAD_3V_RD_Struct
 *! \brief  SCRATCH PAD SAVED IN BATTERY DOMAIN Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SCRPAD_3V_RD_t__
typedef struct _ADI_PMG_TST_SCRPAD_3V_RD_t {
  union {
    struct {
      uint32_t DATA       : 32;  /**< Read Only register. Reading the scratch pad stored in shutdown mode */
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SCRPAD_3V_RD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SCRPAD_3V_RD_t__ */

/*@}*/

/** @defgroup CTL0 Misc clock settings (CTL0) Register
 *  Misc clock settings (CTL0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_CLK_CTL0_Struct
 *! \brief  Misc clock settings Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL0_t__
typedef struct _ADI_CLKG_CLK_CTL0_t {
  union {
    struct {
      uint32_t CLKMUX     :  2;  /**< Clock mux select */
      uint32_t reserved2  :  6;
      uint32_t RCLKMUX    :  2;  /**< Flash reference clock and HPBUCK clock source mux */
      uint32_t reserved10 :  1;
      uint32_t SPLLIPSEL  :  1;  /**< SPLL source select mux */
      uint32_t reserved12 :  2;
      uint32_t LFXTALIE   :  1;  /**< Low frequency crystal interrupt enable */
      uint32_t HFXTALIE   :  1;  /**< High frequency crystal interrupt enable */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_CLK_CTL0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL0_t__ */

/*@}*/

/** @defgroup CTL1 Clock dividers (CTL1) Register
 *  Clock dividers (CTL1) Register.
 *  @{
 */

