analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_CLKG_CLK_CTL1_Struct
 *! \brief  Clock dividers Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL1_t__
typedef struct _ADI_CLKG_CLK_CTL1_t {
  union {
    struct {
      uint32_t HCLKDIVCNT :  6;  /**< HCLK divide count */
      uint32_t reserved6  :  2;
      uint32_t PCLKDIVCNT :  6;  /**< PCLK divide count */
      uint32_t reserved14 :  2;
      uint32_t ACLKDIVCNT :  8;  /**< ACLK Divide Count. */
      uint32_t reserved24 :  8;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_CLK_CTL1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL1_t__ */

/*@}*/

/** @defgroup CTL3 System PLL (CTL3) Register
 *  System PLL (CTL3) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_CLK_CTL3_Struct
 *! \brief  System PLL Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL3_t__
typedef struct _ADI_CLKG_CLK_CTL3_t {
  union {
    struct {
      uint32_t SPLLNSEL   :  5;  /**< System PLL N multiplier */
      uint32_t reserved5  :  3;
      uint32_t SPLLDIV2   :  1;  /**< System PLL division by 2 */
      uint32_t SPLLEN     :  1;  /**< System PLL enable */
      uint32_t SPLLIE     :  1;  /**< System PLL interrupt enable */
      uint32_t SPLLMSEL   :  4;  /**< System PLL M Divider */
      uint32_t reserved15 :  1;
      uint32_t SPLLMUL2   :  1;  /**< system PLL multiply by 2 */
      uint32_t reserved17 : 15;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_CLK_CTL3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL3_t__ */

/*@}*/

/** @defgroup CTL5 User clock gating control (CTL5) Register
 *  User clock gating control (CTL5) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_CLK_CTL5_Struct
 *! \brief  User clock gating control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL5_t__
typedef struct _ADI_CLKG_CLK_CTL5_t {
  union {
    struct {
      uint32_t GPTCLK0OFF :  1;  /**< GP timer 0 user control */
      uint32_t GPTCLK1OFF :  1;  /**< GP timer 1 user control */
      uint32_t GPTCLK2OFF :  1;  /**< GP timer 2 user control */
      uint32_t UCLKI2COFF :  1;  /**< I2C clock user control */
      uint32_t GPIOCLKOFF :  1;  /**< GPIO clock control */
      uint32_t PERCLKOFF  :  1;  /**< This bit is used to disable all clocks connected to all peripherals */
      uint32_t reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_CLK_CTL5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_CTL5_t__ */

/*@}*/

/** @defgroup STAT0 Clocking status (STAT0) Register
 *  Clocking status (STAT0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_CLK_STAT0_Struct
 *! \brief  Clocking status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_STAT0_t__
typedef struct _ADI_CLKG_CLK_STAT0_t {
  union {
    struct {
      uint32_t SPLL       :  1;  /**< System PLL status */
      uint32_t SPLLLK     :  1;  /**< System PLL lock */
      uint32_t SPLLUNLK   :  1;  /**< System PLL unlock */
      uint32_t reserved3  :  5;
      uint32_t LFXTAL     :  1;  /**< LF crystal status */
      uint32_t LFXTALOK   :  1;  /**< LF crystal stable */
      uint32_t LFXTALNOK  :  1;  /**< LF crystal not stable */
      uint32_t reserved11 :  1;
      uint32_t HFXTAL     :  1;  /**< HF crystal status */
      uint32_t HFXTALOK   :  1;  /**< HF crystal stable */
      uint32_t HFXTALNOK  :  1;  /**< HF crystal not stable */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_CLK_STAT0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_CLK_STAT0_t__ */

/*@}*/

/** @defgroup ARBIT0 Arbitration Priority Configuration for FLASH and SRAM0 (ARBIT0) Register
 *  Arbitration Priority Configuration for FLASH and SRAM0 (ARBIT0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BUSM_ARBIT0_Struct
 *! \brief  Arbitration Priority Configuration for FLASH and SRAM0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT0_t__
typedef struct _ADI_BUSM_ARBIT0_t {
  union {
    struct {
      uint32_t FLSH_DCODE :  2;  /**< Flash priority for DCODE */
      uint32_t FLSH_SBUS  :  2;  /**< Flash priority for SBUS */
      uint32_t FLSH_DMA0  :  2;  /**< Flash priority for DMA0 */
      uint32_t reserved6   : 10;
      uint32_t SRAM0_DCODE :  2;  /**< SRAM0 priority for Dcode */
      uint32_t SRAM0_SBUS  :  2;  /**< SRAM0 priority for SBUS */
      uint32_t SRAM0_DMA0  :  2;  /**< SRAM0 priority for DMA0 */
      uint32_t reserved22  : 10;
    };
    uint32_t VALUE32;
  };
} ADI_BUSM_ARBIT0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT0_t__ */

/*@}*/

/** @defgroup ARBIT1 Arbitration Priority Configuration for SRAM1 and SIP (ARBIT1) Register
 *  Arbitration Priority Configuration for SRAM1 and SIP (ARBIT1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BUSM_ARBIT1_Struct
 *! \brief  Arbitration Priority Configuration for SRAM1 and SIP Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT1_t__
typedef struct _ADI_BUSM_ARBIT1_t {
  union {
    struct {
      uint32_t SRAM1_DCODE :  2;  /**< SRAM1 priority for Dcode */
      uint32_t SRAM1_SBUS  :  2;  /**< SRAM1 priority for SBUS */
      uint32_t SRAM1_DMA0  :  2;  /**< SRAM1 priority for DMA0 */
      uint32_t reserved6   : 10;
      uint32_t SIP_DCODE   :  2;  /**< SIP priority for DCODE */
      uint32_t SIP_SBUS    :  2;  /**< SIP priority for SBUS */
      uint32_t SIP_DMA0    :  2;  /**< SIP priority for DMA0 */
      uint32_t reserved22  : 10;
    };
    uint32_t VALUE32;
  };
} ADI_BUSM_ARBIT1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT1_t__ */

/*@}*/

