analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup ARBIT2 Arbitration Priority Configuration for APB32 and APB16 (ARBIT2) Register
 *  Arbitration Priority Configuration for APB32 and APB16 (ARBIT2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BUSM_ARBIT2_Struct
 *! \brief  Arbitration Priority Configuration for APB32 and APB16 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT2_t__
typedef struct _ADI_BUSM_ARBIT2_t {
  union {
    struct {
      uint32_t APB32_DCODE :  2;  /**< APB32 priority for DCODE */
      uint32_t APB32_SBUS  :  2;  /**< APB32 priority for SBUS */
      uint32_t APB32_DMA0  :  2;  /**< APB32 priority for DMA0 */
      uint32_t reserved6   : 10;
      uint32_t APB16_DCODE :  2;  /**< APB16 priority for DCODE */
      uint32_t APB16_SBUS  :  2;  /**< APB16 priority for SBUS */
      uint32_t APB16_DMA0  :  2;  /**< APB16 priority for DMA0 */
      uint32_t reserved22  : 10;
    };
    uint32_t VALUE32;
  };
} ADI_BUSM_ARBIT2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT2_t__ */

/*@}*/

/** @defgroup ARBIT3 Arbitration Priority Configuration for APB16 priority for core and for DMA1 (ARBIT3) Register
 *  Arbitration Priority Configuration for APB16 priority for core and for DMA1 (ARBIT3) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BUSM_ARBIT3_Struct
 *! \brief  Arbitration Priority Configuration for APB16 priority for core and for DMA1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT3_t__
typedef struct _ADI_BUSM_ARBIT3_t {
  union {
    struct {
      uint32_t APB16_CORE :  1;  /**< APB16 priority for CORE */
      uint32_t APB16_DMA1 :  1;  /**< APB16 priority for DMA1 */
      uint32_t reserved2       : 14;
      uint32_t APB16_4DMA_CORE :  1;  /**< APB16 for dma priority for CORE */
      uint32_t APB16_4DMA_DMA1 :  1;  /**< APB16 for dma priority for DMA1 */
      uint32_t reserved18      : 14;
    };
    uint32_t VALUE32;
  };
} ADI_BUSM_ARBIT3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BUSM_ARBIT3_t__ */

/*@}*/

/** @defgroup CON GPIO Port Configuration (CON) Register
 *  GPIO Port Configuration (CON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_CON_Struct
 *! \brief  GPIO Port Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_CON_t__
typedef struct _ADI_AGPIO_CON_t {
  union {
    struct {
      uint32_t PIN0CFG    :  2;  /**< Pin 0 Configuration Bits */
      uint32_t PIN1CFG    :  2;  /**< Pin 1 Configuration Bits */
      uint32_t PIN2CFG    :  2;  /**< Pin 2 Configuration Bits */
      uint32_t PIN3CFG    :  2;  /**< Pin 3 Configuration Bits */
      uint32_t PIN4CFG    :  2;  /**< Pin 4 Configuration Bits */
      uint32_t PIN5CFG    :  2;  /**< Pin 5 Configuration Bits */
      uint32_t PIN6CFG    :  2;  /**< Pin 6 Configuration Bits */
      uint32_t PIN7CFG    :  2;  /**< Pin 7 Configuration Bits */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AGPIO_CON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_CON_t__ */

/*@}*/

/** @defgroup OEN GPIO Port Output Enable (OEN) Register
 *  GPIO Port Output Enable (OEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_OEN_Struct
 *! \brief  GPIO Port Output Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_OEN_t__
typedef struct _ADI_AGPIO_OEN_t {
  union {
    struct {
      uint16_t OEN        : 16;  /**< Pin Output Drive enable */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_OEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_OEN_t__ */

/*@}*/

/** @defgroup PE GPIO Port Pullup/Pulldown Enable (PE) Register
 *  GPIO Port Pullup/Pulldown Enable (PE) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_PE_Struct
 *! \brief  GPIO Port Pullup/Pulldown Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_PE_t__
typedef struct _ADI_AGPIO_PE_t {
  union {
    struct {
      uint16_t PE         : 16;  /**< Pin Pull enable */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_PE_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_PE_t__ */

/*@}*/

/** @defgroup IEN GPIO Port Input Path Enable (IEN) Register
 *  GPIO Port Input Path Enable (IEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_IEN_Struct
 *! \brief  GPIO Port Input Path Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_IEN_t__
typedef struct _ADI_AGPIO_IEN_t {
  union {
    struct {
      uint16_t IEN        : 16;  /**< Input path enable */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_IEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_IEN_t__ */

/*@}*/

/** @defgroup IN GPIO Port Registered Data Input (IN) Register
 *  GPIO Port Registered Data Input (IN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_IN_Struct
 *! \brief  GPIO Port Registered Data Input Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_IN_t__
typedef struct _ADI_AGPIO_IN_t {
  union {
    struct {
      uint16_t IN         : 16;  /**< Registered data input */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_IN_t;
