analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_IN_t__ */

/*@}*/

/** @defgroup OUT GPIO Port Data Output (OUT) Register
 *  GPIO Port Data Output (OUT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_OUT_Struct
 *! \brief  GPIO Port Data Output Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_OUT_t__
typedef struct _ADI_AGPIO_OUT_t {
  union {
    struct {
      uint16_t OUT        : 16;  /**< Data out */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_OUT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_OUT_t__ */

/*@}*/

/** @defgroup SET GPIO Port Data Out Set (SET) Register
 *  GPIO Port Data Out Set (SET) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_SET_Struct
 *! \brief  GPIO Port Data Out Set Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_SET_t__
typedef struct _ADI_AGPIO_SET_t {
  union {
    struct {
      uint16_t SET        : 16;  /**< Set the output HIGH for the pin */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_SET_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_SET_t__ */

/*@}*/

/** @defgroup CLR GPIO Port Data Out Clear (CLR) Register
 *  GPIO Port Data Out Clear (CLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_CLR_Struct
 *! \brief  GPIO Port Data Out Clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_CLR_t__
typedef struct _ADI_AGPIO_CLR_t {
  union {
    struct {
      uint16_t CLR        : 16;  /**< Set the output low  for the port pin */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_CLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_CLR_t__ */

/*@}*/

/** @defgroup TGL GPIO Port Pin Toggle (TGL) Register
 *  GPIO Port Pin Toggle (TGL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPIO_TGL_Struct
 *! \brief  GPIO Port Pin Toggle Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_TGL_t__
typedef struct _ADI_AGPIO_TGL_t {
  union {
    struct {
      uint16_t TGL        : 16;  /**< Toggle the output of the port pin */
    };
    uint16_t VALUE16;
  };
} ADI_AGPIO_TGL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_TGL_t__ */

/*@}*/

/** @defgroup ADIID ADI Identification (ADIID) Register
 *  ADI Identification (ADIID) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_ADIID_Struct
 *! \brief  ADI Identification Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_ADIID_t__
typedef struct _ADI_AFECON_ADIID_t {
  union {
    struct {
      uint16_t ADIID      : 16;  /**< ADI Identifier. */
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_ADIID_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_ADIID_t__ */

/*@}*/

/** @defgroup CHIPID Chip Identification (CHIPID) Register
 *  Chip Identification (CHIPID) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_CHIPID_Struct
 *! \brief  Chip Identification Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_CHIPID_t__
typedef struct _ADI_AFECON_CHIPID_t {
  union {
    struct {
      uint16_t Revision   :  4;  /**< Silicon Revision Number */
      uint16_t PartID     : 12;  /**< Part Identifier */
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_CHIPID_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_CHIPID_t__ */

/*@}*/

/** @defgroup CLKCON0 Clock Divider Configuration (CLKCON0) Register
 *  Clock Divider Configuration (CLKCON0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_CLKCON0_Struct
 *! \brief  Clock Divider Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_CLKCON0_t__
typedef struct _ADI_AFECON_CLKCON0_t {
  union {
    struct {
      uint16_t SYSCLKDIV  :  6;  /**< System Clock Divider Configuration */
      uint16_t ADCCLKDIV  :  4;  /**< ADC Clock Divider Configuration */
      uint16_t SFFTCLKDIVCNT :  6;  /**< SFFT Clock Divider Configuration */
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_CLKCON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_CLKCON0_t__ */

/*@}*/

/** @defgroup CLKEN1 Clock Gate Enable (CLKEN1) Register
 *  Clock Gate Enable (CLKEN1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_CLKEN1_Struct
 *! \brief  Clock Gate Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_CLKEN1_t__
typedef struct _ADI_AFECON_CLKEN1_t {
  union {
    struct {
      uint16_t reserved0  :  5;
      uint16_t ACLKDIS    :  1;  /**< ACLK Clock Enable */
      uint16_t GPT0DIS    :  1;  /**< GPT0 Clock Enable */
      uint16_t GPT1DIS    :  1;  /**< GPT1 Clock Enable */
      uint16_t reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_CLKEN1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_CLKEN1_t__ */

/*@}*/

/** @defgroup CLKSEL Clock Select (CLKSEL) Register
 *  Clock Select (CLKSEL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_CLKSEL_Struct
 *! \brief  Clock Select Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_CLKSEL_t__
typedef struct _ADI_AFECON_CLKSEL_t {
  union {
    struct {
      uint16_t SYSCLKSEL  :  2;  /**< Select System Clock Source */
      uint16_t ADCCLKSEL  :  2;  /**< Select ADC Clock Source */
      uint16_t reserved4  : 12;
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_CLKSEL_t;
