analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_CLKSEL_t__ */

/*@}*/

/** @defgroup GPIOCLKMUXSEL GPIO Clock MUX Select (GPIOCLKMUXSEL) Register
 *  GPIO Clock MUX Select (GPIOCLKMUXSEL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_GPIOCLKMUXSEL_Struct
 *! \brief  GPIO Clock MUX Select Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_GPIOCLKMUXSEL_t__
typedef struct _ADI_AFECON_GPIOCLKMUXSEL_t {
  union {
    struct {
      uint16_t SEL        :  3;  /**< Configure Clock MUX Out to GPIO */
      uint16_t reserved3  : 13;
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_GPIOCLKMUXSEL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_GPIOCLKMUXSEL_t__ */

/*@}*/

/** @defgroup CLKCON0KEY Enable Clock Division to 8Mhz,4Mhz and 2Mhz (CLKCON0KEY) Register
 *  Enable Clock Division to 8Mhz,4Mhz and 2Mhz (CLKCON0KEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_CLKCON0KEY_Struct
 *! \brief  Enable Clock Division to 8Mhz,4Mhz and 2Mhz Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_CLKCON0KEY_t__
typedef struct _ADI_AFECON_CLKCON0KEY_t {
  union {
    struct {
      uint16_t divsysclk_ulp_en : 16;  /**< Enable Clock Division to 8Mhz,4Mhz and 2Mhz */
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_CLKCON0KEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_CLKCON0KEY_t__ */

/*@}*/

/** @defgroup MKEY MKEY (MKEY) Register
 *  MKEY (MKEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_MKEY_Struct
 *! \brief  MKEY Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_MKEY_t__
typedef struct _ADI_AFECON_MKEY_t {
  union {
    struct {
      uint16_t KEY        : 16;  /**< Key to Unlock SWRSTCON */
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_MKEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_MKEY_t__ */

/*@}*/

/** @defgroup DSPUPDATEEN DSP Update Enable (DSPUPDATEEN) Register
 *  DSP Update Enable (DSPUPDATEEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECON_DSPUPDATEEN_Struct
 *! \brief  DSP Update Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_DSPUPDATEEN_t__
typedef struct _ADI_AFECON_DSPUPDATEEN_t {
  union {
    struct {
      uint16_t DSPLOOP    :  1;  /**< ADC Digital Logic Test */
      uint16_t reserved1  : 15;
    };
    uint16_t VALUE16;
  };
} ADI_AFECON_DSPUPDATEEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_DSPUPDATEEN_t__ */

/*@}*/

/** @defgroup WDTLD Watchdog Timer Load Value (WDTLD) Register
 *  Watchdog Timer Load Value (WDTLD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTLD_Struct
 *! \brief  Watchdog Timer Load Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTLD_t__
typedef struct _ADI_AFEWDT_WDTLD_t {
  union {
    struct {
      int16_t LOAD       : 16;  /**< WDT Load Value */
    };
    int16_t VALUE16;
  };
} ADI_AFEWDT_WDTLD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTLD_t__ */

/*@}*/

/** @defgroup WDTVALS Current Count Value (WDTVALS) Register
 *  Current Count Value (WDTVALS) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTVALS_Struct
 *! \brief  Current Count Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTVALS_t__
typedef struct _ADI_AFEWDT_WDTVALS_t {
  union {
    struct {
      int16_t CCOUNT     : 16;  /**< Current WDT Count Value. */
    };
    int16_t VALUE16;
  };
} ADI_AFEWDT_WDTVALS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTVALS_t__ */

/*@}*/

/** @defgroup WDTCON Watchdog Timer Control Register (WDTCON) Register
 *  Watchdog Timer Control Register (WDTCON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFEWDT_WDTCON_PDSTOP
 *! \brief  Power Down Stop Enable (PDSTOP) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFEWDT_WDTCON_CONTINUE = 0,  /**< Continue Counting When In Hibernate */
  AFEWDT_WDTCON_STOP     = 1   /**< Stop Counter When In Hibernate.     */
} ADI_AFEWDT_WDTCON_PDSTOP;


/*  =========================================================================
 *! \enum   ADI_AFEWDT_WDTCON_IRQ
 *! \brief  WDT Interrupt Enable (IRQ) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFEWDT_WDTCON_RESET     = 0,  /**< Watchdog Timer timeout creates a reset.                        */
  AFEWDT_WDTCON_INTERRUPT = 1   /**< Watchdog Timer timeout creates an interrupt instead of reset.  */
} ADI_AFEWDT_WDTCON_IRQ;


/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTCON_Struct
 *! \brief  Watchdog Timer Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTCON_t__
typedef struct _ADI_AFEWDT_WDTCON_t {
  union {
    struct {
      uint16_t PDSTOP     :  1;  /**< Power Down Stop Enable */
      uint16_t IRQ        :  1;  /**< WDT Interrupt Enable */
      uint16_t PRE        :  2;  /**< Prescaler. */
      uint16_t reserved4  :  1;
      uint16_t EN         :  1;  /**< Timer Enable */
      uint16_t MDE        :  1;  /**< Timer Mode Select */
      uint16_t Reserved1_7 :  1;  /**< Reserved */
      uint16_t CLKDIV2     :  1;  /**< Clock Source */
      uint16_t MINLOAD_EN  :  1;  /**< Timer Window Control */
      uint16_t WDTIRQEN    :  1;  /**< WDT Interrupt Enable */
      uint16_t RESERVED_15_11 :  5;  /**< RESERVED */
    };
    uint16_t VALUE16;
  };
} ADI_AFEWDT_WDTCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTCON_t__ */

/*@}*/

