analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup WDTCLRI Refresh Watchdog Register (WDTCLRI) Register
 *  Refresh Watchdog Register (WDTCLRI) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTCLRI_Struct
 *! \brief  Refresh Watchdog Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTCLRI_t__
typedef struct _ADI_AFEWDT_WDTCLRI_t {
  union {
    struct {
      int16_t CLRWDG     : 16;  /**< Refresh Register */
    };
    int16_t VALUE16;
  };
} ADI_AFEWDT_WDTCLRI_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTCLRI_t__ */

/*@}*/

/** @defgroup WDTSTA Timer Status (WDTSTA) Register
 *  Timer Status (WDTSTA) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFEWDT_WDTSTA_IRQ
 *! \brief  WDT Interrupt (IRQ) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFEWDT_WDTSTA_CLEARED = 0,  /**< Watchdog Timer Interrupt Not Pending */
  AFEWDT_WDTSTA_PENDING = 1   /**< Watchdog Timer Interrupt Pending     */
} ADI_AFEWDT_WDTSTA_IRQ;


/*  =========================================================================
 *! \enum   ADI_AFEWDT_WDTSTA_TLD
 *! \brief  WDTVAL Write Status (TLD) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFEWDT_WDTSTA_SYNC_COMPLETE    = 0,  /**< Arm and AFE Watchdog Clock Domains WDTLD values match */
  AFEWDT_WDTSTA_SYNC_IN_PROGRESS = 1   /**< Synchronize In Progress                               */
} ADI_AFEWDT_WDTSTA_TLD;


/*  =========================================================================
 *! \enum   ADI_AFEWDT_WDTSTA_LOCK
 *! \brief  Lock Status (LOCK) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFEWDT_WDTSTA_OPEN   = 0,  /**< Timer Operation Not Locked */
  AFEWDT_WDTSTA_LOCKED = 1   /**< Timer Enabled and Locked   */
} ADI_AFEWDT_WDTSTA_LOCK;


/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTSTA_Struct
 *! \brief  Timer Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTSTA_t__
typedef struct _ADI_AFEWDT_WDTSTA_t {
  union {
    struct {
      uint16_t IRQ        :  1;  /**< WDT Interrupt */
      uint16_t CLRI       :  1;  /**< WDTCLRI Write Status */
      uint16_t TLD        :  1;  /**< WDTVAL Write Status */
      uint16_t CON        :  1;  /**< WDTCON Write Status */
      uint16_t LOCK       :  1;  /**< Lock Status */
      uint16_t OTPWRDONE  :  1;  /**< Reset Type Status */
      uint16_t TMINLD     :  1;  /**< WDTMINLD Write Status */
      uint16_t RESERVED_15_7 :  9;  /**< RESERVED */
    };
    uint16_t VALUE16;
  };
} ADI_AFEWDT_WDTSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTSTA_t__ */

/*@}*/

/** @defgroup WDTMINLD Minimum Load Value (WDTMINLD) Register
 *  Minimum Load Value (WDTMINLD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFEWDT_WDTMINLD_Struct
 *! \brief  Minimum Load Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTMINLD_t__
typedef struct _ADI_AFEWDT_WDTMINLD_t {
  union {
    struct {
      int16_t MIN_LOAD   : 16;  /**< WDT Min Load Value */
    };
    int16_t VALUE16;
  };
} ADI_AFEWDT_WDTMINLD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_WDTMINLD_t__ */

/*@}*/

/** @defgroup PWRMOD Power Modes (PWRMOD) Register
 *  Power Modes (PWRMOD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_PWRMOD_Struct
 *! \brief  Power Modes Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_PWRMOD_t__
typedef struct _ADI_ALLON_PWRMOD_t {
  union {
    struct {
      uint16_t PWRMOD     :  2;  /**< Power Mode Control Bits */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_PWRMOD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_PWRMOD_t__ */

/*@}*/

/** @defgroup PWRKEY Key Protection for PWRMOD (PWRKEY) Register
 *  Key Protection for PWRMOD (PWRKEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_PWRKEY_Struct
 *! \brief  Key Protection for PWRMOD Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_PWRKEY_t__
typedef struct _ADI_ALLON_PWRKEY_t {
  union {
    struct {
      int16_t PWRKEY     : 16;  /**< PWRMOD Key Register */
    };
    int16_t VALUE16;
  };
} ADI_ALLON_PWRKEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_PWRKEY_t__ */

/*@}*/

/** @defgroup OSCKEY Key Protection for OSCCON (OSCKEY) Register
 *  Key Protection for OSCCON (OSCKEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_OSCKEY_Struct
 *! \brief  Key Protection for OSCCON Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_OSCKEY_t__
typedef struct _ADI_ALLON_OSCKEY_t {
  union {
    struct {
      int16_t OSCKEY     : 16;  /**< Oscillator Control Key Register. */
    };
    int16_t VALUE16;
  };
} ADI_ALLON_OSCKEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_OSCKEY_t__ */

/*@}*/

/** @defgroup OSCCON Oscillator Control (OSCCON) Register
 *  Oscillator Control (OSCCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_OSCCON_Struct
 *! \brief  Oscillator Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_OSCCON_t__
typedef struct _ADI_ALLON_OSCCON_t {
  union {
    struct {
      uint16_t LFOSCEN    :  1;  /**< Low Frequency Internal Oscillator Enable */
      uint16_t HFOSCEN    :  1;  /**< High Frequency Internal Oscillator Enable */
      uint16_t HFXTALEN   :  1;  /**< High Frequency Crystal Oscillator Enable */
      uint16_t reserved3  :  5;
      uint16_t LFOSCOK    :  1;  /**< Status of LFOSC Oscillator */
      uint16_t HFOSCOK    :  1;  /**< Status of HFOSC Oscillator */
      uint16_t HFXTALOK   :  1;  /**< Status of HFXTAL Oscillator */
      uint16_t reserved11 :  5;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_OSCCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_OSCCON_t__ */

/*@}*/

