analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup EI2CON External Interrupt Configuration 2 (EI2CON) Register
 *  External Interrupt Configuration 2 (EI2CON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_EI2CON_Struct
 *! \brief  External Interrupt Configuration 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_EI2CON_t__
typedef struct _ADI_ALLON_EI2CON_t {
  union {
    struct {
      uint16_t BUSINTMDE  :  3;  /**< BUS Interrupt Detection Mode Registers */
      uint16_t BUSINTEN   :  1;  /**< BUS Interrupt Detection Enable Bit */
      uint16_t reserved4  : 12;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_EI2CON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_EI2CON_t__ */

/*@}*/

/** @defgroup EICLR External Interrupt Clear (EICLR) Register
 *  External Interrupt Clear (EICLR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_EICLR_Struct
 *! \brief  External Interrupt Clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_EICLR_t__
typedef struct _ADI_ALLON_EICLR_t {
  union {
    struct {
      uint16_t reserved0  :  8;
      uint16_t BUSINT     :  1;  /**< BUS Interrupt */
      uint16_t reserved9   :  6;
      uint16_t AUTCLRBUSEN :  1;  /**< Enable Auto Clear of Bus Interrupt */
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_EICLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_EICLR_t__ */

/*@}*/

/** @defgroup RSTSTA Reset Status (RSTSTA) Register
 *  Reset Status (RSTSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_RSTSTA_Struct
 *! \brief  Reset Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_RSTSTA_t__
typedef struct _ADI_ALLON_RSTSTA_t {
  union {
    struct {
      uint16_t POR        :  1;  /**< Power-on Reset */
      uint16_t EXTRST     :  1;  /**< External Reset */
      uint16_t WDRST      :  1;  /**< Watchdog Timeout */
      uint16_t MMRSWRST   :  1;  /**< MMR Software Reset */
      uint16_t reserved4  : 12;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_RSTSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_RSTSTA_t__ */

/*@}*/

/** @defgroup PMUSTA PMU Status (PMUSTA) Register
 *  PMU Status (PMUSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_PMUSTA_Struct
 *! \brief  PMU Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_PMUSTA_t__
typedef struct _ADI_ALLON_PMUSTA_t {
  union {
    struct {
      uint16_t PMUSTATE   :  3;  /**< PMU FSM States */
      uint16_t reserved3  : 13;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_PMUSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_PMUSTA_t__ */

/*@}*/

/** @defgroup CLKEN0 32KHz Peripheral Clock Enable (CLKEN0) Register
 *  32KHz Peripheral Clock Enable (CLKEN0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ALLON_CLKEN0_Struct
 *! \brief  32KHz Peripheral Clock Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_CLKEN0_t__
typedef struct _ADI_ALLON_CLKEN0_t {
  union {
    struct {
      uint16_t WDTDIS     :  1;  /**< Watch Dog Timer Clock Disable */
      uint16_t SLPWUTDIS  :  1;  /**< Sleep/Wakeup Timer Clock Disable */
      uint16_t TIACHPDIS  :  1;  /**< TIA Chop Clock Disable */
      uint16_t reserved3  : 13;
    };
    uint16_t VALUE16;
  };
} ADI_ALLON_CLKEN0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_CLKEN0_t__ */

/*@}*/

/** @defgroup LD0 16-bit Load Value Register. (LD0) Register
 *  16-bit Load Value Register. (LD0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_LD0_Struct
 *! \brief  16-bit Load Value Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_LD0_t__
typedef struct _ADI_AGPT0_LD0_t {
  union {
    struct {
      int16_t LOAD       : 16;  /**< Load Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_LD0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_LD0_t__ */

/*@}*/

/** @defgroup VAL0 16-Bit Timer Value Register. (VAL0) Register
 *  16-Bit Timer Value Register. (VAL0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_VAL0_Struct
 *! \brief  16-Bit Timer Value Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_VAL0_t__
typedef struct _ADI_AGPT0_VAL0_t {
  union {
    struct {
      int16_t VAL        : 16;  /**< Current Count */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_VAL0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_VAL0_t__ */

/*@}*/

/** @defgroup CON0 Control Register. (CON0) Register
 *  Control Register. (CON0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_CON0_Struct
 *! \brief  Control Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_CON0_t__
typedef struct _ADI_AGPT0_CON0_t {
  union {
    struct {
      uint16_t PRE        :  2;  /**< Prescaler */
      uint16_t UP         :  1;  /**< Count up */
      uint16_t MOD        :  1;  /**< Timer Mode */
      uint16_t ENABLE     :  1;  /**< Timer Enable */
      uint16_t CLK        :  2;  /**< Clock Select */
      uint16_t RLD        :  1;  /**< Reload Control */
      uint16_t EVENT      :  5;  /**< Event Select Range */
      uint16_t EVTEN      :  1;  /**< Event Select */
      uint16_t RSTEN      :  1;  /**< Counter and Prescale Reset Enable */
      uint16_t SYNCBYP    :  1;  /**< Synchronization Bypass */
    };
    uint16_t VALUE16;
  };
} ADI_AGPT0_CON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_CON0_t__ */

/*@}*/

/** @defgroup CLRI0 Clear Interrupt Register. (CLRI0) Register
 *  Clear Interrupt Register. (CLRI0) Register.
 *  @{
 */

