analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AGPT0_CLRI0_Struct
 *! \brief  Clear Interrupt Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_CLRI0_t__
typedef struct _ADI_AGPT0_CLRI0_t {
  union {
    struct {
      uint16_t TMOUT      :  1;  /**< Clear Timeout Interrupt */
      uint16_t CAP        :  1;  /**< Clear Captured Event Interrupt */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT0_CLRI0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_CLRI0_t__ */

/*@}*/

/** @defgroup CAP0 Capture Register. (CAP0) Register
 *  Capture Register. (CAP0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_CAP0_Struct
 *! \brief  Capture Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_CAP0_t__
typedef struct _ADI_AGPT0_CAP0_t {
  union {
    struct {
      int16_t CAP        : 16;  /**< 16-bit Captured Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_CAP0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_CAP0_t__ */

/*@}*/

/** @defgroup ALD0 16-Bit Load Value, Asynchronous. (ALD0) Register
 *  16-Bit Load Value, Asynchronous. (ALD0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_ALD0_Struct
 *! \brief  16-Bit Load Value, Asynchronous. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_ALD0_t__
typedef struct _ADI_AGPT0_ALD0_t {
  union {
    struct {
      int16_t ALOAD      : 16;  /**< Load Value, Asynchronous */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_ALD0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_ALD0_t__ */

/*@}*/

/** @defgroup AVAL0 16-Bit Timer Value, Asynchronous Register. (AVAL0) Register
 *  16-Bit Timer Value, Asynchronous Register. (AVAL0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_AVAL0_Struct
 *! \brief  16-Bit Timer Value, Asynchronous Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_AVAL0_t__
typedef struct _ADI_AGPT0_AVAL0_t {
  union {
    struct {
      int16_t AVAL       : 16;  /**< Counter Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_AVAL0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_AVAL0_t__ */

/*@}*/

/** @defgroup STA0 Status Register. (STA0) Register
 *  Status Register. (STA0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_STA0_Struct
 *! \brief  Status Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_STA0_t__
typedef struct _ADI_AGPT0_STA0_t {
  union {
    struct {
      uint16_t TMOUT      :  1;  /**< Timeout Event Occurred */
      uint16_t CAP        :  1;  /**< Capture Event Pending */
      uint16_t reserved2  :  4;
      uint16_t BUSY       :  1;  /**< Timer Busy */
      uint16_t PDOK       :  1;  /**< Clear Interrupt Register Synchronization */
      uint16_t RSTCNT     :  1;  /**< Counter Reset Occurring */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT0_STA0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_STA0_t__ */

/*@}*/

/** @defgroup PWMCON0 PWM Control Register. (PWMCON0) Register
 *  PWM Control Register. (PWMCON0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_PWMCON0_Struct
 *! \brief  PWM Control Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_PWMCON0_t__
typedef struct _ADI_AGPT0_PWMCON0_t {
  union {
    struct {
      uint16_t MATCHEN    :  1;  /**< PWM Match Enabled */
      uint16_t IDLE       :  1;  /**< PWM Idle State */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT0_PWMCON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_PWMCON0_t__ */

/*@}*/

/** @defgroup PWMMAT0 PWM Match Value Register. (PWMMAT0) Register
 *  PWM Match Value Register. (PWMMAT0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_PWMMAT0_Struct
 *! \brief  PWM Match Value Register. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_PWMMAT0_t__
typedef struct _ADI_AGPT0_PWMMAT0_t {
  union {
    struct {
      int16_t MATCHVAL   : 16;  /**< PWM Match Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT0_PWMMAT0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_PWMMAT0_t__ */

/*@}*/

/** @defgroup INTEN Interrupt Enable (INTEN) Register
 *  Interrupt Enable (INTEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT0_INTEN_Struct
 *! \brief  Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_INTEN_t__
typedef struct _ADI_AGPT0_INTEN_t {
  union {
    struct {
      uint16_t INTEN      :  1;  /**< Interrupt Enable */
      uint16_t reserved1  : 15;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT0_INTEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_INTEN_t__ */

/*@}*/

/** @defgroup LD1 16-bit Load Value Register (LD1) Register
 *  16-bit Load Value Register (LD1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_LD1_Struct
 *! \brief  16-bit Load Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_LD1_t__
typedef struct _ADI_AGPT1_LD1_t {
  union {
    struct {
      int16_t LOAD       : 16;  /**< Load Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_LD1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_LD1_t__ */

/*@}*/

/** @defgroup VAL1 16-bit Timer Value Register (VAL1) Register
 *  16-bit Timer Value Register (VAL1) Register.
 *  @{
 */

