analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AGPT1_VAL1_Struct
 *! \brief  16-bit Timer Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_VAL1_t__
typedef struct _ADI_AGPT1_VAL1_t {
  union {
    struct {
      int16_t VAL        : 16;  /**< Current Count */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_VAL1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_VAL1_t__ */

/*@}*/

/** @defgroup CON1 Control Register (CON1) Register
 *  Control Register (CON1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_CON1_Struct
 *! \brief  Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_CON1_t__
typedef struct _ADI_AGPT1_CON1_t {
  union {
    struct {
      uint16_t PRE        :  2;  /**< Prescaler */
      uint16_t UP         :  1;  /**< Count up */
      uint16_t MOD        :  1;  /**< Timer Mode */
      uint16_t ENABLE     :  1;  /**< Timer Enable */
      uint16_t CLK        :  2;  /**< Clock Select */
      uint16_t RLD        :  1;  /**< Reload Control */
      uint16_t EVENT      :  5;  /**< Event Select Range */
      uint16_t EVENTEN    :  1;  /**< Event Select */
      uint16_t RSTEN      :  1;  /**< Counter and Prescale Reset Enable */
      uint16_t SYNCBYP    :  1;  /**< Synchronization Bypass */
    };
    uint16_t VALUE16;
  };
} ADI_AGPT1_CON1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_CON1_t__ */

/*@}*/

/** @defgroup CLRI1 Clear Interrupt Register (CLRI1) Register
 *  Clear Interrupt Register (CLRI1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_CLRI1_Struct
 *! \brief  Clear Interrupt Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_CLRI1_t__
typedef struct _ADI_AGPT1_CLRI1_t {
  union {
    struct {
      uint16_t TMOUT      :  1;  /**< Clear Timeout Interrupt */
      uint16_t CAP        :  1;  /**< Clear Captured Event Interrupt */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT1_CLRI1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_CLRI1_t__ */

/*@}*/

/** @defgroup CAP1 Capture Register (CAP1) Register
 *  Capture Register (CAP1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_CAP1_Struct
 *! \brief  Capture Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_CAP1_t__
typedef struct _ADI_AGPT1_CAP1_t {
  union {
    struct {
      int16_t CAP        : 16;  /**< 16-bit Captured Value. */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_CAP1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_CAP1_t__ */

/*@}*/

/** @defgroup ALD1 16-bit Load Value, Asynchronous Register (ALD1) Register
 *  16-bit Load Value, Asynchronous Register (ALD1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_ALD1_Struct
 *! \brief  16-bit Load Value, Asynchronous Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_ALD1_t__
typedef struct _ADI_AGPT1_ALD1_t {
  union {
    struct {
      int16_t ALOAD      : 16;  /**< Load Value, Asynchronous */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_ALD1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_ALD1_t__ */

/*@}*/

/** @defgroup AVAL1 16-bit Timer Value, Asynchronous Register (AVAL1) Register
 *  16-bit Timer Value, Asynchronous Register (AVAL1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_AVAL1_Struct
 *! \brief  16-bit Timer Value, Asynchronous Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_AVAL1_t__
typedef struct _ADI_AGPT1_AVAL1_t {
  union {
    struct {
      int16_t AVAL       : 16;  /**< Counter Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_AVAL1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_AVAL1_t__ */

/*@}*/

/** @defgroup STA1 Status Register (STA1) Register
 *  Status Register (STA1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_STA1_Struct
 *! \brief  Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_STA1_t__
typedef struct _ADI_AGPT1_STA1_t {
  union {
    struct {
      uint16_t TMOUT      :  1;  /**< Timeout Event Occurred */
      uint16_t CAP        :  1;  /**< Capture Event Pending */
      uint16_t reserved2  :  4;
      uint16_t BUSY       :  1;  /**< Timer Busy */
      uint16_t PDOK       :  1;  /**< Clear Interrupt Register Synchronization */
      uint16_t RSTCNT     :  1;  /**< Counter Reset Occurring */
      uint16_t reserved9  :  7;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT1_STA1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_STA1_t__ */

/*@}*/

/** @defgroup PWMCON1 PWM Control Register (PWMCON1) Register
 *  PWM Control Register (PWMCON1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_PWMCON1_Struct
 *! \brief  PWM Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_PWMCON1_t__
typedef struct _ADI_AGPT1_PWMCON1_t {
  union {
    struct {
      uint16_t MATCHEN    :  1;  /**< PWM Match Enabled. */
      uint16_t IDLE       :  1;  /**< PWM Idle State. */
      uint16_t reserved2  : 14;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT1_PWMCON1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_PWMCON1_t__ */

/*@}*/

/** @defgroup PWMMAT1 PWM Match Value Register (PWMMAT1) Register
 *  PWM Match Value Register (PWMMAT1) Register.
 *  @{
 */

