analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AGPT1_PWMMAT1_Struct
 *! \brief  PWM Match Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_PWMMAT1_t__
typedef struct _ADI_AGPT1_PWMMAT1_t {
  union {
    struct {
      int16_t MATCHVAL   : 16;  /**< PWM Match Value */
    };
    int16_t VALUE16;
  };
} ADI_AGPT1_PWMMAT1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_PWMMAT1_t__ */

/*@}*/

/** @defgroup INTEN1 Interrupt Enable (INTEN1) Register
 *  Interrupt Enable (INTEN1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AGPT1_INTEN1_Struct
 *! \brief  Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_INTEN1_t__
typedef struct _ADI_AGPT1_INTEN1_t {
  union {
    struct {
      uint16_t INTEN      :  1;  /**< Interrupt Enable */
      uint16_t reserved1  : 15;
    };
    uint16_t VALUE16;
  };
} ADI_AGPT1_INTEN1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_INTEN1_t__ */

/*@}*/

/** @defgroup CTL CRC Control Register (CTL) Register
 *  CRC Control Register (CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_CTL_Struct
 *! \brief  CRC Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_CTL_t__
typedef struct _ADI_AFECRC_CTL_t {
  union {
    struct {
      uint32_t EN         :  1;  /**< CRC Peripheral Enable */
      uint32_t LSBFIRST   :  1;  /**< LSB First Calculation Order */
      uint32_t BITMIRR    :  1;  /**< Bit Mirroring. */
      uint32_t BYTMIRR    :  1;  /**< Byte Mirroring. */
      uint32_t W16SWP     :  1;  /**< Word16 Swap Enabled. */
      uint32_t reserved5  :  4;
      uint32_t MON_EN     :  1;  /**< Enable Apb32/Apb16 to Get Address/Data for CRC Calculation */
      uint32_t reserved10 : 18;
      uint32_t RevID      :  4;  /**< Revision ID */
    };
    uint32_t VALUE32;
  };
} ADI_AFECRC_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_CTL_t__ */

/*@}*/

/** @defgroup IPDATA Data Input. (IPDATA) Register
 *  Data Input. (IPDATA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_IPDATA_Struct
 *! \brief  Data Input. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_IPDATA_t__
typedef struct _ADI_AFECRC_IPDATA_t {
  union {
    struct {
      int32_t VALUE      : 32;  /**< Data Input. */
    };
    int32_t VALUE32;
  };
} ADI_AFECRC_IPDATA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_IPDATA_t__ */

/*@}*/

/** @defgroup RESULT CRC Residue (RESULT) Register
 *  CRC Residue (RESULT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_RESULT_Struct
 *! \brief  CRC Residue Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_RESULT_t__
typedef struct _ADI_AFECRC_RESULT_t {
  union {
    struct {
      int32_t VALUE      : 32;  /**< CRC Residue */
    };
    int32_t VALUE32;
  };
} ADI_AFECRC_RESULT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_RESULT_t__ */

/*@}*/

/** @defgroup POLY CRC Reduction Polynomial (POLY) Register
 *  CRC Reduction Polynomial (POLY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_POLY_Struct
 *! \brief  CRC Reduction Polynomial Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_POLY_t__
typedef struct _ADI_AFECRC_POLY_t {
  union {
    struct {
      uint32_t VALUE      : 32;  /**< CRC Reduction Polynomial */
    };
    uint32_t VALUE32;
  };
} ADI_AFECRC_POLY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_POLY_t__ */

/*@}*/

/** @defgroup IPBITS Input Data Bits (IPBITS) Register
 *  Input Data Bits (IPBITS) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_IPBITS_Struct
 *! \brief  Input Data Bits Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_IPBITS_t__
typedef struct _ADI_AFECRC_IPBITS_t {
  union {
    struct {
      uint8_t DATA_BITS  :  8;  /**< Input Data Bits. */
    };
    uint8_t VALUE8;
  };
} ADI_AFECRC_IPBITS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_IPBITS_t__ */

/*@}*/

/** @defgroup IPBYTE Input Data Byte (IPBYTE) Register
 *  Input Data Byte (IPBYTE) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_IPBYTE_Struct
 *! \brief  Input Data Byte Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_IPBYTE_t__
typedef struct _ADI_AFECRC_IPBYTE_t {
  union {
    struct {
      uint8_t DATA_BYTE  :  8;  /**< Input Data Byte. */
    };
    uint8_t VALUE8;
  };
} ADI_AFECRC_IPBYTE_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_IPBYTE_t__ */

/*@}*/

/** @defgroup CRC_SIG_COMP CRC Signature Compare Data Input. (CRC_SIG_COMP) Register
 *  CRC Signature Compare Data Input. (CRC_SIG_COMP) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_CRC_SIG_COMP_Struct
 *! \brief  CRC Signature Compare Data Input. Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_CRC_SIG_COMP_t__
typedef struct _ADI_AFECRC_CRC_SIG_COMP_t {
  union {
    struct {
      uint32_t CRC_SIG    : 32;  /**< CRC Signature Compare Data Input. */
    };
    uint32_t VALUE32;
  };
} ADI_AFECRC_CRC_SIG_COMP_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_CRC_SIG_COMP_t__ */

/*@}*/

