analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup CRCINTEN CRC Error Interrupt Enable Bit (CRCINTEN) Register
 *  CRC Error Interrupt Enable Bit (CRCINTEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_CRCINTEN_Struct
 *! \brief  CRC Error Interrupt Enable Bit Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_CRCINTEN_t__
typedef struct _ADI_AFECRC_CRCINTEN_t {
  union {
    struct {
      uint32_t CRC_ERR_EN :  1;  /**< CRC Error Interrupt Enable Bit */
      uint32_t reserved_31_1 : 31;  /**< Reserved */
    };
    uint32_t VALUE32;
  };
} ADI_AFECRC_CRCINTEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_CRCINTEN_t__ */

/*@}*/

/** @defgroup INTSTA CRC Error Interrupt Status Bit (INTSTA) Register
 *  CRC Error Interrupt Status Bit (INTSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFECRC_INTSTA_Struct
 *! \brief  CRC Error Interrupt Status Bit Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_INTSTA_t__
typedef struct _ADI_AFECRC_INTSTA_t {
  union {
    struct {
      uint32_t CRC_ERR_ST :  1;  /**< CRC Error Interrupt Status Bit */
      uint32_t reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_AFECRC_INTSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_INTSTA_t__ */

/*@}*/

/** @defgroup AFECON AFE Configuration (AFECON) Register
 *  AFE Configuration (AFECON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_AFECON_DACEN
 *! \brief  High Power DAC Enable (DACEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_AFECON_OFF = 0,  /**< High Power DAC Disabled */
  AFE_AFECON_ON  = 1   /**< High Power DAC Enabled  */
} ADI_AFE_AFECON_DACEN;


/* ==========================================================================
 *! \struct ADI_AFE_AFECON_Struct
 *! \brief  AFE Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_AFECON_t__
typedef struct _ADI_AFE_AFECON_t {
  union {
    struct {
      uint32_t reserved0  :  5;
      uint32_t HPREFDIS   :  1;  /**< Disable High Power Reference */
      uint32_t DACEN      :  1;  /**< High Power DAC Enable */
      uint32_t ADCEN      :  1;  /**< ADC Power Enable */
      uint32_t ADCCONVEN  :  1;  /**< ADC Conversion Start Enable */
      uint32_t EXBUFEN    :  1;  /**< Enable Excitation Buffer */
      uint32_t INAMPEN    :  1;  /**< Enable Excitation Amplifier */
      uint32_t TIAEN      :  1;  /**< High Power TIA Enable */
      uint32_t TEMPSENSEN0 :  1;  /**< ADC Temperature Sensor Channel Enable */
      uint32_t TEMPCONVEN  :  1;  /**< ADC Temp Sensor Convert Enable */
      uint32_t WAVEGENEN   :  1;  /**< Waveform Generator Enable */
      uint32_t DFTEN       :  1;  /**< DFT Hardware Accelerator Enable */
      uint32_t SINC2EN     :  1;  /**< ADC Output 50/60Hz Filter Enable */
      uint32_t reserved17   :  2;
      uint32_t ALDOILIMITEN :  1;  /**< Analog LDO Current Limiting Enable */
      uint32_t DACREFEN     :  1;  /**< High Speed DAC Reference Enable */
      uint32_t DACBUFEN     :  1;  /**< Enable DC DAC Buffer */
      uint32_t reserved22   : 10;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_AFECON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_AFECON_t__ */

/*@}*/

/** @defgroup SWCON Switch Matrix Configuration (SWCON) Register
 *  Switch Matrix Configuration (SWCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_SWCON_Struct
 *! \brief  Switch Matrix Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_SWCON_t__
typedef struct _ADI_AFE_SWCON_t {
  union {
    struct {
      uint32_t DMUXCON    :  4;  /**< Control of D Switch MUX */
      uint32_t PMUXCON    :  4;  /**< Control of P Switch MUX */
      uint32_t NMUXCON    :  4;  /**< Control of N Switch MUX */
      uint32_t TMUXCON    :  4;  /**< Control of T Switch MUX. */
      uint32_t SWSOURCESEL :  1;  /**< Switch Control Select */
      uint32_t T9CON       :  1;  /**< Control of T[9] */
      uint32_t T10CON      :  1;  /**< Control of T[10] */
      uint32_t T11CON      :  1;  /**< Control of T[11] */
      uint32_t reserved20  : 12;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_SWCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_SWCON_t__ */

/*@}*/

/** @defgroup HSDACCON High Speed DAC Configuration (HSDACCON) Register
 *  High Speed DAC Configuration (HSDACCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_HSDACCON_Struct
 *! \brief  High Speed DAC Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_HSDACCON_t__
typedef struct _ADI_AFE_HSDACCON_t {
  union {
    struct {
      uint32_t ATTENEN    :  1;  /**< PGA Stage Gain Attenuation */
      uint32_t RATE       :  8;  /**< DAC Update Rate */
      uint32_t reserved9  :  3;
      uint32_t INAMPGNMDE :  1;  /**< Excitation Amplifier Gain Control */
      uint32_t reserved13 : 19;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_HSDACCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_HSDACCON_t__ */

/*@}*/

/** @defgroup WGCON Waveform Generator Configuration (WGCON) Register
 *  Waveform Generator Configuration (WGCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_WGCON_Struct
 *! \brief  Waveform Generator Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_WGCON_t__
typedef struct _ADI_AFE_WGCON_t {
  union {
    struct {
      uint32_t reserved0  :  1;
      uint32_t TYPESEL    :  2;  /**< Selects the Type of Waveform */
      uint32_t reserved3    :  1;
      uint32_t DACOFFSETCAL :  1;  /**< Bypass DAC Offset */
      uint32_t DACGAINCAL   :  1;  /**< Bypass DAC Gain */
      uint32_t reserved6    : 26;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_WGCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_WGCON_t__ */

/*@}*/

/** @defgroup WGFCW Waveform Generator - Sinusoid Frequency Control Word (WGFCW) Register
 *  Waveform Generator - Sinusoid Frequency Control Word (WGFCW) Register.
 *  @{
 */

