analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_WGFCW_Struct
 *! \brief  Waveform Generator - Sinusoid Frequency Control Word Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_WGFCW_t__
typedef struct _ADI_AFE_WGFCW_t {
  union {
    struct {
      uint32_t SINEFCW    : 24;  /**< Sinusoid Generator Frequency Control Word */
      uint32_t reserved24 :  8;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_WGFCW_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_WGFCW_t__ */

/*@}*/

/** @defgroup WGPHASE Waveform Generator - Sinusoid Phase Offset (WGPHASE) Register
 *  Waveform Generator - Sinusoid Phase Offset (WGPHASE) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_WGPHASE_Struct
 *! \brief  Waveform Generator - Sinusoid Phase Offset Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_WGPHASE_t__
typedef struct _ADI_AFE_WGPHASE_t {
  union {
    struct {
      uint32_t SINEOFFSET : 20;  /**< Sinusoid Phase Offset */
      uint32_t reserved20 : 12;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_WGPHASE_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_WGPHASE_t__ */

/*@}*/

/** @defgroup WGOFFSET Waveform Generator - Sinusoid Offset (WGOFFSET) Register
 *  Waveform Generator - Sinusoid Offset (WGOFFSET) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_WGOFFSET_Struct
 *! \brief  Waveform Generator - Sinusoid Offset Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_WGOFFSET_t__
typedef struct _ADI_AFE_WGOFFSET_t {
  union {
    struct {
      uint32_t SINEOFFSET : 12;  /**< Sinusoid Offset */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_WGOFFSET_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_WGOFFSET_t__ */

/*@}*/

/** @defgroup WGAMPLITUDE Waveform Generator - Sinusoid Amplitude (WGAMPLITUDE) Register
 *  Waveform Generator - Sinusoid Amplitude (WGAMPLITUDE) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_WGAMPLITUDE_Struct
 *! \brief  Waveform Generator - Sinusoid Amplitude Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_WGAMPLITUDE_t__
typedef struct _ADI_AFE_WGAMPLITUDE_t {
  union {
    struct {
      uint32_t SINEAMPLITUDE : 11;  /**< Sinusoid Amplitude */
      uint32_t reserved11    : 21;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_WGAMPLITUDE_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_WGAMPLITUDE_t__ */

/*@}*/

/** @defgroup ADCFILTERCON ADC Output Filters Configuration (ADCFILTERCON) Register
 *  ADC Output Filters Configuration (ADCFILTERCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCFILTERCON_Struct
 *! \brief  ADC Output Filters Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCFILTERCON_t__
typedef struct _ADI_AFE_ADCFILTERCON_t {
  union {
    struct {
      uint32_t ADCCLK     :  1;  /**< ADC Data Rate */
      uint32_t reserved1  :  3;
      uint32_t LPFBYPEN   :  1;  /**< 50/60Hz Low Pass Filter */
      uint32_t reserved5  :  1;
      uint32_t SINC3BYP   :  1;  /**< SINC3 Filter Bypass */
      uint32_t AVRGEN     :  1;  /**< Average Function Enable */
      uint32_t SINC2OSR   :  4;  /**< SINC2 OSR */
      uint32_t SINC3OSR   :  2;  /**< SINC3 OSR */
      uint32_t AVRGNUM    :  2;  /**< Number of Samples Averaged */
      uint32_t SINC2CLKENB :  1;  /**< SINC2 Filter Clock Enable */
      uint32_t DACWAVECLKENB :  1;  /**< DAC Wave Clock Enable */
      uint32_t DFTCLKENB     :  1;  /**< DFT Clock Enable */
      uint32_t reserved19    : 13;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCFILTERCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCFILTERCON_t__ */

/*@}*/

/** @defgroup HSDACDAT HS DAC Code (HSDACDAT) Register
 *  HS DAC Code (HSDACDAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_HSDACDAT_Struct
 *! \brief  HS DAC Code Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_HSDACDAT_t__
typedef struct _ADI_AFE_HSDACDAT_t {
  union {
    struct {
      uint32_t DACDAT     : 12;  /**< DAC Code */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_HSDACDAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_HSDACDAT_t__ */

/*@}*/

/** @defgroup LPREFBUFCON LPREF_BUF_CON (LPREFBUFCON) Register
 *  LPREF_BUF_CON (LPREFBUFCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_LPREFBUFCON_Struct
 *! \brief  LPREF_BUF_CON Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPREFBUFCON_t__
typedef struct _ADI_AFE_LPREFBUFCON_t {
  union {
    struct {
      uint32_t LPREFDIS   :  1;  /**< Set This Bit Will Power Down Low Power Bandgap */
      uint32_t LPBUF2P5DIS :  1;  /**< Low Power Bandgap's Output Buffer */
      uint32_t BOOSTCURRENT :  1;  /**< Set: Drive 2 Dac ;Unset Drive 1 Dac, and Save Power */
      uint32_t reserved3    : 29;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPREFBUFCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPREFBUFCON_t__ */

/*@}*/

/** @defgroup ADCDAT ADC Raw Result (ADCDAT) Register
 *  ADC Raw Result (ADCDAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCDAT_Struct
 *! \brief  ADC Raw Result Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCDAT_t__
typedef struct _ADI_AFE_ADCDAT_t {
  union {
    struct {
      uint32_t DATA       : 16;  /**< ADC Result */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCDAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCDAT_t__ */

/*@}*/

/** @defgroup DFTREAL DFT Result, Real Part (DFTREAL) Register
 *  DFT Result, Real Part (DFTREAL) Register.
 *  @{
 */

