analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_DFTREAL_Struct
 *! \brief  DFT Result, Real Part Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DFTREAL_t__
typedef struct _ADI_AFE_DFTREAL_t {
  union {
    struct {
      uint32_t DATA       : 18;  /**< DFT Real */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DFTREAL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DFTREAL_t__ */

/*@}*/

/** @defgroup DFTIMAG DFT Result, Imaginary Part (DFTIMAG) Register
 *  DFT Result, Imaginary Part (DFTIMAG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DFTIMAG_Struct
 *! \brief  DFT Result, Imaginary Part Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DFTIMAG_t__
typedef struct _ADI_AFE_DFTIMAG_t {
  union {
    struct {
      uint32_t DATA       : 18;  /**< DFT Imaginary */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DFTIMAG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DFTIMAG_t__ */

/*@}*/

/** @defgroup SINC2DAT Supply Rejection Filter Result (SINC2DAT) Register
 *  Supply Rejection Filter Result (SINC2DAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_SINC2DAT_Struct
 *! \brief  Supply Rejection Filter Result Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_SINC2DAT_t__
typedef struct _ADI_AFE_SINC2DAT_t {
  union {
    struct {
      uint32_t DATA       : 16;  /**< LPF Result */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_SINC2DAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_SINC2DAT_t__ */

/*@}*/

/** @defgroup TEMPSENSDAT Temperature Sensor Result (TEMPSENSDAT) Register
 *  Temperature Sensor Result (TEMPSENSDAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_TEMPSENSDAT_Struct
 *! \brief  Temperature Sensor Result Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TEMPSENSDAT_t__
typedef struct _ADI_AFE_TEMPSENSDAT_t {
  union {
    struct {
      uint32_t DATA       : 16;  /**< Temp Sensor */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TEMPSENSDAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TEMPSENSDAT_t__ */

/*@}*/

/** @defgroup ADCINTIEN ADC Interrupt Enable Register (ADCINTIEN) Register
 *  ADC Interrupt Enable Register (ADCINTIEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCINTIEN_Struct
 *! \brief  ADC Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCINTIEN_t__
typedef struct _ADI_AFE_ADCINTIEN_t {
  union {
    struct {
      uint32_t ADCRDYIEN  :  1;  /**< ADCDAT Ready Interrupt */
      uint32_t DFTRDYIEN  :  1;  /**< DFT Result Ready Interrupt */
      uint32_t SINC2RDYIEN :  1;  /**< Low Pass Filter Result Interrupt */
      uint32_t TEMPRDYIEN  :  1;  /**< Temp Sensor Interrupt */
      uint32_t ADCMINFAILIEN :  1;  /**< ADCMIN Interrupt */
      uint32_t ADCMAXFAILIEN :  1;  /**< ADCMAX Interrupt */
      uint32_t ADCDELTAFAILIEN :  1;  /**< Delta Interrupt */
      uint32_t MEANIEN         :  1;  /**< Mean Interrupt */
      uint32_t VARIEN          :  1;  /**< Variance Interrupt */
      uint32_t reserved9       : 23;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCINTIEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCINTIEN_t__ */

/*@}*/

/** @defgroup ADCINTSTA ADC Interrupt Status (ADCINTSTA) Register
 *  ADC Interrupt Status (ADCINTSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCINTSTA_Struct
 *! \brief  ADC Interrupt Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCINTSTA_t__
typedef struct _ADI_AFE_ADCINTSTA_t {
  union {
    struct {
      uint32_t ADCRDY     :  1;  /**< ADC Result Ready Status */
      uint32_t DFTRDY     :  1;  /**< DFT Result Ready Status */
      uint32_t SINC2RDY   :  1;  /**< Low Pass Filter Result Status */
      uint32_t TEMPRDY    :  1;  /**< Temp Sensor Result Ready */
      uint32_t ADCMINERR  :  1;  /**< ADC Minimum Value */
      uint32_t ADCMAXERR  :  1;  /**< ADC Maximum Value */
      uint32_t ADCDIFFERR :  1;  /**< ADC Delta Ready */
      uint32_t MEANRDY    :  1;  /**< Mean Result Ready */
      uint32_t VARRDY     :  1;  /**< Variance Result Ready */
      uint32_t reserved9  : 23;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCINTSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCINTSTA_t__ */

/*@}*/

/** @defgroup AFEGENINTSTA Analog Generation Interrupt (AFEGENINTSTA) Register
 *  Analog Generation Interrupt (AFEGENINTSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_AFEGENINTSTA_Struct
 *! \brief  Analog Generation Interrupt Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_AFEGENINTSTA_t__
typedef struct _ADI_AFE_AFEGENINTSTA_t {
  union {
    struct {
      uint32_t CUSTOMIRQ0 :  1;  /**< Custom IRQ 0 */
      uint32_t CUSTOMIRQ1 :  1;  /**< Custom IRQ 1. */
      uint32_t CUSTOMIRQ2 :  1;  /**< Custom IRQ 2 */
      uint32_t CUSTOMIRQ3 :  1;  /**< Custom IRQ 3. */
      uint32_t reserved4  : 28;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_AFEGENINTSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_AFEGENINTSTA_t__ */

/*@}*/

/** @defgroup ADCMIN ADC Minimum Value Check (ADCMIN) Register
 *  ADC Minimum Value Check (ADCMIN) Register.
 *  @{
 */

