analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_ADCMIN_Struct
 *! \brief  ADC Minimum Value Check Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCMIN_t__
typedef struct _ADI_AFE_ADCMIN_t {
  union {
    struct {
      uint32_t MINVAL     : 16;  /**< ADC Minimum Value Threshold */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCMIN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCMIN_t__ */

/*@}*/

/** @defgroup ADCMINSM ADCMIN Hysteresis Value (ADCMINSM) Register
 *  ADCMIN Hysteresis Value (ADCMINSM) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCMINSM_Struct
 *! \brief  ADCMIN Hysteresis Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCMINSM_t__
typedef struct _ADI_AFE_ADCMINSM_t {
  union {
    struct {
      uint32_t MINCLRVAL  : 16;  /**< ADCMIN Hysteresis Value */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCMINSM_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCMINSM_t__ */

/*@}*/

/** @defgroup ADCMAX ADC Maximum Value Check (ADCMAX) Register
 *  ADC Maximum Value Check (ADCMAX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCMAX_Struct
 *! \brief  ADC Maximum Value Check Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCMAX_t__
typedef struct _ADI_AFE_ADCMAX_t {
  union {
    struct {
      uint32_t MAXVAL     : 16;  /**< ADC Max Threshold */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCMAX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCMAX_t__ */

/*@}*/

/** @defgroup ADCMAXSMEN ADCMAX Hysteresis Value (ADCMAXSMEN) Register
 *  ADCMAX Hysteresis Value (ADCMAXSMEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCMAXSMEN_Struct
 *! \brief  ADCMAX Hysteresis Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCMAXSMEN_t__
typedef struct _ADI_AFE_ADCMAXSMEN_t {
  union {
    struct {
      uint32_t MAXSWEN    : 16;  /**< ADCMAX Hysteresis Value */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCMAXSMEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCMAXSMEN_t__ */

/*@}*/

/** @defgroup ADCDELTA ADC Delta Value (ADCDELTA) Register
 *  ADC Delta Value (ADCDELTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCDELTA_Struct
 *! \brief  ADC Delta Value Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCDELTA_t__
typedef struct _ADI_AFE_ADCDELTA_t {
  union {
    struct {
      uint32_t DELTAVAL   : 16;  /**< ADCDAT Code Differences Limit Option */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCDELTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCDELTA_t__ */

/*@}*/

/** @defgroup HPOSCCON HPOSC Configuration (HPOSCCON) Register
 *  HPOSC Configuration (HPOSCCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_HPOSCCON_Struct
 *! \brief  HPOSC Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_HPOSCCON_t__
typedef struct _ADI_AFE_HPOSCCON_t {
  union {
    struct {
      uint32_t reserved0  :  2;
      uint32_t CLK32MHZEN :  1;  /**< 16M/32M Output Selector Signal. */
      uint32_t reserved3  : 29;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_HPOSCCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_HPOSCCON_t__ */

/*@}*/

/** @defgroup DFTCON AFE DSP Configuration (DFTCON) Register
 *  AFE DSP Configuration (DFTCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DFTCON_Struct
 *! \brief  AFE DSP Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DFTCON_t__
typedef struct _ADI_AFE_DFTCON_t {
  union {
    struct {
      uint32_t HANNINGEN  :  1;  /**< Hanning Window Enable */
      uint32_t reserved1  :  3;
      uint32_t DFTNUM     :  4;  /**< ADC Samples Used */
      uint32_t reserved8  : 12;
      uint32_t DFTINSEL   :  2;  /**< DFT Input Select */
      uint32_t reserved22 : 10;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DFTCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DFTCON_t__ */

/*@}*/

/** @defgroup LPTIASW1 ULPTIA Switch Configuration for Channel 1 (LPTIASW1) Register
 *  ULPTIA Switch Configuration for Channel 1 (LPTIASW1) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPTIASW1_TIASWCON
 *! \brief  TIA SW[11:0] Control (TIASWCON) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIASW1_CAPA_LP     = 20,    /**< CAPA test with LP TIA                                                */
  AFE_LPTIASW1_NORM        = 44,    /**< Normal work mode                                                     */
  AFE_LPTIASW1_DIO         = 45,    /**< Normal work mode with back-back diode enabled.                       */
  AFE_LPTIASW1_SHORTSW     = 46,    /**< Work mode with short switch protection                               */
  AFE_LPTIASW1_LOWNOISE    = 108,   /**< Work mode, vzero-vbias=0.                                            */
  AFE_LPTIASW1_CAPA_RAMP_H = 148,   /**< CAPA test or Ramp test with HP TIA                                   */
  AFE_LPTIASW1_BUFDIS      = 384,   /**< Set PA/TIA as unity gain buffer.                                     */
  AFE_LPTIASW1_BUFEN       = 420,   /**< Set PA/TIA as unity gain buffer. Connect amp's output to CE1 & RC11. */
  AFE_LPTIASW1_TWOLEAD     = 1068,  /**< Two lead sensor, set PA as unity gain buffer.                        */
  AFE_LPTIASW1_BUFEN2      = 1188,  /**< Set PA/TIA as unity gain buffer.                                     */
  AFE_LPTIASW1_SESHORTRE   = 2048   /**< Close SW11 - Short SE1 to RE1,                                       */
} ADI_AFE_LPTIASW1_TIASWCON;


