analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_LPTIASW1_Struct
 *! \brief  ULPTIA Switch Configuration for Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPTIASW1_t__
typedef struct _ADI_AFE_LPTIASW1_t {
  union {
    struct {
      uint32_t TIASWCON   : 12;  /**< TIA SW[11:0] Control */
      uint32_t PABIASSEL  :  1;  /**< TIA SW12 Control. Active High */
      uint32_t TIABIASSEL :  1;  /**< TIA SW13 Control. Active High */
      uint32_t reserved14 : 18;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPTIASW1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPTIASW1_t__ */

/*@}*/

/** @defgroup LPTIASW0 ULPTIA Switch Configuration for Channel 0 (LPTIASW0) Register
 *  ULPTIA Switch Configuration for Channel 0 (LPTIASW0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPTIASW0_TIASWCON
 *! \brief  TIA SW[11:0] Control (TIASWCON) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIASW0_11        = 20,    /**< CAPA test with LP TIA                                                */
  AFE_LPTIASW0_NORM      = 44,    /**< Normal work mode                                                     */
  AFE_LPTIASW0_DIO       = 45,    /**< Normal work mode with back-back diode enabled.                       */
  AFE_LPTIASW0_SHORTSW   = 46,    /**< Work mode with short switch protection                               */
  AFE_LPTIASW0_LOWNOISE  = 108,   /**< Work mode, vzero-vbias=0.                                            */
  AFE_LPTIASW0_1         = 148,   /**< CAPA test or Ramp test with HP TIA                                   */
  AFE_LPTIASW0_BUFDIS    = 384,   /**< Set PA/TIA as unity gain buffer.                                     */
  AFE_LPTIASW0_BUFEN     = 420,   /**< Set PA/TIA as unity gain buffer. Connect amp's output to CE0 & RC01. */
  AFE_LPTIASW0_TWOLEAD   = 1068,  /**< Two lead sensor, set PA as unity gain buffer.                        */
  AFE_LPTIASW0_BUFEN2    = 1188,  /**< Set PA/TIA as unity gain buffer.                                     */
  AFE_LPTIASW0_SESHORTRE = 2048   /**< Close SW11 - Short SE0 to RE0.                                       */
} ADI_AFE_LPTIASW0_TIASWCON;


/* ==========================================================================
 *! \struct ADI_AFE_LPTIASW0_Struct
 *! \brief  ULPTIA Switch Configuration for Channel 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPTIASW0_t__
typedef struct _ADI_AFE_LPTIASW0_t {
  union {
    struct {
      uint32_t TIASWCON   : 12;  /**< TIA SW[11:0] Control */
      uint32_t PABIASSEL  :  1;  /**< TIA SW12 Control. Active High */
      uint32_t TIABIASSEL :  1;  /**< TIA SW13 Control. Active High */
      uint32_t VZEROSHARE :  1;  /**< TIA SW14 Control. Active High */
      uint32_t RECAL      :  1;  /**< TIA SW15 Control. Active High */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPTIASW0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPTIASW0_t__ */

/*@}*/

/** @defgroup LPTIACON1 ULPTIA Control Bits Channel 1 (LPTIACON1) Register
 *  ULPTIA Control Bits Channel 1 (LPTIACON1) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON1_TIAGAIN
 *! \brief  Set RTIA Gain Resistor (TIAGAIN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON1_DISCONTIA   = 0,   /**< Disconnect TIA Gain resistor */
  AFE_LPTIACON1_TIAGAIN200  = 1,   /**< 200 Ohm                      */
  AFE_LPTIACON1_TIAGAIN1K   = 2,   /**< 1k ohm                       */
  AFE_LPTIACON1_TIAGAIN2K   = 3,   /**< 2k                           */
  AFE_LPTIACON1_TIAGAIN3K   = 4,   /**< 3k                           */
  AFE_LPTIACON1_TIAGAIN4K   = 5,   /**< 4k                           */
  AFE_LPTIACON1_TIAGAIN6K   = 6,   /**< 6k                           */
  AFE_LPTIACON1_TIAGAIN8K   = 7,   /**< 8k                           */
  AFE_LPTIACON1_TIAGAIN10K  = 8,   /**< 10k                          */
  AFE_LPTIACON1_TIAGAIN12K  = 9,   /**< 12k                          */
  AFE_LPTIACON1_TIAGAIN16K  = 10,  /**< 16k                          */
  AFE_LPTIACON1_TIAGAIN20K  = 11,  /**< 20k                          */
  AFE_LPTIACON1_TIAGAIN24K  = 12,  /**< 24k                          */
  AFE_LPTIACON1_TIAGAIN30K  = 13,  /**< 30k                          */
  AFE_LPTIACON1_TIAGAIN32K  = 14,  /**< 32k                          */
  AFE_LPTIACON1_TIAGAIN40K  = 15,  /**< 40k                          */
  AFE_LPTIACON1_TIAGAIN48K  = 16,  /**< 48k                          */
  AFE_LPTIACON1_TIAGAIN64K  = 17,  /**< 64k                          */
  AFE_LPTIACON1_TIAGAIN85K  = 18,  /**< 85k                          */
  AFE_LPTIACON1_TIAGAIN96K  = 19,  /**< 96k                          */
  AFE_LPTIACON1_TIAGAIN100K = 20,  /**< 100k                         */
  AFE_LPTIACON1_TIAGAIN120K = 21,  /**< 120k                         */
  AFE_LPTIACON1_TIAGAIN128K = 22,  /**< 128k                         */
  AFE_LPTIACON1_TIAGAIN160K = 23,  /**< 160k                         */
  AFE_LPTIACON1_TIAGAIN196K = 24,  /**< 196k                         */
  AFE_LPTIACON1_TIAGAIN256K = 25,  /**< 256k                         */
  AFE_LPTIACON1_TIAGAIN512K = 26   /**< 512k                         */
} ADI_AFE_LPTIACON1_TIAGAIN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON1_TIARL
 *! \brief  Set RLOAD (TIARL) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON1_RL0    = 0,  /**< 0 ohm   */
  AFE_LPTIACON1_RL10   = 1,  /**< 10 ohm  */
  AFE_LPTIACON1_RL30   = 2,  /**< 30 ohm  */
  AFE_LPTIACON1_RL50   = 3,  /**< 50 ohm  */
  AFE_LPTIACON1_RL100  = 4,  /**< 100 ohm */
  AFE_LPTIACON1_RL1P6K = 5,  /**< 1.6kohm */
  AFE_LPTIACON1_RL3P1K = 6,  /**< 3.1kohm */
  AFE_LPTIACON1_RL3P5K = 7   /**< 3.6kohm */
} ADI_AFE_LPTIACON1_TIARL;


/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON1_TIARF
 *! \brief  Set LPF Resistor (TIARF) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON1_DISCONRF = 0,  /**< Disconnect TIA output from LPF pin */
  AFE_LPTIACON1_BYPRF    = 1,  /**< Bypass resistor                    */
  AFE_LPTIACON1_RF20K    = 2,  /**< 20k Ohm                            */
  AFE_LPTIACON1_RF100K   = 3,  /**< 100k Ohm                           */
  AFE_LPTIACON1_RF200K   = 4,  /**< 200k Ohm                           */
  AFE_LPTIACON1_RF400K   = 5,  /**< 400k Ohm                           */
  AFE_LPTIACON1_RF600K   = 6,  /**< 600k Ohm                           */
  AFE_LPTIACON1_RF1MOHM  = 7   /**< 1Meg Ohm                           */
} ADI_AFE_LPTIACON1_TIARF;


