analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_LPTIACON1_Struct
 *! \brief  ULPTIA Control Bits Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPTIACON1_t__
typedef struct _ADI_AFE_LPTIACON1_t {
  union {
    struct {
      uint32_t TIAPDEN    :  1;  /**< TIA Power Down */
      uint32_t PAPDEN     :  1;  /**< PA Power Down */
      uint32_t HALFPWR    :  1;  /**< Half Power Mode Select */
      uint32_t IBOOST     :  2;  /**< Current Boost Control */
      uint32_t TIAGAIN    :  5;  /**< Set RTIA Gain Resistor */
      uint32_t TIARL      :  3;  /**< Set RLOAD */
      uint32_t TIARF      :  3;  /**< Set LPF Resistor */
      uint32_t CHOPEN     :  2;  /**< Chopping Enable */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPTIACON1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPTIACON1_t__ */

/*@}*/

/** @defgroup LPTIACON0 ULPTIA Control Bits Channel 0 (LPTIACON0) Register
 *  ULPTIA Control Bits Channel 0 (LPTIACON0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON0_TIAGAIN
 *! \brief  Set RTIA (TIAGAIN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON0_DISCONTIA   = 0,   /**< Disconnect TIA Gain resistor */
  AFE_LPTIACON0_TIAGAIN200  = 1,   /**< 200 Ohm                      */
  AFE_LPTIACON0_TIAGAIN1K   = 2,   /**< 1k ohm                       */
  AFE_LPTIACON0_TIAGAIN2K   = 3,   /**< 2k                           */
  AFE_LPTIACON0_TIAGAIN3K   = 4,   /**< 3k                           */
  AFE_LPTIACON0_TIAGAIN4K   = 5,   /**< 4k                           */
  AFE_LPTIACON0_TIAGAIN6K   = 6,   /**< 6k                           */
  AFE_LPTIACON0_TIAGAIN8K   = 7,   /**< 8k                           */
  AFE_LPTIACON0_TIAGAIN10K  = 8,   /**< 10k                          */
  AFE_LPTIACON0_TIAGAIN12K  = 9,   /**< 12k                          */
  AFE_LPTIACON0_TIAGAIN16K  = 10,  /**< 16k                          */
  AFE_LPTIACON0_TIAGAIN20K  = 11,  /**< 20k                          */
  AFE_LPTIACON0_TIAGAIN24K  = 12,  /**< 24k                          */
  AFE_LPTIACON0_TIAGAIN30K  = 13,  /**< 30k                          */
  AFE_LPTIACON0_TIAGAIN32K  = 14,  /**< 32k                          */
  AFE_LPTIACON0_TIAGAIN40K  = 15,  /**< 40k                          */
  AFE_LPTIACON0_TIAGAIN48K  = 16,  /**< 48k                          */
  AFE_LPTIACON0_TIAGAIN64K  = 17,  /**< 64k                          */
  AFE_LPTIACON0_TIAGAIN85K  = 18,  /**< 85k                          */
  AFE_LPTIACON0_TIAGAIN96K  = 19,  /**< 96k                          */
  AFE_LPTIACON0_TIAGAIN100K = 20,  /**< 100k                         */
  AFE_LPTIACON0_TIAGAIN120K = 21,  /**< 120k                         */
  AFE_LPTIACON0_TIAGAIN128K = 22,  /**< 128k                         */
  AFE_LPTIACON0_TIAGAIN160K = 23,  /**< 160k                         */
  AFE_LPTIACON0_TIAGAIN196K = 24,  /**< 196k                         */
  AFE_LPTIACON0_TIAGAIN256K = 25,  /**< 256k                         */
  AFE_LPTIACON0_TIAGAIN512K = 26   /**< 512k                         */
} ADI_AFE_LPTIACON0_TIAGAIN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON0_TIARL
 *! \brief  Set RLOAD (TIARL) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON0_RL0    = 0,  /**< 0 ohm   */
  AFE_LPTIACON0_RL10   = 1,  /**< 10 ohm  */
  AFE_LPTIACON0_RL30   = 2,  /**< 30 ohm  */
  AFE_LPTIACON0_RL50   = 3,  /**< 50 ohm  */
  AFE_LPTIACON0_RL100  = 4,  /**< 100 ohm */
  AFE_LPTIACON0_RL1P6K = 5,  /**< 1.6kohm */
  AFE_LPTIACON0_RL3P1K = 6,  /**< 3.1kohm */
  AFE_LPTIACON0_RL3P5K = 7   /**< 3.6kohm */
} ADI_AFE_LPTIACON0_TIARL;


/*  =========================================================================
 *! \enum   ADI_AFE_LPTIACON0_TIARF
 *! \brief  Set LPF Resistor (TIARF) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPTIACON0_DISCONRF = 0,  /**< Disconnect TIA output from LPF pin */
  AFE_LPTIACON0_BYPRF    = 1,  /**< Bypass resistor                    */
  AFE_LPTIACON0_RF20K    = 2,  /**< 20k Ohm                            */
  AFE_LPTIACON0_RF100K   = 3,  /**< 100k Ohm                           */
  AFE_LPTIACON0_RF200K   = 4,  /**< 200k Ohm                           */
  AFE_LPTIACON0_RF400K   = 5,  /**< 400k Ohm                           */
  AFE_LPTIACON0_RF600K   = 6,  /**< 600k Ohm                           */
  AFE_LPTIACON0_RF1MOHM  = 7   /**< 1Meg Ohm                           */
} ADI_AFE_LPTIACON0_TIARF;


/* ==========================================================================
 *! \struct ADI_AFE_LPTIACON0_Struct
 *! \brief  ULPTIA Control Bits Channel 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPTIACON0_t__
typedef struct _ADI_AFE_LPTIACON0_t {
  union {
    struct {
      uint32_t TIAPDEN    :  1;  /**< TIA Power Down */
      uint32_t PAPDEN     :  1;  /**< PA Power Down */
      uint32_t HALFPWR    :  1;  /**< Half Power Mode Select */
      uint32_t IBOOST     :  2;  /**< Current Boost Control */
      uint32_t TIAGAIN    :  5;  /**< Set RTIA */
      uint32_t TIARL      :  3;  /**< Set RLOAD */
      uint32_t TIARF      :  3;  /**< Set LPF Resistor */
      uint32_t CHOPEN     :  2;  /**< Chopping Enable */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPTIACON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPTIACON0_t__ */

/*@}*/

/** @defgroup HSRTIACON High Power RTIA Configuration (HSRTIACON) Register
 *  High Power RTIA Configuration (HSRTIACON) Register.
 *  @{
 */

