analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_HSRTIACON_Struct
 *! \brief  High Power RTIA Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_HSRTIACON_t__
typedef struct _ADI_AFE_HSRTIACON_t {
  union {
    struct {
      uint32_t RTIACON    :  4;  /**< Configure General RTIA Value */
      uint32_t TIASW6CON  :  1;  /**< SW6 Control */
      uint32_t CTIACON    :  8;  /**< Configure Capacitor in Parallel with RTIA */
      uint32_t reserved13 : 19;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_HSRTIACON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_HSRTIACON_t__ */

/*@}*/

/** @defgroup DE1RESCON DE1 HSTIA Resistors Configuration (DE1RESCON) Register
 *  DE1 HSTIA Resistors Configuration (DE1RESCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DE1RESCON_Struct
 *! \brief  DE1 HSTIA Resistors Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DE1RESCON_t__
typedef struct _ADI_AFE_DE1RESCON_t {
  union {
    struct {
      uint32_t DE1RCON    :  8;  /**< DE1 RLOAD RTIA Setting */
      uint32_t reserved8  : 24;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DE1RESCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DE1RESCON_t__ */

/*@}*/

/** @defgroup DE0RESCON DE0 HSTIA Resistors Configuration (DE0RESCON) Register
 *  DE0 HSTIA Resistors Configuration (DE0RESCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DE0RESCON_Struct
 *! \brief  DE0 HSTIA Resistors Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DE0RESCON_t__
typedef struct _ADI_AFE_DE0RESCON_t {
  union {
    struct {
      uint32_t DE0RCON    :  8;  /**< DE0 RLOAD RTIA Setting */
      uint32_t reserved8  : 24;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DE0RESCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DE0RESCON_t__ */

/*@}*/

/** @defgroup HSTIACON HSTIA Amplifier Configuration (HSTIACON) Register
 *  HSTIA Amplifier Configuration (HSTIACON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_HSTIACON_Struct
 *! \brief  HSTIA Amplifier Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_HSTIACON_t__
typedef struct _ADI_AFE_HSTIACON_t {
  union {
    struct {
      uint32_t VBIASSEL   :  2;  /**< Select HSTIA Positive Input */
      uint32_t reserved2  : 30;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_HSTIACON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_HSTIACON_t__ */

/*@}*/

/** @defgroup DACDCBUFCON DAC DC Buffer Configuration (DACDCBUFCON) Register
 *  DAC DC Buffer Configuration (DACDCBUFCON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_DACDCBUFCON_CHANSEL
 *! \brief  DAC DC Channel Selection (CHANSEL) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_DACDCBUFCON_CHAN0 = 0,  /**< ULPDAC0 Sets DC level */
  AFE_DACDCBUFCON_CHAN1 = 1   /**< ULPDAC1 Sets DC level */
} ADI_AFE_DACDCBUFCON_CHANSEL;


/* ==========================================================================
 *! \struct ADI_AFE_DACDCBUFCON_Struct
 *! \brief  DAC DC Buffer Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACDCBUFCON_t__
typedef struct _ADI_AFE_DACDCBUFCON_t {
  union {
    struct {
      uint32_t Reserved_0 :  1;  /**< Reserved */
      uint32_t CHANSEL    :  1;  /**< DAC DC Channel Selection */
      uint32_t reserved2  : 30;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACDCBUFCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACDCBUFCON_t__ */

/*@}*/

/** @defgroup LPDACDAT0 LPDAC Data-out (LPDACDAT0) Register
 *  LPDAC Data-out (LPDACDAT0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_LPDACDAT0_Struct
 *! \brief  LPDAC Data-out Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACDAT0_t__
typedef struct _ADI_AFE_LPDACDAT0_t {
  union {
    struct {
      uint32_t DACIN12    : 12;  /**< 12BITVAL, 1LSB=537uV */
      uint32_t DACIN6     :  6;  /**< 6BITVAL, 1LSB=34.375mV */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACDAT0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACDAT0_t__ */

/*@}*/

/** @defgroup LPDACSW0 LPDAC0 Switch Control (LPDACSW0) Register
 *  LPDAC0 Switch Control (LPDACSW0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPDACSW0_LPMODEDIS
 *! \brief  Switch Control (LPMODEDIS) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACSW0_DACCONBIT5 = 0,  /**< ULPDAC Switch controlled by ULPDACCON0 bit 5 */
  AFE_LPDACSW0_OVRRIDE    = 1   /**< ULPDAC Switches override                     */
} ADI_AFE_LPDACSW0_LPMODEDIS;


/* ==========================================================================
 *! \struct ADI_AFE_LPDACSW0_Struct
 *! \brief  LPDAC0 Switch Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACSW0_t__
typedef struct _ADI_AFE_LPDACSW0_t {
  union {
    struct {
      uint32_t LPDACSW    :  5;  /**< LPDAC0 Switches Matrix */
      uint32_t LPMODEDIS  :  1;  /**< Switch Control */
      uint32_t reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACSW0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACSW0_t__ */

/*@}*/

/** @defgroup LPDACCON0 LPDAC Control Bits (LPDACCON0) Register
 *  LPDAC Control Bits (LPDACCON0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_RSTEN
 *! \brief  Enable Writes to ULPDAC0 (RSTEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_WRITEDIS = 0,  /**< Disable ULPDAC0 Writes */
  AFE_LPDACCON0_WRITEEN  = 1   /**< Enable ULPDAC0 Writes  */
} ADI_AFE_LPDACCON0_RSTEN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_PWDEN
 *! \brief  LPDAC0 Power Down (PWDEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_PWREN  = 0,  /**< ULPDAC0 Powered On  */
  AFE_LPDACCON0_PWRDIS = 1   /**< ULPDAC0 Powered Off */
} ADI_AFE_LPDACCON0_PWDEN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_REFSEL
 *! \brief  Reference Select Bit (REFSEL) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_ULPREF = 0,  /**< ULP2P5V Ref    */
  AFE_LPDACCON0_AVDD   = 1   /**< AVDD Reference */
} ADI_AFE_LPDACCON0_REFSEL;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_VBIASMUX
 *! \brief  VBIAS MUX Select (VBIASMUX) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_12BIT = 0,  /**< Output 12Bit */
  AFE_LPDACCON0_EN    = 1   /**< output 6Bit  */
} ADI_AFE_LPDACCON0_VBIASMUX;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_VZEROMUX
 *! \brief  VZERO MUX Select (VZEROMUX) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_BITS6  = 0,  /**< VZERO 6BIT  */
  AFE_LPDACCON0_BITS12 = 1   /**< VZERO 12BIT */
} ADI_AFE_LPDACCON0_VZEROMUX;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_DACMDE
 *! \brief  LPDAC0 Switch Settings (DACMDE) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_NORM = 0,  /**< ULPDAC0 switches set for normal mode     */
  AFE_LPDACCON0_DIAG = 1   /**< ULPDAC0 switches set for Diagnostic mode */
} ADI_AFE_LPDACCON0_DACMDE;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON0_WAVETYPE
 *! \brief  LPDAC Data Source (WAVETYPE) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON0_MMR     = 0,  /**< Direct from ULPDACDAT0 */
  AFE_LPDACCON0_WAVEGEN = 1   /**< Waveform generator     */
} ADI_AFE_LPDACCON0_WAVETYPE;


