analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_LPDACCON0_Struct
 *! \brief  LPDAC Control Bits Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACCON0_t__
typedef struct _ADI_AFE_LPDACCON0_t {
  union {
    struct {
      uint32_t RSTEN      :  1;  /**< Enable Writes to ULPDAC0 */
      uint32_t PWDEN      :  1;  /**< LPDAC0 Power Down */
      uint32_t REFSEL     :  1;  /**< Reference Select Bit */
      uint32_t VBIASMUX   :  1;  /**< VBIAS MUX Select */
      uint32_t VZEROMUX   :  1;  /**< VZERO MUX Select */
      uint32_t DACMDE     :  1;  /**< LPDAC0 Switch Settings */
      uint32_t WAVETYPE   :  1;  /**< LPDAC Data Source */
      uint32_t reserved7  : 25;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACCON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACCON0_t__ */

/*@}*/

/** @defgroup LPDACDAT1 Low Power DAC1 data register (LPDACDAT1) Register
 *  Low Power DAC1 data register (LPDACDAT1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_LPDACDAT1_Struct
 *! \brief  Low Power DAC1 data Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACDAT1_t__
typedef struct _ADI_AFE_LPDACDAT1_t {
  union {
    struct {
      uint32_t DACIN12    : 12;  /**< 12BITVAL, 1LSB=537uV */
      uint32_t DACIN6     :  6;  /**< 6BITVAL, 1LSB=34.375mV */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACDAT1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACDAT1_t__ */

/*@}*/

/** @defgroup LPDACSW1 Control register for switches to LPDAC1 (LPDACSW1) Register
 *  Control register for switches to LPDAC1 (LPDACSW1) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPDACSW1_LPMODEDIS
 *! \brief  Switch Control (LPMODEDIS) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACSW1_DACCONBIT5 = 0,  /**< ULPDAC Switch controlled by ULPDACCON1 bit 5 */
  AFE_LPDACSW1_OVRRIDE    = 1   /**< ULPDAC Switches override                     */
} ADI_AFE_LPDACSW1_LPMODEDIS;


/* ==========================================================================
 *! \struct ADI_AFE_LPDACSW1_Struct
 *! \brief  Control register for switches to LPDAC1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACSW1_t__
typedef struct _ADI_AFE_LPDACSW1_t {
  union {
    struct {
      uint32_t LPDACSW    :  5;  /**< ULPDAC0 Switches Matrix */
      uint32_t LPMODEDIS  :  1;  /**< Switch Control */
      uint32_t reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACSW1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACSW1_t__ */

/*@}*/

/** @defgroup LPDACCON1 ULP_DACCON1 (LPDACCON1) Register
 *  ULP_DACCON1 (LPDACCON1) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_RSTEN
 *! \brief  Enable Writes to ULPDAC1 (RSTEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_WRITEDIS = 0,  /**< Disable ULPDAC1 Writes */
  AFE_LPDACCON1_WRITEEN  = 1   /**< Enable ULPDAC1 Writes  */
} ADI_AFE_LPDACCON1_RSTEN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_PWDEN
 *! \brief  ULPDAC0 Power (PWDEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_PWREN  = 0,  /**< ULPDAC1 Powered On  */
  AFE_LPDACCON1_PWRDIS = 1   /**< ULPDAC1 Powered Off */
} ADI_AFE_LPDACCON1_PWDEN;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_REFSEL
 *! \brief  REFSEL (REFSEL) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_ULPREF = 0,  /**<  */
  AFE_LPDACCON1_AVDD   = 1   /**<  */
} ADI_AFE_LPDACCON1_REFSEL;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_VBIASMUX
 *! \brief  BITSEL (VBIASMUX) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_DIS = 0,  /**< 12BIT Output */
  AFE_LPDACCON1_EN  = 1   /**< 6BIT Output  */
} ADI_AFE_LPDACCON1_VBIASMUX;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_VZEROMUX
 *! \brief  VZEROOUT (VZEROMUX) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_BITS6  = 0,  /**< VZERO 6BIT  */
  AFE_LPDACCON1_BITS12 = 1   /**< VZERO 12BIT */
} ADI_AFE_LPDACCON1_VZEROMUX;


/*  =========================================================================
 *! \enum   ADI_AFE_LPDACCON1_DACMDE
 *! \brief  LPDAC1 Switch Settings (DACMDE) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_LPDACCON1_NORM = 0,  /**< ULPDAC1 switches set for normal mode     */
  AFE_LPDACCON1_DIAG = 1   /**< ULPDAC1 switches set for Diagnostic mode */
} ADI_AFE_LPDACCON1_DACMDE;


/* ==========================================================================
 *! \struct ADI_AFE_LPDACCON1_Struct
 *! \brief  ULP_DACCON1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_LPDACCON1_t__
typedef struct _ADI_AFE_LPDACCON1_t {
  union {
    struct {
      uint32_t RSTEN      :  1;  /**< Enable Writes to ULPDAC1 */
      uint32_t PWDEN      :  1;  /**< ULPDAC0 Power */
      uint32_t REFSEL     :  1;  /**< REFSEL */
      uint32_t VBIASMUX   :  1;  /**< BITSEL */
      uint32_t VZEROMUX   :  1;  /**< VZEROOUT */
      uint32_t DACMDE     :  1;  /**< LPDAC1 Switch Settings */
      uint32_t WAVETYPE   :  1;  /**< DAC Input Source */
      uint32_t reserved7  : 25;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_LPDACCON1_t;
