analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_LPDACCON1_t__ */

/*@}*/

/** @defgroup DSWFULLCON Switch Matrix Full Configuration (D) (DSWFULLCON) Register
 *  Switch Matrix Full Configuration (D) (DSWFULLCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DSWFULLCON_Struct
 *! \brief  Switch Matrix Full Configuration (D) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DSWFULLCON_t__
typedef struct _ADI_AFE_DSWFULLCON_t {
  union {
    struct {
      uint32_t DR0        :  1;  /**< Control of Dr0 Switch. */
      uint32_t D2         :  1;  /**< Control of D2 Switch. */
      uint32_t D3         :  1;  /**< Control of D3 Switch. */
      uint32_t D4         :  1;  /**< Control of D4 Switch. */
      uint32_t D5         :  1;  /**< Control of D5 Switch. */
      uint32_t D6         :  1;  /**< Control of D6 Switch. */
      uint32_t D7         :  1;  /**< Control of D7 Switch. */
      uint32_t D8         :  1;  /**< Control of D8 Switch. */
      uint32_t reserved8  : 24;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DSWFULLCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DSWFULLCON_t__ */

/*@}*/

/** @defgroup NSWFULLCON Switch Matrix Full Configuration (N) (NSWFULLCON) Register
 *  Switch Matrix Full Configuration (N) (NSWFULLCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_NSWFULLCON_Struct
 *! \brief  Switch Matrix Full Configuration (N) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_NSWFULLCON_t__
typedef struct _ADI_AFE_NSWFULLCON_t {
  union {
    struct {
      uint32_t N1         :  1;  /**< Control of N1 Switch. Set Will Close N1, Unset Open */
      uint32_t N2         :  1;  /**< Control of N2 Switch. Set Will Close N2, Unset Open */
      uint32_t N3         :  1;  /**< Control of N3 Switch. Set Will Close N3, Unset Open */
      uint32_t N4         :  1;  /**< Control of N4 Switch. Set Will Close N4, Unset Open */
      uint32_t N5         :  1;  /**< Control of N5 Switch. Set Will Close N5, Unset Open */
      uint32_t N6         :  1;  /**< Control of N6 Switch. Set Will Close N6, Unset Open */
      uint32_t N7         :  1;  /**< Control of N7 Switch. Set Will Close N7, Unset Open */
      uint32_t N8         :  1;  /**< Control of N8 Switch. Set Will Close N8, Unset Open */
      uint32_t N9         :  1;  /**< Control of N9 Switch. Set Will Close N9, Unset Open */
      uint32_t NR1        :  1;  /**< Control of Nr1 Switch. Set Will Close Nr1, Unset Open */
      uint32_t Nl         :  1;  /**< Control of NL Switch. */
      uint32_t NL2        :  1;  /**< Control of NL2 Switch. */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_NSWFULLCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_NSWFULLCON_t__ */

/*@}*/

/** @defgroup PSWFULLCON Switch Matrix Full Configuration (P) (PSWFULLCON) Register
 *  Switch Matrix Full Configuration (P) (PSWFULLCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_PSWFULLCON_Struct
 *! \brief  Switch Matrix Full Configuration (P) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_PSWFULLCON_t__
typedef struct _ADI_AFE_PSWFULLCON_t {
  union {
    struct {
      uint32_t PR0        :  1;  /**< PR0 Switch Control */
      uint32_t P2         :  1;  /**< Control of P2 Switch. Set Will Close P2, Unset Open */
      uint32_t P3         :  1;  /**< Control of P3 Switch. Set Will Close P3, Unset Open */
      uint32_t P4         :  1;  /**< Control of P4 Switch. Set Will Close P4, Unset Open */
      uint32_t P5         :  1;  /**< Control of P5 Switch. Set Will Close P5, Unset Open */
      uint32_t P6         :  1;  /**< Control of P6 Switch. Set Will Close P6, Unset Open */
      uint32_t P7         :  1;  /**< Control of P7 Switch. Set Will Close P7, Unset Open */
      uint32_t P8         :  1;  /**< Control of P8 Switch. Set Will Close P8, Unset Open */
      uint32_t P9         :  1;  /**< Control of P9 Switch. Set Will Close P9, Unset Open */
      uint32_t P10        :  1;  /**< P10 Switch Control */
      uint32_t P11        :  1;  /**< Control of P11 Switch. Set Will Close P11, Unset Open */
      uint32_t P12        :  1;  /**< Control of P12 Switch. Set Will Close P12, Unset Open */
      uint32_t reserved12 :  1;
      uint32_t PL         :  1;  /**< PL Switch Control */
      uint32_t PL2        :  1;  /**< PL2 Switch Control */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_PSWFULLCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_PSWFULLCON_t__ */

/*@}*/

/** @defgroup TSWFULLCON Switch Matrix Full Configuration (T) (TSWFULLCON) Register
 *  Switch Matrix Full Configuration (T) (TSWFULLCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_TSWFULLCON_Struct
 *! \brief  Switch Matrix Full Configuration (T) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TSWFULLCON_t__
typedef struct _ADI_AFE_TSWFULLCON_t {
  union {
    struct {
      uint32_t T1         :  1;  /**< Control of T1 Switch. Set Will Close T1, Unset Open */
      uint32_t T2         :  1;  /**< Control of T2 Switch. Set Will Close T2, Unset Open */
      uint32_t T3         :  1;  /**< Control of T3 Switch. Set Will Close T3, Unset Open */
      uint32_t T4         :  1;  /**< Control of T4 Switch. Set Will Close T4, Unset Open */
      uint32_t T5         :  1;  /**< Control of T5 Switch. Set Will Close T5, Unset Open */
      uint32_t reserved5  :  1;
      uint32_t T7         :  1;  /**< Control of T7 Switch. Set Will Close T7, Unset Open */
      uint32_t reserved7  :  1;
      uint32_t T9         :  1;  /**< Control of T9 Switch. Set Will Close T9, Unset Open */
      uint32_t T10        :  1;  /**< Control of T10 Switch. Set Will Close T10, Unset Open */
      uint32_t T11        :  1;  /**< Control of T11 Switch. Set Will Close T11, Unset Open */
      uint32_t TR1        :  1;  /**< Control of Tr1 Switch. Set Will Close Tr1, Unset Open */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TSWFULLCON_t;
