analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TSWFULLCON_t__ */

/*@}*/

/** @defgroup TEMPCON0 Temp Sensor Configuration (TEMPCON0) Register
 *  Temp Sensor Configuration (TEMPCON0) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_TEMPCON0_CHOPCON
 *! \brief  Temp Sensor Chop Mode (CHOPCON) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_TEMPCON0_DIS = 0,  /**< Disable chop */
  AFE_TEMPCON0_EN  = 1   /**< Enable chop  */
} ADI_AFE_TEMPCON0_CHOPCON;


/* ==========================================================================
 *! \struct ADI_AFE_TEMPCON0_Struct
 *! \brief  Temp Sensor Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TEMPCON0_t__
typedef struct _ADI_AFE_TEMPCON0_t {
  union {
    struct {
      uint32_t ENABLE     :  1;  /**< Unused */
      uint32_t CHOPCON    :  1;  /**< Temp Sensor Chop Mode */
      uint32_t CHOPFRESEL :  2;  /**< Chop Mode Frequency Setting */
      uint32_t reserved4  : 28;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TEMPCON0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TEMPCON0_t__ */

/*@}*/

/** @defgroup BUFSENCON HP and LP Buffer Control (BUFSENCON) Register
 *  HP and LP Buffer Control (BUFSENCON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P8HPADCEN
 *! \brief  HP 1.8V Reference Buffer (V1P8HPADCEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_HPBUF_DIS = 0,  /**< Disable 1.8V HP ADC Reference Buffer */
  AFE_BUFSENCON_HPBUF_EN  = 1   /**< Enable 1.8V HP ADC Reference Buffer  */
} ADI_AFE_BUFSENCON_V1P8HPADCEN;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P8HPADCILIMITEN
 *! \brief  HP ADC Input Current Limit (V1P8HPADCILIMITEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_LIMIT_DIS = 0,  /**< Disable buffer Current Limit */
  AFE_BUFSENCON_LIMIT_EN  = 1   /**< Enable buffer Current Limit  */
} ADI_AFE_BUFSENCON_V1P8HPADCILIMITEN;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P8LPADCEN
 *! \brief  ADC 1.8V LP Reference Buffer (V1P8LPADCEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_LPADCREF_DIS = 0,  /**< Disable LP 1.8V Reference Buffer */
  AFE_BUFSENCON_LPADCREF_EN  = 1   /**< Enable LP 1.8V Reference Buffer  */
} ADI_AFE_BUFSENCON_V1P8LPADCEN;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P8HPADCCHGDIS
 *! \brief  Controls Decoupling Cap Discharge Switch (V1P8HPADCCHGDIS) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_OPEN   = 0,  /**< Open switch  */
  AFE_BUFSENCON_CLOSED = 1   /**< Close Switch */
} ADI_AFE_BUFSENCON_V1P8HPADCCHGDIS;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P1HPADCEN
 *! \brief  Enable 1.1V HP CM Buffer (V1P1HPADCEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_OFF = 0,  /**< Disable 1.1V HP Common Mode Buffer */
  AFE_BUFSENCON_ON  = 1   /**< Enable 1.1V HP Common Mode Buffer  */
} ADI_AFE_BUFSENCON_V1P1HPADCEN;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P1LPADCEN
 *! \brief  ADC 1.1V LP Buffer (V1P1LPADCEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_DISABLE = 0,  /**< Disable ADC 1.8V LP Reference Buffer */
  AFE_BUFSENCON_ENABLE  = 1   /**< Enable ADC 1.8V LP Reference Buffer  */
} ADI_AFE_BUFSENCON_V1P1LPADCEN;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P1LPADCCHGDIS
 *! \brief  Controls Decoupling Cap Discharge Switch (V1P1LPADCCHGDIS) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_ENCHRG  = 0,  /**< Open switch  */
  AFE_BUFSENCON_DISCHRG = 1   /**< Close Switch */
} ADI_AFE_BUFSENCON_V1P1LPADCCHGDIS;


/*  =========================================================================
 *! \enum   ADI_AFE_BUFSENCON_V1P8THERMSTEN
 *! \brief  Buffered Reference Output (V1P8THERMSTEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_BUFSENCON_DIS = 0,  /**< Disable 1.8V Buffered Reference output */
  AFE_BUFSENCON_EN  = 1   /**< Enable 1.8V Buffered Reference output  */
} ADI_AFE_BUFSENCON_V1P8THERMSTEN;


/* ==========================================================================
 *! \struct ADI_AFE_BUFSENCON_Struct
 *! \brief  HP and LP Buffer Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_BUFSENCON_t__
typedef struct _ADI_AFE_BUFSENCON_t {
  union {
    struct {
      uint32_t V1P8HPADCEN :  1;  /**< HP 1.8V Reference Buffer */
      uint32_t V1P8HPADCILIMITEN :  1;  /**< HP ADC Input Current Limit */
      uint32_t V1P8LPADCEN       :  1;  /**< ADC 1.8V LP Reference Buffer */
      uint32_t V1P8HPADCCHGDIS   :  1;  /**< Controls Decoupling Cap Discharge Switch */
      uint32_t V1P1HPADCEN       :  1;  /**< Enable 1.1V HP CM Buffer */
      uint32_t V1P1LPADCEN       :  1;  /**< ADC 1.1V LP Buffer */
      uint32_t V1P1LPADCCHGDIS   :  1;  /**< Controls Decoupling Cap Discharge Switch */
      uint32_t reserved7         :  1;
      uint32_t V1P8THERMSTEN     :  1;  /**< Buffered Reference Output */
      uint32_t reserved9         : 23;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_BUFSENCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_BUFSENCON_t__ */

/*@}*/

