analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/** @defgroup ADCCON ADC Configuration (ADCCON) Register
 *  ADC Configuration (ADCCON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_ADCCON_MUXSELP
 *! \brief  Select Positive Input (MUXSELP) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_ADCCON_RESERVED = 17   /**< Reserved */
} ADI_AFE_ADCCON_MUXSELP;


/* ==========================================================================
 *! \struct ADI_AFE_ADCCON_Struct
 *! \brief  ADC Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCCON_t__
typedef struct _ADI_AFE_ADCCON_t {
  union {
    struct {
      uint32_t MUXSELP    :  6;  /**< Select Positive Input */
      uint32_t reserved6  :  2;
      uint32_t MUXSELN    :  5;  /**< Select Negative Input */
      uint32_t GNOFFSEL   :  2;  /**< Obsolete */
      uint32_t GNOFSELPGA :  1;  /**< Internal Offset/Gain Cancellation */
      uint32_t GNPGA      :  3;  /**< PGA Gain Setup */
      uint32_t reserved19 : 13;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCCON_t__ */

/*@}*/

/** @defgroup DSWSTA Switch Matrix Status (D) (DSWSTA) Register
 *  Switch Matrix Status (D) (DSWSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DSWSTA_Struct
 *! \brief  Switch Matrix Status (D) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DSWSTA_t__
typedef struct _ADI_AFE_DSWSTA_t {
  union {
    struct {
      uint32_t D1STA      :  1;  /**< Status of Dr0 Switch. */
      uint32_t D2STA      :  1;  /**< Status of D2 Switch. */
      uint32_t D3STA      :  1;  /**< Status of D3 Switch. */
      uint32_t D4STA      :  1;  /**< Status of D4 Switch. */
      uint32_t D5STA      :  1;  /**< Status of D5 Switch. */
      uint32_t D6STA      :  1;  /**< Status of D6 Switch. */
      uint32_t D7STA      :  1;  /**< Status of D7 Switch. */
      uint32_t D8STA      :  1;  /**< Status of D8 Switch. */
      uint32_t reserved8  : 24;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DSWSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DSWSTA_t__ */

/*@}*/

/** @defgroup PSWSTA Switch Matrix Status (P) (PSWSTA) Register
 *  Switch Matrix Status (P) (PSWSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_PSWSTA_Struct
 *! \brief  Switch Matrix Status (P) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_PSWSTA_t__
typedef struct _ADI_AFE_PSWSTA_t {
  union {
    struct {
      uint32_t PR0STA     :  1;  /**< PR0 Switch Control */
      uint32_t P2STA      :  1;  /**< Status of P2 Switch. */
      uint32_t P3STA      :  1;  /**< Status of P3 Switch. */
      uint32_t P4STA      :  1;  /**< Status of P4 Switch. */
      uint32_t P5STA      :  1;  /**< Status of P5 Switch. */
      uint32_t P6STA      :  1;  /**< Status of P6 Switch. */
      uint32_t P7STA      :  1;  /**< Status of P7 Switch. */
      uint32_t P8STA      :  1;  /**< Status of P8 Switch. */
      uint32_t P9STA      :  1;  /**< Status of P9 Switch. */
      uint32_t P10STA     :  1;  /**< Status of P10 Switch. */
      uint32_t P11STA     :  1;  /**< Status of P11 Switch. */
      uint32_t P12STA     :  1;  /**< Status of P12 Switch. */
      uint32_t P13STA     :  1;  /**< Status of P13 Switch. */
      uint32_t PLSTA      :  1;  /**< PL Switch Control */
      uint32_t PL2STA     :  1;  /**< PL Switch Control */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_PSWSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_PSWSTA_t__ */

/*@}*/

/** @defgroup NSWSTA Switch Matrix Status (N) (NSWSTA) Register
 *  Switch Matrix Status (N) (NSWSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_NSWSTA_Struct
 *! \brief  Switch Matrix Status (N) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_NSWSTA_t__
typedef struct _ADI_AFE_NSWSTA_t {
  union {
    struct {
      uint32_t N1STA      :  1;  /**< Status of N1 Switch. */
      uint32_t N2STA      :  1;  /**< Status of N2 Switch. */
      uint32_t N3STA      :  1;  /**< Status of N3 Switch. */
      uint32_t N4STA      :  1;  /**< Status of N4 Switch. */
      uint32_t N5STA      :  1;  /**< Status of N5 Switch. */
      uint32_t N6STA      :  1;  /**< Status of N6 Switch. */
      uint32_t N7STA      :  1;  /**< Status of N7 Switch. */
      uint32_t N8STA      :  1;  /**< Status of N8 Switch. */
      uint32_t N9STA      :  1;  /**< Status of N9 Switch. */
      uint32_t NR1STA     :  1;  /**< Status of NR1 Switch. */
      uint32_t NLSTA      :  1;  /**< Status of NL Switch. */
      uint32_t NL2STA     :  1;  /**< Status of NL2 Switch. */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_NSWSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_NSWSTA_t__ */

/*@}*/

/** @defgroup TSWSTA Switch Matrix Status (T) (TSWSTA) Register
 *  Switch Matrix Status (T) (TSWSTA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_TSWSTA_Struct
 *! \brief  Switch Matrix Status (T) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TSWSTA_t__
typedef struct _ADI_AFE_TSWSTA_t {
  union {
    struct {
      uint32_t T1STA      :  1;  /**< Status of T1 Switch. */
      uint32_t T2STA      :  1;  /**< Status of T2 Switch. */
      uint32_t T3STA      :  1;  /**< Status of T3 Switch. */
      uint32_t T4STA      :  1;  /**< Status of T4 Switch. */
      uint32_t T5STA      :  1;  /**< Status of T5 Switch. */
      uint32_t T6STA      :  1;  /**< Status of T6 Switch. */
      uint32_t T7STA      :  1;  /**< Status of T7 Switch. */
      uint32_t T8STA      :  1;  /**< Status of T8 Switch. */
      uint32_t T9STA      :  1;  /**< Status of T9 Switch. */
      uint32_t T10STA     :  1;  /**< Status of T10 Switch. */
      uint32_t T11STA     :  1;  /**< Status of T11 Switch. */
      uint32_t TR1STA     :  1;  /**< Status of TR1 Switch. */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TSWSTA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TSWSTA_t__ */

/*@}*/

/** @defgroup STATSVAR Variance Output (STATSVAR) Register
 *  Variance Output (STATSVAR) Register.
 *  @{
 */

