analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_STATSVAR_Struct
 *! \brief  Variance Output Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_STATSVAR_t__
typedef struct _ADI_AFE_STATSVAR_t {
  union {
    struct {
      uint32_t VARIANCE   : 31;  /**< Statistical Variance Value */
      uint32_t reserved31 :  1;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_STATSVAR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_STATSVAR_t__ */

/*@}*/

/** @defgroup STATSCON Statistics Control (STATSCON) Register
 *  Statistics Control (STATSCON) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_STATSCON_STATSEN
 *! \brief  Statistics Enable (STATSEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_STATSCON_DIS = 0,  /**< Disable Statistics */
  AFE_STATSCON_EN  = 1   /**< Enable Statistics  */
} ADI_AFE_STATSCON_STATSEN;


/* ==========================================================================
 *! \struct ADI_AFE_STATSCON_Struct
 *! \brief  Statistics Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_STATSCON_t__
typedef struct _ADI_AFE_STATSCON_t {
  union {
    struct {
      uint32_t STATSEN    :  1;  /**< Statistics Enable */
      uint32_t RESRVED    :  3;  /**< Reserved */
      uint32_t SAMPLENUM  :  3;  /**< Sample Size */
      uint32_t STDDEV     :  5;  /**< Standard Deviation Configuration */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_STATSCON_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_STATSCON_t__ */

/*@}*/

/** @defgroup STATSMEAN Statistics Mean Output (STATSMEAN) Register
 *  Statistics Mean Output (STATSMEAN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_STATSMEAN_Struct
 *! \brief  Statistics Mean Output Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_STATSMEAN_t__
typedef struct _ADI_AFE_STATSMEAN_t {
  union {
    struct {
      uint32_t MEAN       : 16;  /**< Mean Output */
      uint32_t reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_STATSMEAN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_STATSMEAN_t__ */

/*@}*/

/** @defgroup REPEATADCCNV REPEAT ADC Conversions (REPEATADCCNV) Register
 *  REPEAT ADC Conversions (REPEATADCCNV) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_REPEATADCCNV_EN
 *! \brief  Enable Repeat ADC Conversions (EN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_REPEATADCCNV_DIS = 0,  /**< Disable Repeat ADC Conversions */
  AFE_REPEATADCCNV_EN  = 1   /**< Enable Repeat ADC Conversions  */
} ADI_AFE_REPEATADCCNV_EN;


/* ==========================================================================
 *! \struct ADI_AFE_REPEATADCCNV_Struct
 *! \brief  REPEAT ADC Conversions Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_REPEATADCCNV_t__
typedef struct _ADI_AFE_REPEATADCCNV_t {
  union {
    struct {
      uint32_t EN         :  1;  /**< Enable Repeat ADC Conversions */
      uint32_t reserved1  :  3;
      uint32_t NUM        :  8;  /**< Repeat Value */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_REPEATADCCNV_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_REPEATADCCNV_t__ */

/*@}*/

/** @defgroup CALDATLOCK Calibration Data Lock (CALDATLOCK) Register
 *  Calibration Data Lock (CALDATLOCK) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_CALDATLOCK_Struct
 *! \brief  Calibration Data Lock Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_CALDATLOCK_t__
typedef struct _ADI_AFE_CALDATLOCK_t {
  union {
    struct {
      uint32_t KEY        : 32;  /**< Password for Calibration Data Registers */
    };
    uint32_t VALUE32;
  };
} ADI_AFE_CALDATLOCK_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_CALDATLOCK_t__ */

/*@}*/

/** @defgroup ADCOFFSETHSTIA ADC Offset Calibration High Speed TIA Channel (ADCOFFSETHSTIA) Register
 *  ADC Offset Calibration High Speed TIA Channel (ADCOFFSETHSTIA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETHSTIA_Struct
 *! \brief  ADC Offset Calibration High Speed TIA Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETHSTIA_t__
typedef struct _ADI_AFE_ADCOFFSETHSTIA_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< HPTIA Offset Calibration */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETHSTIA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETHSTIA_t__ */

/*@}*/

/** @defgroup ADCGAINTEMPSENS0 ADC Gain Calibration Temp Sensor Channel (ADCGAINTEMPSENS0) Register
 *  ADC Gain Calibration Temp Sensor Channel (ADCGAINTEMPSENS0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINTEMPSENS0_Struct
 *! \brief  ADC Gain Calibration Temp Sensor Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINTEMPSENS0_t__
typedef struct _ADI_AFE_ADCGAINTEMPSENS0_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration Temp Sensor Channel */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINTEMPSENS0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINTEMPSENS0_t__ */

/*@}*/

/** @defgroup ADCOFFSETTEMPSENS0 ADC Offset Calibration Temp Sensor Channel 0 (ADCOFFSETTEMPSENS0) Register
 *  ADC Offset Calibration Temp Sensor Channel 0 (ADCOFFSETTEMPSENS0) Register.
 *  @{
 */

