analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETTEMPSENS0_Struct
 *! \brief  ADC Offset Calibration Temp Sensor Channel 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETTEMPSENS0_t__
typedef struct _ADI_AFE_ADCOFFSETTEMPSENS0_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Temp Sensor */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETTEMPSENS0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETTEMPSENS0_t__ */

/*@}*/

/** @defgroup ADCGAINGN1 ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel (ADCGAINGN1) Register
 *  ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel (ADCGAINGN1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINGN1_Struct
 *! \brief  ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN1_t__
typedef struct _ADI_AFE_ADCGAINGN1_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration PGA Gain 1x */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINGN1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN1_t__ */

/*@}*/

/** @defgroup ADCOFFSETGN1 ADC Offset Calibration Auxiliary Channel (PGA Gain=1) (ADCOFFSETGN1) Register
 *  ADC Offset Calibration Auxiliary Channel (PGA Gain=1) (ADCOFFSETGN1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETGN1_Struct
 *! \brief  ADC Offset Calibration Auxiliary Channel (PGA Gain=1) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN1_t__
typedef struct _ADI_AFE_ADCOFFSETGN1_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Gain1 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETGN1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN1_t__ */

/*@}*/

/** @defgroup DACGAIN DACGAIN (DACGAIN) Register
 *  DACGAIN (DACGAIN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DACGAIN_Struct
 *! \brief  DACGAIN Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACGAIN_t__
typedef struct _ADI_AFE_DACGAIN_t {
  union {
    struct {
      uint32_t VALUE      : 12;  /**< HS DAC Gain Correction Factor */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACGAIN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACGAIN_t__ */

/*@}*/

/** @defgroup DACOFFSETATTEN DAC Offset with Attenuator Enabled (LP Mode) (DACOFFSETATTEN) Register
 *  DAC Offset with Attenuator Enabled (LP Mode) (DACOFFSETATTEN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DACOFFSETATTEN_Struct
 *! \brief  DAC Offset with Attenuator Enabled (LP Mode) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETATTEN_t__
typedef struct _ADI_AFE_DACOFFSETATTEN_t {
  union {
    struct {
      uint32_t VALUE      : 12;  /**< DAC Offset Correction Factor */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACOFFSETATTEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETATTEN_t__ */

/*@}*/

/** @defgroup DACOFFSET DAC Offset with Attenuator Disabled (LP Mode) (DACOFFSET) Register
 *  DAC Offset with Attenuator Disabled (LP Mode) (DACOFFSET) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DACOFFSET_Struct
 *! \brief  DAC Offset with Attenuator Disabled (LP Mode) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSET_t__
typedef struct _ADI_AFE_DACOFFSET_t {
  union {
    struct {
      uint32_t VALUE      : 12;  /**< DAC Offset Correction Factor */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACOFFSET_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSET_t__ */

/*@}*/

/** @defgroup ADCGAINGN1P5 ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5) (ADCGAINGN1P5) Register
 *  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5) (ADCGAINGN1P5) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINGN1P5_Struct
 *! \brief  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN1P5_t__
typedef struct _ADI_AFE_ADCGAINGN1P5_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration PGA Gain 1.5x */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINGN1P5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN1P5_t__ */

/*@}*/

/** @defgroup ADCGAINGN2 ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2) (ADCGAINGN2) Register
 *  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2) (ADCGAINGN2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINGN2_Struct
 *! \brief  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN2_t__
typedef struct _ADI_AFE_ADCGAINGN2_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration PGA Gain 2x */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINGN2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN2_t__ */

/*@}*/

/** @defgroup ADCGAINGN4 ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4) (ADCGAINGN4) Register
 *  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4) (ADCGAINGN4) Register.
 *  @{
 */

