analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINGN4_Struct
 *! \brief  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN4_t__
typedef struct _ADI_AFE_ADCGAINGN4_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration PGA Gain 4x */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINGN4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN4_t__ */

/*@}*/

/** @defgroup ADCPGAOFFSETCANCEL ADC Offset Cancellation (Optional) (ADCPGAOFFSETCANCEL) Register
 *  ADC Offset Cancellation (Optional) (ADCPGAOFFSETCANCEL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCPGAOFFSETCANCEL_Struct
 *! \brief  ADC Offset Cancellation (Optional) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCPGAOFFSETCANCEL_t__
typedef struct _ADI_AFE_ADCPGAOFFSETCANCEL_t {
  union {
    struct {
      uint32_t OFFSETCANCEL : 15;  /**< Offset Cancellation */
      uint32_t reserved15   : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCPGAOFFSETCANCEL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCPGAOFFSETCANCEL_t__ */

/*@}*/

/** @defgroup ADCGNHSTIA ADC Gain Calibration for HS TIA Channel (ADCGNHSTIA) Register
 *  ADC Gain Calibration for HS TIA Channel (ADCGNHSTIA) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGNHSTIA_Struct
 *! \brief  ADC Gain Calibration for HS TIA Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNHSTIA_t__
typedef struct _ADI_AFE_ADCGNHSTIA_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Error Calibration HS TIA Channel */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGNHSTIA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNHSTIA_t__ */

/*@}*/

/** @defgroup ADCOFFSETLPTIA0 ADC Offset Calibration ULP-TIA0 Channel (ADCOFFSETLPTIA0) Register
 *  ADC Offset Calibration ULP-TIA0 Channel (ADCOFFSETLPTIA0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETLPTIA0_Struct
 *! \brief  ADC Offset Calibration ULP-TIA0 Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETLPTIA0_t__
typedef struct _ADI_AFE_ADCOFFSETLPTIA0_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration for ULP-TIA0 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETLPTIA0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETLPTIA0_t__ */

/*@}*/

/** @defgroup ADCGNLPTIA0 ADC GAIN Calibration for LP TIA0 Channel (ADCGNLPTIA0) Register
 *  ADC GAIN Calibration for LP TIA0 Channel (ADCGNLPTIA0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGNLPTIA0_Struct
 *! \brief  ADC GAIN Calibration for LP TIA0 Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNLPTIA0_t__
typedef struct _ADI_AFE_ADCGNLPTIA0_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Error Calibration ULPTIA0 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGNLPTIA0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNLPTIA0_t__ */

/*@}*/

/** @defgroup ADCPGAGN4OFCAL ADC Gain Calibration with DC Cancellation(PGA G=4) (ADCPGAGN4OFCAL) Register
 *  ADC Gain Calibration with DC Cancellation(PGA G=4) (ADCPGAGN4OFCAL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCPGAGN4OFCAL_Struct
 *! \brief  ADC Gain Calibration with DC Cancellation(PGA G=4) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCPGAGN4OFCAL_t__
typedef struct _ADI_AFE_ADCPGAGN4OFCAL_t {
  union {
    struct {
      uint32_t ADCGAINAUX : 15;  /**< DC Calibration Gain=4 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCPGAGN4OFCAL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCPGAGN4OFCAL_t__ */

/*@}*/

/** @defgroup ADCGAINGN9 ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9) (ADCGAINGN9) Register
 *  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9) (ADCGAINGN9) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINGN9_Struct
 *! \brief  ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN9_t__
typedef struct _ADI_AFE_ADCGAINGN9_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration PGA Gain 9x */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINGN9_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINGN9_t__ */

/*@}*/

/** @defgroup ADCOFFSETEMPSENS1 ADC Offset Calibration  Temp Sensor Channel 1 (ADCOFFSETEMPSENS1) Register
 *  ADC Offset Calibration  Temp Sensor Channel 1 (ADCOFFSETEMPSENS1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETEMPSENS1_Struct
 *! \brief  ADC Offset Calibration  Temp Sensor Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETEMPSENS1_t__
typedef struct _ADI_AFE_ADCOFFSETEMPSENS1_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Temp Sensor */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETEMPSENS1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETEMPSENS1_t__ */

/*@}*/

/** @defgroup ADCGAINTEMPSENS1 ADC Gain Calibration Temperature Sensor Channel (ADCGAINTEMPSENS1) Register
 *  ADC Gain Calibration Temperature Sensor Channel (ADCGAINTEMPSENS1) Register.
 *  @{
 */

