analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_ADCGAINTEMPSENS1_Struct
 *! \brief  ADC Gain Calibration Temperature Sensor Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINTEMPSENS1_t__
typedef struct _ADI_AFE_ADCGAINTEMPSENS1_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Gain Calibration for Diode Temp Sensor */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGAINTEMPSENS1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGAINTEMPSENS1_t__ */

/*@}*/

/** @defgroup DACOFFSETATTENHP DAC Offset with Attenuator Enabled (HP Mode) (DACOFFSETATTENHP) Register
 *  DAC Offset with Attenuator Enabled (HP Mode) (DACOFFSETATTENHP) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DACOFFSETATTENHP_Struct
 *! \brief  DAC Offset with Attenuator Enabled (HP Mode) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETATTENHP_t__
typedef struct _ADI_AFE_DACOFFSETATTENHP_t {
  union {
    struct {
      uint32_t VALUE      : 12;  /**< DAC Offset Correction Factor */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACOFFSETATTENHP_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETATTENHP_t__ */

/*@}*/

/** @defgroup DACOFFSETHP DAC Offset with Attenuator Disabled (HP Mode) (DACOFFSETHP) Register
 *  DAC Offset with Attenuator Disabled (HP Mode) (DACOFFSETHP) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_DACOFFSETHP_Struct
 *! \brief  DAC Offset with Attenuator Disabled (HP Mode) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETHP_t__
typedef struct _ADI_AFE_DACOFFSETHP_t {
  union {
    struct {
      uint32_t VALUE      : 12;  /**< DAC Offset Correction Factor */
      uint32_t reserved12 : 20;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_DACOFFSETHP_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_DACOFFSETHP_t__ */

/*@}*/

/** @defgroup ADCOFFSETLPTIA1 ADC Offset Calibration LP TIA1 Channel (ADCOFFSETLPTIA1) Register
 *  ADC Offset Calibration LP TIA1 Channel (ADCOFFSETLPTIA1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETLPTIA1_Struct
 *! \brief  ADC Offset Calibration LP TIA1 Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETLPTIA1_t__
typedef struct _ADI_AFE_ADCOFFSETLPTIA1_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration for ULP-TIA1 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETLPTIA1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETLPTIA1_t__ */

/*@}*/

/** @defgroup ADCGNLPTIA1 ADC GAIN Calibration for LP TIA1 Channel (ADCGNLPTIA1) Register
 *  ADC GAIN Calibration for LP TIA1 Channel (ADCGNLPTIA1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCGNLPTIA1_Struct
 *! \brief  ADC GAIN Calibration for LP TIA1 Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNLPTIA1_t__
typedef struct _ADI_AFE_ADCGNLPTIA1_t {
  union {
    struct {
      uint32_t ULPTIA1GN  : 15;  /**< Gain Calibration ULP-TIA1 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCGNLPTIA1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCGNLPTIA1_t__ */

/*@}*/

/** @defgroup ADCOFFSETGN2 Offset Calibration Auxiliary Channel (PGA Gain =2) (ADCOFFSETGN2) Register
 *  Offset Calibration Auxiliary Channel (PGA Gain =2) (ADCOFFSETGN2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETGN2_Struct
 *! \brief  Offset Calibration Auxiliary Channel (PGA Gain =2) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN2_t__
typedef struct _ADI_AFE_ADCOFFSETGN2_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Auxiliary Channel (PGA Gain =2) */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETGN2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN2_t__ */

/*@}*/

/** @defgroup ADCOFFSETGN1P5 Offset Calibration Auxiliary Channel (PGA Gain =1.5) (ADCOFFSETGN1P5) Register
 *  Offset Calibration Auxiliary Channel (PGA Gain =1.5) (ADCOFFSETGN1P5) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETGN1P5_Struct
 *! \brief  Offset Calibration Auxiliary Channel (PGA Gain =1.5) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN1P5_t__
typedef struct _ADI_AFE_ADCOFFSETGN1P5_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Gain1.5 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETGN1P5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN1P5_t__ */

/*@}*/

/** @defgroup ADCOFFSETGN9 Offset Calibration Auxiliary Channel (PGA Gain =9) (ADCOFFSETGN9) Register
 *  Offset Calibration Auxiliary Channel (PGA Gain =9) (ADCOFFSETGN9) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETGN9_Struct
 *! \brief  Offset Calibration Auxiliary Channel (PGA Gain =9) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN9_t__
typedef struct _ADI_AFE_ADCOFFSETGN9_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Gain9 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETGN9_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN9_t__ */

/*@}*/

/** @defgroup ADCOFFSETGN4 Offset Calibration Auxiliary Channel (PGA Gain =4) (ADCOFFSETGN4) Register
 *  Offset Calibration Auxiliary Channel (PGA Gain =4) (ADCOFFSETGN4) Register.
 *  @{
 */

