analogdevicesinc/aducm355-examples/inc/ADuCM355_typedefs.h
/* ==========================================================================
 *! \struct ADI_AFE_ADCOFFSETGN4_Struct
 *! \brief  Offset Calibration Auxiliary Channel (PGA Gain =4) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN4_t__
typedef struct _ADI_AFE_ADCOFFSETGN4_t {
  union {
    struct {
      uint32_t VALUE      : 15;  /**< Offset Calibration Gain4 */
      uint32_t reserved15 : 17;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCOFFSETGN4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_ADCOFFSETGN4_t__ */

/*@}*/

/** @defgroup PMBW Power Mode Configuration (PMBW) Register
 *  Power Mode Configuration (PMBW) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_PMBW_SYSHP
 *! \brief  Set High Speed DAC and ADC in High Power Mode (SYSHP) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_PMBW_LP = 0,  /**< LP mode */
  AFE_PMBW_HP = 1   /**< HP mode */
} ADI_AFE_PMBW_SYSHP;


/*  =========================================================================
 *! \enum   ADI_AFE_PMBW_SYSBW
 *! \brief  Configure System Bandwidth (SYSBW) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_PMBW_BWNA  = 0,  /**< no action for system configuration */
  AFE_PMBW_BW50  = 1,  /**< 50kHz -3dB bandwidth               */
  AFE_PMBW_BW100 = 2,  /**< 100kHz -3dB bandwidth              */
  AFE_PMBW_BW250 = 3   /**< 250kHz -3dB bandwidth              */
} ADI_AFE_PMBW_SYSBW;


/* ==========================================================================
 *! \struct ADI_AFE_PMBW_Struct
 *! \brief  Power Mode Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_PMBW_t__
typedef struct _ADI_AFE_PMBW_t {
  union {
    struct {
      uint32_t SYSHP      :  1;  /**< Set High Speed DAC and ADC in High Power Mode */
      uint32_t reserved1  :  1;
      uint32_t SYSBW      :  2;  /**< Configure System Bandwidth */
      uint32_t reserved4  : 28;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_PMBW_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_PMBW_t__ */

/*@}*/

/** @defgroup SWMUX Switch Mux for ECG (SWMUX) Register
 *  Switch Mux for ECG (SWMUX) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_SWMUX_Struct
 *! \brief  Switch Mux for ECG Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_SWMUX_t__
typedef struct _ADI_AFE_SWMUX_t {
  union {
    struct {
      uint32_t SWMUX      :  3;  /**< ECG Swmux Control */
      uint32_t CMMUX      :  1;  /**< CM Resistor Select for Ain2, Ain3 */
      uint32_t reserved4  : 28;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_SWMUX_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_SWMUX_t__ */

/*@}*/

/** @defgroup TEMPCON1 AFE_TEMPSEN_DIO (TEMPCON1) Register
 *  AFE_TEMPSEN_DIO (TEMPCON1) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_AFE_TEMPCON1_EN
 *! \brief  Test Signal Enable (EN) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_TEMPCON1_ON  = 0,  /**< Turn On  */
  AFE_TEMPCON1_OFF = 1   /**< Turn Off */
} ADI_AFE_TEMPCON1_EN;


/*  =========================================================================
 *! \enum   ADI_AFE_TEMPCON1_PWD
 *! \brief  Power Down Control (PWD) Enumerations
 *  ========================================================================= */
typedef enum
{
  AFE_TEMPCON1_ACTIVE    = 0,  /**<  */
  AFE_TEMPCON1_POWERDOWN = 1   /**<  */
} ADI_AFE_TEMPCON1_PWD;


/* ==========================================================================
 *! \struct ADI_AFE_TEMPCON1_Struct
 *! \brief  AFE_TEMPSEN_DIO Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TEMPCON1_t__
typedef struct _ADI_AFE_TEMPCON1_t {
  union {
    struct {
      uint32_t ISWCON     : 16;  /**< Bias Current Selection */
      uint32_t EN         :  1;  /**< Test Signal Enable */
      uint32_t PWD        :  1;  /**< Power Down Control */
      uint32_t reserved18 : 14;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TEMPCON1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TEMPCON1_t__ */

/*@}*/

/** @defgroup TESTDAC DAC Test (TESTDAC) Register
 *  DAC Test (TESTDAC) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_TESTDAC_Struct
 *! \brief  DAC Test Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TESTDAC_t__
typedef struct _ADI_AFE_TESTDAC_t {
  union {
    struct {
      uint32_t reserved0  :  2;
      uint32_t LPFBYPEN   :  1;  /**< Bypass Low Pass Filter Between Dac and Buffer */
      uint32_t reserved3  : 29;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_TESTDAC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TESTDAC_t__ */

/*@}*/

/** @defgroup ADCBUFCON Configure ADC Input Buffer (ADCBUFCON) Register
 *  Configure ADC Input Buffer (ADCBUFCON) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_AFE_ADCBUFCON_Struct
 *! \brief  Configure ADC Input Buffer Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_ADCBUFCON_t__
typedef struct _ADI_AFE_ADCBUFCON_t {
  union {
    struct {
      uint32_t CHOPDIS    :  4;  /**< Disable Chop */
      uint32_t AMPDIS     :  5;  /**< Disable OpAmp. */
      uint32_t reserved9  : 23;
    };
    uint32_t VALUE32;
  };
} ADI_AFE_ADCBUFCON_t;
